[
  {"TITLE": "Secret Level (2024)",
    "imageUrl": "https://4kwallpapers.com/images/wallpapers/secret-level-prime-3840x2160-19884.jpg",
    "STATUS": "",
    "Series Length": "1 season, 15 episodes",
    "LAST WATCHED": "",
    "OwnerShip": "prime",
    "GENRE": "Science-Fiction, Animation, Action & Adventure, Fantasy, Epic Fantasy",
    "RUNTIME": "00:15",
    "Max Episodes": "10 weeks, 20 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/secret-level",
    "DESCRIPTION": "\"Secret Level,\" a 2024 animated anthology series available on Prime Video, dives deep into the lore of some of the most iconic video game franchises. This series presents fifteen distinct, standalone stories that explore the rich histories and captivating universes of legendary games. From the classic maze-chase of Pac-Man to the grim, war-torn future of Warhammer 40,000 and the mech-based combat of Armored Core, each episode offers a unique narrative journey into beloved video game worlds.\n\nCrafted with vivid imagination and thrilling action, \"Secret Level\" comes from the creators known for the acclaimed animated series \"Love, Death & Robots,\" suggesting a similar level of high-quality animation and mature storytelling. Each fifteen-minute episode promises to unravel untold tales and offer fresh perspectives on familiar game universes, appealing to both long-time fans and those curious about the deeper narratives within gaming history. Prepare for a visually stunning and narratively engaging exploration of video game lore unlike anything seen before.\""
  },
  {"TITLE": "7Seeds (2019)",
    "imageUrl": "https://images.justwatch.com/backdrop/319480290/s1440/7seeds.avif",
    "STATUS": "",
    "Series Length": "2 season, 24 episodes",
    "LAST WATCHED": "",
    "OwnerShip": "Netflix",
    "GENRE": "Animation, Science-Fiction, Drama, Action & Adventure, Horror, Romance, Classic Japanese Anime",
    "RUNTIME": "24min",
    "Max Episodes": "10 weeks, 20 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/7seeds",
    "DESCRIPTION": "\"7Seeds\" is a Japanese science fiction anime series that premiered on Netflix in 2019, based on the long-running manga of the same name by Yumi Tamura. Set in a post-apocalyptic future, the story follows several groups of young people who were cryogenically preserved to ensure humanity's survival after a devastating meteor strike wipes out most life on Earth. Upon awakening, they find themselves in a drastically changed Japan, facing unfamiliar flora, fauna, and the harsh realities of a world struggling to rebuild.\n\nThe narrative is divided into multiple teams, each designated by a season (Spring, Summer A, Summer B, Autumn, and Winter), who awaken at different times and in different locations. They must learn to survive in this new environment, contend with dangerous creatures and natural disasters, and navigate the complexities of human relationships under extreme pressure. Each group comprises seven individuals, selected for their unique skills and potential, and they are guided by cryptic instructions left behind by the project's creators. As the series progresses, the different groups encounter each other, and the mysteries surrounding the 7Seeds project and the cataclysmic event that led to it begin to unravel.\n\n\"7Seeds\" is known for its focus on survival, the resilience of the human spirit, and the intricate backstories of its large ensemble cast. The anime adaptation, produced by Gonzo, was released in two parts in 2019 and 2020. While the anime stays relatively faithful to the source material, some fans noted differences in pacing and adaptation choices. The series explores themes of adaptation, loss, hope, and the cyclical nature of life and death in a beautifully rendered, yet often brutal, post-apocalyptic world. The manga itself was highly acclaimed in Japan, winning the Shogakukan Manga Award for shōjo in 2003, and its anime adaptation brought this compelling story to a global audience."
  },
  {"TITLE": "Aggretsuko (2018)",
    "imageUrl": "https://images.justwatch.com/backdrop/303645569/s1440/aggretsuko.avif",
    "STATUS": "",
    "Series Length": "1 season, 50 episodes",
    "LAST WATCHED": "Netflix",
    "OwnerShip": "Subscription",
    "GENRE": "Animation, Comedy, Music & Musical, Romance, Drama, Classic Japanese Anime",
    "RUNTIME": "00:17",
    "Max Episodes": "10 weeks, 20 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/aggretsuko",
    "DESCRIPTION": "\"Aggretsuko,\" which premiered in 2018, is a Japanese anime series that offers a unique blend of comedy, drama, and musical elements, all centered around Retsuko, a relatable red panda navigating the frustrations of office life. Created by Sanrio, the company behind Hello Kitty, this series presents a seemingly cute protagonist who harbors a powerful secret: her way of coping with the daily grind is through intense death metal karaoke sessions after work.\n\nEach seventeen-minute episode delves into the mundane yet often maddening realities of Retsuko's existence as an office worker in Tokyo. She faces demanding superiors, annoying colleagues, and the general pressures of societal expectations. The series cleverly uses Retsuko's death metal outbursts as a cathartic release, with the lyrics of her songs often reflecting her true feelings and frustrations that she keeps bottled up during the day. While the premise is humorous, \"Aggretsuko\" also explores deeper themes of workplace stress, the challenges of adulthood, the search for identity, and the complexities of relationships, including romantic pursuits.\n\nWith its distinctive animation style and engaging storylines, \"Aggretsuko\" has garnered international acclaim for its witty social commentary and its endearing portrayal of a character trying to find her place in the world. The series manages to be both funny and poignant, resonating with audiences who have experienced the trials and tribulations of modern working life. Its blend of slice-of-life scenarios with energetic musical numbers makes it a truly original and captivating watch, available for streaming on Netflix.\""
  },
  {"TITLE": "Arcane (2021)",
    "imageUrl": "https://images.justwatch.com/backdrop/322370212/s1440/arcane.avif",
    "STATUS": "🟢",
    "Series Length": "2 season, 9 episodes",
    "LAST WATCHED": "se2",
    "OwnerShip": "Netflix",
    "GENRE": "Animation, Action & Adventure, Drama, Fantasy, Science-Fiction, Video Game, Modern Anime",
    "RUNTIME": "00:41",
    "Max Episodes": "10 weeks, 10 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/arcane",
    "DESCRIPTION": "\"Arcane,\" which debuted in 2021, is a visually stunning and narratively rich animated series that delves into the complex relationship between the opulent, progressive city of Piltover and its oppressed, subterranean undercity of Zaun. Set in the world of Riot Games' popular video game \"League of Legends,\" the series primarily follows the intertwined destinies of two sisters, Vi and Jinx, as they find themselves on opposing sides of a brewing conflict. This war is fueled by the burgeoning integration of magic and technology in Piltover and the stark social and economic disparities that plague Zaun.\n\nPraised for its breathtaking animation style, intricate storytelling, and well-developed characters, \"Arcane\" transcends its video game origins to deliver a compelling drama that explores themes of family, loyalty, social injustice, and the consequences of scientific advancement. The series garnered critical acclaim for its emotional depth, sophisticated writing, and its ability to appeal to both fans of the game and newcomers alike. Its first season was widely celebrated, earning numerous awards and a dedicated fanbase. The ongoing narrative continues to unfold, promising further exploration of the dynamic and volatile world of Piltover and Zaun and the fates of its compelling inhabitants, making it a standout in modern animated storytelling available on Netflix.\""
  },
  {"TITLE": "Blue Eye Samurai (2023)",
    "imageUrl": "https://images.justwatch.com/backdrop/308675996/s1440/blue-eye-samurai.avif",
    "STATUS": "",
    "Series Length": "1 season, 8 episodes",
    "LAST WATCHED": "",
    "OwnerShip": "Netflix",
    "GENRE": "Mystery & Thriller, Animation, Drama, History, Action Adventure",
    "RUNTIME": "00:47",
    "Max Episodes": "10 weeks, 10 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/blue-eye-samurai",
    "DESCRIPTION": "\"Blue Eye Samurai,\" a visually striking animated series that premiered in 2023, transports viewers to Edo-period Japan, a time of intricate social hierarchies and deep-seated traditions. At the heart of the story is a young, formidable warrior driven by an all-consuming quest for revenge. This outcast seeks retribution against those responsible for her existence as an anomaly in a society that fiercely adheres to its own customs.\n\nSet against the backdrop of historical Japan, the series weaves together elements of mystery, thriller, and action-adventure with dramatic undertones. The animation is lauded for its artistic style and fluid action sequences, immersing the audience in a world of samurai, sword fights, and hidden agendas. As the blue-eyed warrior carves a bloody path towards her destiny, the narrative explores themes of identity, belonging, and the consequences of societal prejudice. The series has been praised for its compelling protagonist, its mature storytelling, and its ability to blend historical setting with a gripping tale of vengeance, making it a standout animated offering on Netflix for those who appreciate a blend of action, drama, and historical intrigue.\""
  },
  {"TITLE": "Cowboy Bebop (1998)",
    "imageUrl": "https://images.justwatch.com/backdrop/130957793/s1440/cowboy-bebop-2001.avif",
    "STATUS": "",
    "Series Length": "1 season, 24 episodes",
    "LAST WATCHED": "se1",
    "OwnerShip": "Hulu",
    "GENRE": "Animation, Action & Adventure, Science-Fiction, Western, Comedy, Drama, Classic Japanese Anime",
    "RUNTIME": "00:25",
    "Max Episodes": "10 weeks, 20 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/cowboy-bebop-2001",
    "DESCRIPTION": "\"Cowboy Bebop,\" a highly influential and critically acclaimed anime series that first aired in 1998, is set in the year 2071, a time when humanity has expanded across the solar system following a cataclysmic event on Earth. With crime on the rise in the vast expanse of space, the Inter Solar System Police (ISSP) has established a bounty hunter system, licensing individuals known as 'Cowboys' to bring in criminals for rewards.\n\nThe series follows the adventures of a ragtag crew aboard the spaceship Bebop: the laid-back and enigmatic Spike Spiegel, the honorable former ISSP officer Jet Black, the skilled but amnesiac con artist Faye Valentine, the eccentric and highly intelligent corgi Ein, and the quirky teenage hacker Radical Edward. Each episode often presents a self-contained story focusing on a particular bounty, but overarching narratives and character backstories gradually unfold throughout the series. Blending elements of science fiction, Westerns, film noir, and comedy with a distinctive jazz-infused soundtrack, \"Cowboy Bebop\" is celebrated for its stylish animation, complex characters, philosophical themes, and its unique tone that effortlessly shifts between action, humor, and poignant drama. This landmark anime, available on Hulu, remains a beloved classic for its innovative storytelling and lasting impact on popular culture.\""
  },
  {"TITLE": "Common Side Effects (2025)",
    "IMAGE_URL": "https://beam-images.warnermediacdn.com/BEAM_LWM_DELIVERABLES/eaa21376-a54d-4245-95d6-a86dce6313c8/83cd5eb5-d9e4-11ef-b983-1212e16ae493?host=wbd-images.prod-vod.h264.io&partner=beamcom",
    "STATUS": "",
    "SERIES_LENGTH": "1 season, 10 episodes",
    "LAST_WATCHED": "",
    "OWNERSHIP": "Hulu",
    "GENRE": "Crime, Drama, Mystery, Thriller, Comedy, Dramedy",
    "RUNTIME": "00:35",
    "MAX_EPISODES": "10 weeks, 20 episodes",
    "LINK": "https://www.justwatch.com/us/tv-show/only-murders-in-the-building",
    "DESCRIPTION": "\"Common Side Effects,\" a Hulu original series that premiered in 2025, masterfully blends elements of crime, drama, mystery, thriller, and comedy into a compelling dramedy. Across its initial 10-episode season, the show navigates a complex narrative, promising unexpected twists and turns characteristic of the mystery and thriller genres, while injecting moments of dark humor and poignant drama. With a runtime of approximately 35 minutes per episode, it offers a tightly paced viewing experience. Though specific details about the plot, cast, and creators remain under wraps, the series' diverse genre classification suggests a narrative that will likely keep audiences guessing, balancing suspense with lighter, character-driven moments. Given its availability on Hulu, it aligns with the platform's reputation for delivering high-quality, engaging original content that often garners critical attention and viewership.\""
  }
  {"TITLE": "Cyberpunk: Edgerunners (2022)",
    "imageUrl": "https://images.justwatch.com/backdrop/296653766/s1440/cyberpunk-edgerunners.avif",
    "STATUS": "",
    "Series Length": "1 season, 10 episodes",
    "LAST WATCHED": "se1",
    "OwnerShip": "Netflix",
    "GENRE": "Action & Adventure, Animation, Science-Fiction, Cyberpunk, Drama, Modern Anime",
    "RUNTIME": "00:30",
    "Max Episodes": "10 weeks, 20 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/cyberpunk-edgerunners",
    "DESCRIPTION": "\"Cyberpunk: Edgerunners,\" a 2022 anime series available on Netflix, plunges viewers into the gritty, neon-drenched metropolis of Night City, a place defined by stark inequality and corporate dominance. The story centers on David Martinez, a young and ambitious inhabitant of this unforgiving urban landscape. Following a personal tragedy, David makes the drastic decision to become an 'Edgerunner' – a mercenary outlaw who enhances their body with cybernetic 'speedware' and operates outside the law.\n\nSet within the universe of CD Projekt Red's video game \"Cyberpunk 2077,\" the series explores a society where body modification and advanced technology are commonplace, often used to widen the gap between the wealthy elite and the struggling masses. David's journey sees him embrace the dangerous life of a 'Cyberpunk,' utilizing his enhanced abilities to carve out a path to escape Night City's clutches. He finds an ally in Lucy, a skilled 'Netrunner' who introduces him to the criminal underworld and becomes a crucial partner in his endeavors. Together, they navigate the treacherous landscape of Night City, where survival as a Cyberpunk requires not only strength and technology but also the bonds of camaraderie in a world where trust is a rare commodity. \"Cyberpunk: Edgerunners\" is lauded for its stylish animation by Studio Trigger, its intense action, and its compelling narrative that delves into themes of ambition, loss, and the cost of technological advancement in a dystopian future.\""
  },
  {"TITLE": "Eden (2021)",
    "imageUrl": "https://images.justwatch.com/backdrop/245381437/s1440/eden.avif",
    "STATUS": "",
    "Series Length": "1 season, 4 episodes",
    "LAST WATCHED": "se1",
    "OwnerShip": "Netflix",
    "GENRE": "Drama, Science-Fiction, Animation, Reality TV, Action & Adventure, Kids & Family",
    "RUNTIME": "00:25",
    "Max Episodes": "10 weeks, 20 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/eden",
    "DESCRIPTION": "\"Eden,\" a captivating animated series released in 2021 and available on Netflix, transports viewers to a far-flung future where the gleaming metropolis of Eden 3 is solely inhabited by intelligent robots. Millennia have passed since their human creators mysteriously disappeared, fading into what the robots have been programmed to believe are mere ancient myths – forbidden knowledge of a bygone era. The established tranquility of this artificial society is shattered when two unassuming farming robots, during a routine maintenance task, unexpectedly discover a human baby girl held in stasis.\n\nThis astonishing discovery throws into question everything the robots have been taught about the non-existence of humanity. Driven by an inexplicable impulse, the two robots make a momentous decision: they choose to protect the infant and secretly raise her in a secluded sanctuary hidden outside the boundaries of Eden. As the human child grows, the robots must navigate the uncharted territory of parenthood while safeguarding their secret from the rest of the robotic population. \"Eden\" explores profound themes of artificial intelligence, the essence of humanity, and the unexpected bonds of family that can form in the most unconventional circumstances. With its intriguing premise and endearing characters, this four-episode series offers a poignant and imaginative tale of compassion, rebellion, and the enduring power of connection in a world where the past holds secrets that could redefine the future.\""
  },
  {"TITLE": "ERASED (2016)",
    "imageUrl": "https://images.justwatch.com/backdrop/192686192/s1440/erased.avif",
    "STATUS": "",
    "Series Length": "1 season, 12 episodes",
    "LAST WATCHED": "se1",
    "OwnerShip": "Hulu",
    "GENRE": "Drama, Mystery & Thriller, Animation, Crime, Fantasy, Science-Fiction, Modern Anime",
    "RUNTIME": "30min",
    "Max Episodes": "10 weeks, 20 episodes",
    "Link": "22min",
    "DESCRIPTION": "Satoru Fujinuma is a struggling manga artist who has the ability to turn back time and prevent deaths. When his mother is killed he turns back time to solve the mystery, but ends up back in elementary school, just before the disappearance of his classmate Kayo."
  },
  {"TITLE": "ERASED (2016)",
    "imageUrl": "https://images.justwatch.com/backdrop/192686192/s1440/erased.avif",
    "STATUS": "",
    "Series Length": "1 season, 12 episodes",
    "LAST WATCHED": "se1",
    "OwnerShip": "Hulu",
    "GENRE": "Drama, Mystery & Thriller, Animation, Crime, Fantasy, Science-Fiction, Modern Anime",
    "RUNTIME": "00:30",
    "Max Episodes": "10 weeks, 20 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/erased",
    "DESCRIPTION": "\"ERASED,\" also known by its Japanese title \"Boku dake ga Inai Machi\" (The Town Where Only I Am Missing), is a gripping 2016 anime series that masterfully blends elements of drama, mystery, and supernatural suspense. The story centers on Satoru Fujinuma, a young and struggling manga artist who possesses a remarkable and often burdensome ability called 'Revival.' This power allows him to involuntarily travel back in time to prevent life-threatening accidents from occurring around him.\n\nSatoru's life takes a dramatic and tragic turn when his mother is brutally murdered. In his desperation to prevent this horrific event, his Revival ability triggers, unexpectedly sending him back not just moments, but eighteen years into the past – to his elementary school days. Trapped in his younger body, Satoru realizes that the key to solving his mother's murder in the future is somehow connected to the disappearance and potential death of one of his classmates, the quiet and enigmatic Kayo Hinazuki. He must now navigate the complexities of his childhood, befriend Kayo, and unravel a chilling mystery that spans across two timelines. As Satoru races against time in his past to change the future, 'ERASED' delivers a compelling narrative filled with suspense, emotional depth, and unexpected twists, making it a standout in the realm of modern anime available on Hulu.\""
  },
  {"TITLE": "Hunter × Hunter (1999)",
    "imageUrl": "https://images.justwatch.com/backdrop/245296073/s1440/hunter-x-hunter.avif",
    "STATUS": "",
    "Series Length": "4 season, 14 episodes",
    "LAST WATCHED": "",
    "OwnerShip": "prime",
    "GENRE": "Animation, Comedy, Drama, Science-Fiction, Action & Adventure, Fantasy, Classic Japanese Anime",
    "RUNTIME": "00:23",
    "Max Episodes": "10 weeks, 10 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/hunter-x-hunter",
    "DESCRIPTION": "\"Hunter × Hunter,\" which premiered in 1999, is the first anime adaptation of Yoshihiro Togashi's popular manga series. The story centers around Gon Freecss, a spirited young boy living on Whale Island who makes a life-altering discovery: his father, Ging, whom he believed to be deceased, is actually a world-renowned 'Hunter' – an elite individual who has passed a rigorous and dangerous examination to become a member of a distinguished organization. Hunters are licensed to track down treasures, rare beasts, and even other men.\n\nDespite having been raised by his aunt Mito and told his father was gone, Gon is inspired by this revelation and becomes determined to follow in Ging's footsteps. He embarks on a journey to take the challenging Hunter Examination himself, hoping that it will eventually lead him to reunite with his elusive father. Along the way, Gon befriends other aspiring Hunters, including the intelligent and analytical Kurapika, the mischievous and skilled Leorio, and the enigmatic and powerful Killua, a former assassin from a family of legendary killers. Together, they face perilous trials, encounter fascinating creatures and individuals, and uncover the vast and often dangerous world of Hunters. This initial adaptation of \"Hunter × Hunter,\" available on Prime Video, lays the foundation for an epic adventure filled with action, humor, heartfelt moments, and the enduring quest of a son seeking his father.\""
  },
  {"TITLE": "Invincible (2021)",
    "imageUrl": "https://images.justwatch.com/backdrop/309279814/s1440/invincible.avif",
    "STATUS": "🟢",
    "Series Length": "3 seasons, 8 episodes",
    "LAST WATCHED": "se1",
    "OwnerShip": "prime",
    "GENRE": "Action & Adventure, Drama, Animation, Science-Fiction, Fantasy, Mystery & Thriller",
    "RUNTIME": "01:00",
    "Max Episodes": "10 weeks, 10 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/invincible",
    "DESCRIPTION": "\"Invincible,\" which premiered in 2021, is a critically acclaimed adult animated superhero series that offers a fresh and often brutal take on the genre. The story centers on Mark Grayson, a seemingly ordinary 17-year-old who happens to be the son of Omni-Man, the most powerful superhero on Earth. As Mark begins to develop his own superpowers, he eagerly starts down the path of becoming a hero himself, eager to follow in his father's legendary footsteps.\n\nHowever, Mark's journey to becoming a fully-fledged superhero is far from straightforward. While learning to harness his abilities, he grapples with the typical challenges of adolescence alongside the extraordinary demands of superheroism. Adding to the complexity is the looming presence of his father, whose heroic image begins to crack as Mark uncovers unsettling truths about his lineage and the true nature of his father's mission on Earth. \"Invincible\" stands out for its compelling characters, its mature themes, its surprising plot twists, and its willingness to explore the darker and more realistic consequences of superpowers. Available on Prime Video, this series delivers a thrilling and emotionally resonant narrative that subverts traditional superhero tropes while delivering plenty of action and suspense.\""
  },
  {"TITLE": "Jujutsu Kaisen (2020)",
    "imageUrl": "https://images.justwatch.com/backdrop/297814126/s1440/jujutsu-kaisen.avif",
    "STATUS": "",
    "Series Length": "1 season, 24 episodes",
    "LAST WATCHED": "",
    "OwnerShip": "Netflix",
    "GENRE": "Fantasy, Mystery & Thriller, Animation, Action & Adventure, Science-Fiction, Classic Japanese Anime",
    "RUNTIME": "00:24",
    "Max Episodes": "10 weeks, 20 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/jujutsu-kaisen",
    "DESCRIPTION": "\"Jujutsu Kaisen,\" which premiered in 2020, is a thrilling anime series that plunges into a world where cursed spirits feed on unsuspecting humans, and sorcerers known as Jujutsu Sorcerers are humanity's only hope against these malevolent entities. The story follows Yuji Itadori, an unusually athletic high school student who lives a relatively normal life until a fateful encounter with a cursed talisman – a finger belonging to the powerful and malevolent demon Ryomen Sukuna. In a desperate attempt to protect his friends, Yuji swallows the finger, becoming the host of this formidable curse himself.\n\nDespite being inhabited by a dangerous demon, Yuji retains control of his body, a phenomenon that attracts the attention of the Jujutsu Sorcerers. He is brought to Tokyo Prefectural Jujutsu High School, a secret institution that trains sorcerers to combat cursed spirits. To ultimately exorcise himself of Sukuna's curse and protect others, Yuji must embark on a perilous journey to locate and consume all of Sukuna's remaining fingers. Along the way, he trains alongside fellow students Megumi Fushiguro and Nobara Kugisaki under the guidance of the enigmatic and powerful sorcerer Satoru Gojo, facing increasingly powerful curses and uncovering the dark secrets of the Jujutsu world. Available on Netflix, \"Jujutsu Kaisen\" is celebrated for its dynamic action sequences, compelling characters, intricate power system, and its blend of horror, humor, and intense supernatural battles.\""
  },
  {"TITLE": "Monster (2004)",
    "imageUrl": "https://images.justwatch.com/backdrop/205477137/s1440/monster.avif",
    "STATUS": "",
    "Series Length": "1 season, 74 episodes",
    "LAST WATCHED": "",
    "OwnerShip": "Netflix",
    "GENRE": "Animation, Drama, Crime, Mystery & Thriller, Classic Japanese Anime",
    "RUNTIME": "00:23",
    "Max Episodes": "10 weeks, 20 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/monster",
    "DESCRIPTION": "\"Monster,\" a chilling and critically acclaimed anime series from 2004, follows the life of Kenzou Tenma, a brilliant Japanese neurosurgeon working at Eisler Memorial Hospital in Germany. Dr. Tenma's promising career takes a dark and irreversible turn when he makes a controversial decision to operate on a young boy named Johan Liebert instead of the hospital director, who arrived later but was in a more politically advantageous position.\n\nYears after this fateful surgery, a series of horrific murders begins to occur, and Dr. Tenma finds himself implicated as the prime suspect. As he delves deeper into the mystery, he discovers that the boy he saved, Johan Liebert, has grown into a charismatic yet terrifyingly manipulative psychopath, seemingly responsible for the escalating violence. Haunted by the consequences of his past actions, Dr. Tenma embarks on a relentless pursuit to stop Johan, a journey that forces him to confront the darkest aspects of human nature and question the very value of life. Set against the backdrop of Germany and the former Czechoslovakia, \"Monster\" is a suspenseful and thought-provoking thriller that explores themes of morality, responsibility, and the nature of evil, captivating audiences with its intricate plot and compelling characters. This landmark anime is available for streaming on Netflix.\""
  },
  {"TITLE": "Neon Genesis Evangelion (1995)",
    "imageUrl": "https://images.justwatch.com/backdrop/28515611/s1440/neon-genesis-evangelion.avif",
    "STATUS": "",
    "Series Length": "1 season, 26 episodes",
    "LAST WATCHED": "se1",
    "OwnerShip": "Hulu",
    "GENRE": "Science-Fiction, Animation, Drama, Action & Adventure, Classic Japanese Anime",
    "RUNTIME": "00:24",
    "Max Episodes": "10 weeks, 20 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/neon-genesis-evangelion",
    "DESCRIPTION": "\"Neon Genesis Evangelion,\" a groundbreaking and highly influential anime series that first aired in 1995, is set fifteen years after a cataclysmic event known as the Second Impact devastated the world. The story unfolds in the heavily fortified city of Tokyo-3, where humanity faces the constant threat of colossal, enigmatic beings called Angels. The protagonist is Shinji Ikari, a reluctant and emotionally withdrawn teenager who is suddenly summoned by his estranged father, Gendo Ikari, the head of the special agency Nerv.\n\nShinji is thrust into the role of a pilot for a giant, bio-mechanical humanoid weapon called an Evangelion – humanity's last hope against the Angels. Alongside other teenage pilots, the headstrong Asuka Langley Soryu and the mysterious Rei Ayanami, Shinji must confront not only the terrifying Angels but also his own inner demons and the complex secrets surrounding Nerv and the true purpose of the Evangelions. \"Neon Genesis Evangelion\" is celebrated for its deep psychological exploration of its characters, its philosophical and existential themes, its stunning animation, and its deconstruction of the mecha genre. Available on Hulu, this series remains a landmark achievement in anime, sparking countless discussions and leaving a lasting impact on popular culture.\""
  },
  {"TITLE": "Pluto (2023)",
    "imageUrl": "https://images.justwatch.com/backdrop/308655058/s1440/pluto.avif",
    "STATUS": "",
    "Series Length": "1 season, 8 episodes",
    "LAST WATCHED": "se1",
    "OwnerShip": "Netflix",
    "GENRE": "Crime, Animation, Science-Fiction, Mystery & Thriller, Drama, Action & Adventure, Classic Japanese Anime",
    "RUNTIME": "01:02",
    "Max Episodes": "10 weeks, 10 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/pluto",
    "DESCRIPTION": "\"Pluto,\" a compelling animated series that premiered in 2023, unfolds in a sophisticated futuristic world where sentient humanoid robots coexist peacefully with their human counterparts. The delicate balance of this society is shattered when Montblanc, a highly decorated and beloved robot war veteran, is found murdered. Gesicht, a Europol detective who is himself an advanced humanoid robot, is assigned to investigate this unprecedented crime.\n\nAs Gesicht delves into the perplexing mystery, he uncovers a chilling pattern: other celebrated robots, all part of an elite group known as the 'Seven Strongest Robots in the World,' are also being targeted. His investigation leads him down a dark and intricate path, forcing him to confront profound questions about the nature of artificial intelligence, consciousness, and the potential for both great good and unspeakable evil within artificial beings. Based on a manga by Naoki Urasawa, which itself was inspired by Osamu Tezuka's classic 'Astro Boy' story 'The Greatest Robot on Earth,' 'Pluto' is a masterfully crafted thriller that blends elements of crime noir, science fiction, and philosophical drama, keeping viewers on the edge of their seats as the mystery unfolds. Available on Netflix, this series offers a thought-provoking exploration of a future where the lines between human and machine become increasingly blurred.\""
  },
  {"TITLE": "Samurai 7 (2004)",
    "imageUrl": "https://images.justwatch.com/backdrop/285170785/s1440/samurai-7.avif",
    "STATUS": "",
    "Series Length": "1 season, 26 episodes",
    "LAST WATCHED": "",
    "OwnerShip": "Buy",
    "GENRE": "Animation, Drama, Science-Fiction, Action & Adventure, Classic Japanese Anime",
    "RUNTIME": "00:27",
    "Max Episodes": "10 weeks, 10 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/samurai-7",
    "DESCRIPTION": "\"Samurai 7,\" a 2004 anime series, offers a futuristic reimagining of Akira Kurosawa's classic film \"Seven Samurai.\" In a world where mechanized bandits plague the countryside, a young and determined priestess named Kirara embarks on a perilous journey to find and recruit seven skilled samurai to defend her impoverished village. These bandits, known as Nobuseri, were once samurai themselves but have now integrated their swordsmanship with powerful mecha technology, making them a formidable threat.\n\nAs Kirara travels from village to village, she encounters a diverse group of masterless samurai, each with their own unique skills, personalities, and reasons for joining her cause. Among them are Kambei Shimada, a seasoned and wise veteran; Katsushiro Okamoto, a young and idealistic but inexperienced swordsman; Gorobei Katayama, a jovial and skilled fighter; Shichiroji, Kambei's old comrade; Heihachi Hayashida, a talented but somewhat cowardly mechanic; Kyuzo, a silent and deadly swordsman; and Kikuchiyo, a boisterous and unconventional individual who claims to be a samurai.\n\nTogether, this unlikely band of warriors must band together to train the villagers and prepare for the inevitable clash against the technologically advanced Nobuseri. \"Samurai 7\" blends the timeless narrative of defending the defenseless with a unique science-fiction twist, featuring impressive mecha designs and dynamic action sequences, all while retaining the core themes of courage, loyalty, and the spirit of the samurai. This visually striking series offers a fresh and exciting take on a beloved story, available for purchase for those who appreciate a blend of classic storytelling with futuristic elements.\""
  },
  {"TITLE": "Samurai Champloo (2004)",
    "imageUrl": "https://images.justwatch.com/backdrop/256467919/s1440/samurai-champloo.avif",
    "STATUS": "",
    "Series Length": "1 season, 24 episodes",
    "LAST WATCHED": "se1",
    "OwnerShip": "Hulu",
    "GENRE": "Action & Adventure, Animation, Comedy, Drama, Mystery & Thriller, Classic Japanese Anime",
    "RUNTIME": "00:30",
    "Max Episodes": "10 weeks, 10 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/samurai-champloo",
    "DESCRIPTION": "\"Samurai Champloo,\" a stylish and genre-bending anime series that aired in 2004, throws together an unlikely trio in a vibrant and anachronistic take on Edo-period Japan. The story kicks off when Fuu, a young waitress working in a teahouse, enlists the help of two drastically different and fiercely independent swordsmen: Mugen, a wild and unpredictable warrior with a unique, breakdance-inspired fighting style, and Jin, a stoic and highly skilled samurai who adheres strictly to traditional bushido.\n\nBound by a strange twist of fate and Fuu's determined quest to find a mysterious 'samurai who smells of sunflowers,' Mugen and Jin find themselves begrudgingly traveling together. Their journey across Japan is filled with action-packed encounters, quirky characters, and a distinctive hip-hop infused soundtrack that perfectly complements the series' unconventional atmosphere. Each episode often delves into episodic adventures, showcasing the diverse aspects of the Edo period with a modern sensibility, tackling themes ranging from political intrigue and social injustice to personal growth and the search for identity. Created by Shinichirō Watanabe, the mastermind behind 'Cowboy Bebop,' 'Samurai Champloo' is celebrated for its fluid animation, dynamic fight choreography, sharp wit, and its seamless fusion of historical Japan with contemporary music and cultural elements, making it a truly unique and captivating viewing experience available on Hulu.\""
  },
  {"TITLE": "Scavengers Reign (2023)",
    "imageUrl": "https://images.justwatch.com/backdrop/320090584/s1440/scavengers-reign.avif",
    "STATUS": "",
    "Series Length": "1 season, 12 episodes",
    "LAST WATCHED": "",
    "OwnerShip": "Netflix",
    "GENRE": "Drama, Animation, Science-Fiction, Modern Anime",
    "RUNTIME": "00:30",
    "Max Episodes": "10 weeks, 10 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/scavengers-reign",
    "DESCRIPTION": "\"Scavengers Reign,\" a visually captivating animated series from 2023, strands the surviving crew of a deep space freighter on a breathtaking yet perilous alien planet after their ship is crippled by a solar flare. As they navigate this uncharted world, the marooned individuals must confront not only the challenges of survival but also the astonishing and often unsettling true nature of their new environment.\n\nEach thirty-minute episode follows the crew members as they explore the alien ecosystem, encountering bizarre flora and fauna, and grappling with the planet's unique and sometimes hostile conditions. Their initial focus is on finding a way to escape or signal for rescue, but as time wears on, they begin to unravel the deeper mysteries of this beautiful yet unforgiving world. The series delves into themes of human resilience, the struggle for survival against the odds, and the profound impact of an alien environment on the human psyche. With its striking animation and intriguing narrative, \"Scavengers Reign\" offers a thought-provoking and immersive science-fiction experience, available for streaming on Netflix, that explores the delicate balance between life and the unknown in the vastness of space.\""
  },
  {"TITLE": "Scott Pilgrim Takes Off (2023)",
    "imageUrl": "https://images.justwatch.com/backdrop/307124341/s1440/scott-pilgrim-the-anime.avif",
    "STATUS": "🟢",
    "Series Length": "1 season, 8 episodes",
    "LAST WATCHED": "se1",
    "OwnerShip": "Netflix",
    "GENRE": "Action & Adventure, Comedy, Science-Fiction, Fantasy, Music & Musical, Romance, Animation, Modern Anime",
    "RUNTIME": "00:27",
    "Max Episodes": "10 weeks, 10 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/scott-pilgrim-the-anime",
    "DESCRIPTION": "\"Scott Pilgrim Takes Off,\" a vibrant and energetic anime series that premiered in 2023 on Netflix, revisits the quirky world and beloved characters from Bryan Lee O'Malley's graphic novels and the Edgar Wright-directed film \"Scott Pilgrim vs. the World.\" This animated adaptation brings back the entire ensemble, including the endearingly flawed bassist Scott Pilgrim, the enigmatic Ramona Flowers, his supportive best friend Wallace Wells, the fiercely devoted Knives Chau, his pragmatic sister Stacey Pilgrim, and, of course, Ramona's formidable league of seven evil exes.\n\nHowever, \"Takes Off\" promises a fresh and unexpected spin on the familiar story. While Scott is still navigating the challenges of romance and the chaotic battles against Ramona's ex-boyfriends and ex-girlfriend, the narrative playfully subverts expectations and delves into new and unexplored territories. Expect the series to retain the signature blend of action-packed fight sequences infused with video game aesthetics, sharp comedic timing, musical interludes from Scott's band Sex Bob-Omb, and heartfelt moments of character growth and emotional maturity. With its stylish animation and the return of the original creative team, \"Scott Pilgrim Takes Off\" offers both longtime fans and newcomers a thrilling and hilarious ride through the trials and tribulations of love, life, and leveling up in the most unconventional ways.\""
  },
  {"TITLE": "The disastrous life of Saiki K. (2016)",
    "imageUrl": "https://images.justwatch.com/backdrop/183702820/s1440/the-disastrous-life-of-saiki-k.avif",
    "STATUS": "",
    "Series Length": "3 season, 50 episodes",
    "LAST WATCHED": "",
    "OwnerShip": "Netflix",
    "GENRE": "Animation, Comedy, Fantasy, Science-Fiction, Classic Japanese Anime",
    "RUNTIME": "00:11",
    "Max Episodes": "10 weeks, 30 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/the-disastrous-life-of-saiki-k",
    "DESCRIPTION": "\"The Disastrous Life of Saiki K.,\" which began airing in 2016, is a hilarious and quirky anime series centered around Kusuo Saiki, a high school student burdened with extraordinary psychic abilities. Despite possessing a vast array of powers, including telepathy, telekinesis, and teleportation, Saiki's greatest desire is to lead a completely ordinary and unnoticed life. However, his attempts at normalcy are constantly thwarted by the eccentric and often oblivious individuals who surround him.\n\nEach eleven-minute episode follows Saiki's daily struggles to navigate the absurdities of high school and his interactions with his colorful classmates and family. From the overly enthusiastic and dense Riki Nendou to the delusional Kokomi Teruhashi, who believes everyone is infatuated with her, Saiki's life is a constant barrage of unwanted attention and comical situations. He often resorts to using his powers in subtle ways to avoid麻烦 (trouble) and maintain his anonymity, but his efforts frequently backfire in humorous fashion. \"The Disastrous Life of Saiki K.\" is known for its rapid-fire jokes, fourth-wall breaks, and its endearing cast of oddball characters, making it a consistently funny and entertaining watch for those who enjoy lighthearted and supernatural comedies. This series is available for streaming on Netflix.\""
  },
  {"TITLE": "The Orbital Children (2022)",
    "imageUrl": "https://images.justwatch.com/backdrop/261600166/s1440/the-orbital-children.avif",
    "STATUS": "",
    "Series Length": "1 season 6 episodes",
    "LAST WATCHED": "se1",
    "OwnerShip": "Netflix",
    "GENRE": "Action & Adventure, Science-Fiction, Fantasy, Animation, Drama, Classic Japanese Anime",
    "RUNTIME": "00:32",
    "Max Episodes": "10 weeks, 10 episodes",
    "Link": "https://www.justwatch.com/us/tv-show/the-orbital-children",
    "DESCRIPTION": "\"The Orbital Children,\" a 2022 anime series available on Netflix, is set in the year 2045, a time when humanity has a significant presence in space. The story focuses on a group of five children who find themselves in a perilous situation aboard a commercial space station following a large-scale accident. Among them are two individuals who were born and raised on the moon, possessing a unique perspective on life in space, and three kids who have journeyed from Earth.\n\nWhen the catastrophic event leaves them stranded and cut off from communication with Earth, these young individuals must band together to survive the harsh realities of space and find a way to return home or be rescued. The series explores their ingenuity, resilience, and the bonds they form as they face the challenges of a damaged space station and the unforgiving environment of orbit. \"The Orbital Children\" blends elements of science fiction adventure with coming-of-age drama, highlighting the resourcefulness of youth in the face of extraordinary circumstances and the wonder and danger of space exploration in the near future.\""
  }
]
