[
  {
    "game": "ERGOarena",
    "link": "https://ergosphere-02b692b18f50.herokuapp.com/pages/BossFight.html",
    "mode": "ERGOarena",
    "text": "EtchWraith Swarm",
    "genre": "ERGOvillians",
    "image": [
      "../assets/img/ERGOvillians/Ergobugs (ErgoVillian) .jpg",
      "../assets/img/ERGOvillians/Ergobugs variant 1 (ErgoVillian) .jpg",
      "../assets/img/ERGOvillians/Ergobugs variant 2 (ErgoVillian) .jpg",
      "../assets/img/ERGOvillians/Ergobugs variant 3 (ErgoVillian) .jpg"
    ],
    "copies": 25,
    "reward": "Party leader gets to pick any available CO-OP game.",
    "details": "EtchWraith Swarm Attacks!",
    "imageUrl": "",
    "punishment": "Party leader deletes 4 HCMC probabilities. No CO-OP game will be picked this week.",
    "description": "Swarm",
    "Time per match": "6mins"
  },
  {
    "game": "ERGOarena",
    "link": "https://ergosphere-02b692b18f50.herokuapp.com/pages/BossFight.html",
    "mode": "ERGOarena",
    "text": "Tash Nadia",
    "genre": "ERGOvillians",
    "image": "../assets/img/ERGOvillians/Tash Nadia (ErgoVillian) .jpg",
    "copies": 1,
    "reward": "Party leader gets to pick any available CO-OP game. Player also gains 50 ducats.",
    "details": "Tash Nadia Attacks!",
    "imageUrl": "",
    "punishment": "{Dagon’s Curse} Remove all fish from the menu this week. One CoOp day becomes a deep clean fish tank day. Party leader deletes 4 HCMC probabilities. No CO-OP game will be picked this week.",
    "description": "STRENGTH",
    "Time per match": "6mins"
  },
  {
    "game": "ERGOarena",
    "link": "https://ergosphere-02b692b18f50.herokuapp.com/pages/BossFight.html",
    "mode": "ERGOarena",
    "text": "Forbearer Tren",
    "genre": "ERGOvillians",
    "image": "../assets/img/ERGOvillians/Forbearer Tren (ErgoVillian) .jpg",
    "copies": 1,
    "reward": "Party leader gets to pick any available CO-OP game. Player also gains 50 ducats.",
    "details": "Forbearer Tren Attacks!",
    "imageUrl": "",
    "punishment": " {Hypnopompia} If the Party leader is the current Bingwa and or Atletico champ, remove your title and swap with the Kushindwa and or Atletico loser. All choices stay the same but all other rewards go to other player. Party leader deletes 4 HCMC probabilities. No CO-OP game will be picked this week.",
    "description": "INTELLINGENCE",
    "Time per match": "6mins"
  },
  {
    "game": "ERGOarena",
    "link": "https://ergosphere-02b692b18f50.herokuapp.com/pages/BossFight.html",
    "mode": "ERGOarena",
    "text": "Bennu",
    "image": "../assets/img/ERGOvillians/Bennu (ErgoVillian) .jpg",
    "copies": 1,
    "reward": "Party leader gets to pick any available CO-OP game. Player also gains 50 ducats.",
    "details": "Bennu Attacks!",
    "imageUrl": "",
    "punishment": "{Borracho} Each party member must play on level above the Gig Game requirement during the next weekly Rockband session. Party leader deletes 4 HCMC probabilities. No CO-OP game will be picked this week.",
    "description": "PERCEPTION",
    "Time per match": "6mins"
  },
  {
    "game": "ERGOarena",
    "link": "https://ergosphere-02b692b18f50.herokuapp.com/pages/BossFight.html",
    "mode": "ERGOarena",
    "text": "Dulguun Bolor",
    "genre": "ERGOvillians",
    "image": "../assets/img/ERGOvillians/Dulguun Bolor (ErgoVillian) .jpg",
    "copies": 1,
    "reward": "Party leader gets to pick any available CO-OP game. Player also gains 50 ducats.",
    "details": "Dulguun Bolor Attacks!",
    "imageUrl": "",
    "punishment": "{Vegicide} Each party member must pick one day this week to abstain from meat consumption. Party leader deletes 4 HCMC probabilities. No CO-OP game will be picked this week.",
    "description": "CONSTITUTION",
    "Time per match": "6mins"
  },
  {
    "link": "https://www.igdb.com/games/33-immortals",
    "mode": "Multiplayer",
    "text": "33 Immortals",
    "genre": "RPG, Hack and slash, Indie",
    "image": "../assets/img/Spin The Wheel Photos/CO-OP/33Immortals.jpg",
    "copies": 6,
    "console": "XBOX",
    "details": "",
    "imageUrl": "",
    "completed": "",
    "description": "\"In \"33 Immortals,\" your earthly existence has concluded, and divine judgment has deemed your soul worthy of eternal torment. Yet, within the fiery depths of damnation, a spirit of rebellion is taking hold! Step into the role of a defiant renegade joining the ranks of the immortally damned in an uprising against the Almighty's final decree. This upcoming indie title masterfully blends the intricate progression of an RPG with the adrenaline-pumping action of hack-and-slash combat, promising a uniquely intense gaming experience. As you fight for your everlasting being, you'll navigate a treacherous landscape swarming with other rebellious souls, likely engaging in massive cooperative battles against celestial forces.\n\nSet to be available on XBOX through GAMEPASS, \"33 Immortals\" is gearing up to deliver a chaotic and engaging multiplayer experience where your survival hinges on your ability to fight alongside or against other damned souls in this unprecedented revolt. While specific details about the development studio and critical reception are still emerging, the very concept of a rebellion against divine judgment offers a captivating and high-stakes narrative backdrop for frantic action and deep character customization. Prepare to rise with the immortal rebels and forge your own destiny in the afterlife.\" ",
    "playability": "GAMEPASS",
    "time to beat": ""
  },
  {
    "link": "",
    "mode": "Story, Cooperative Multiplayer",
    "text": "Army of 2",
    "genre": "Action, Third-Person Shooter",
    "image": "../assets/img/Spin The Wheel Photos/CO-OP/Army of 2.jpg",
    "copies": 0,
    "console": "XBOX",
    "details": "",
    "imageUrl": "",
    "completed": "",
    "description": "\"In a world where a single operative can't tackle the overwhelming threats of modern warfare and a sprawling global conspiracy, \"Army of Two\" throws players into the boots of two elite private military contractors. This action-packed third-person shooter, released in 2008 by Electronic Arts, emphasizes the importance of teamwork and strategic cooperation as players navigate intense combat scenarios across the globe. You'll step into the roles of Elliot Salem and Tyson Rios, partners who must rely on each other to survive deadly missions and uncover a conspiracy that reaches the highest echelons of power.\n\nDeveloped by EA Montreal, \"Army of Two\" introduced innovative cooperative gameplay mechanics, such as the 'Aggro' system, where one player can draw enemy fire while the other flanks. The game also features extensive weapon customization and cooperative actions that require synchronized effort. Set against a backdrop of contemporary conflicts and political intrigue, Salem and Rios must fight their way through war-torn regions, facing heavily armed enemies and uncovering the truth behind a conspiracy that threatens to destabilize the entire world. With a focus on explosive action and the bond between its two protagonists, \"Army of Two\" delivers a thrilling cooperative experience for XBOX players seeking a high-octane shooter with a compelling storyline.\" ",
    "playability": "",
    "time to beat": "08:00"
  },
  {
    "link": "https://www.igdb.com/games/as-dusk-falls",
    "mode": "Story, Multiplayer",
    "text": "As Dusk falls",
    "genre": "Point and click, Interactive Drama",
    "image": "../assets/img/Spin The Wheel Photos/CO-OP/As Dusk falls.png",
    "copies": 0,
    "console": "XBOX",
    "details": "",
    "imageUrl": "",
    "completed": "",
    "description": "\"As Dusk Falls,\" released in 2022, is an immersive interactive drama that begins in 1998 with a robbery gone awry in the quiet landscapes of small-town Arizona. Developed by Interior Night, this narrative-driven experience places players at the heart of a gripping story where the choices they make have profound and lasting consequences on the lives of the intricately drawn characters. The game unfolds over decades, exploring themes of betrayal, sacrifice, and the enduring strength of the human spirit in the face of adversity.\n\nWith its distinctive painterly art style, \"As Dusk Falls\" presents a multi-generational saga viewed through the intertwined perspectives of two families whose lives collide unexpectedly. Players will navigate complex moral dilemmas and make critical decisions that shape the relationships, destinies, and survival of the characters. The branching narrative ensures that each playthrough can yield different outcomes, encouraging multiple explorations of the story's intricate web of possibilities. While primarily a single-player experience, \"As Dusk Falls\" also offers a unique multiplayer mode where up to eight people can influence the decisions, leading to unpredictable and collaborative storytelling. Available on XBOX, this uncompromising narrative promises a mature and thought-provoking experience that blurs the lines between gaming and interactive cinema.\" ",
    "playability": "",
    "time to beat": "06:00"
  },
  {
    "link": "https://www.igdb.com/games/battletoads--2",
    "mode": "Single-player, Cooperative Multiplayer",
    "text": "Battletoads (2020)",
    "genre": "Fighting, Platform, Hack and slash, Adventure",
    "image": "../assets/img/Spin The Wheel Photos/CO-OP/BattleToads.jpg",
    "copies": 2,
    "console": "XBOX",
    "details": "Rare",
    "imageUrl": "https://gaming-cdn.com/images/products/7483/orig/battletoads-pc-xbox-one-game-microsoft-store-europe-cover.jpg?v=1738600074",
    "completed": "",
    "COMPLETED?": "🏆",
    "description": "\"Battletoads (2020)\" marks the revival of the classic beat 'em up franchise originally developed by Rare. This genre-defying adventure follows the unlikely trio of Rash, Zitz, and Pimple as they embark on a wild and unpredictable journey to rescue their galaxy from the clutches of a deadly warlord. Staying true to its roots while injecting a modern sensibility, this reboot offers a diverse gameplay experience that seamlessly blends beat 'em up action with challenging platforming sections and high-speed racing sequences.\n\nDeveloped by Dlala Studios in collaboration with Rare, \"Battletoads (2020)\" retains the over-the-top humor and cartoonish violence that defined the original series. Players can team up in cooperative multiplayer to unleash devastating combos and navigate the game's bizarre and imaginative levels. Known for its demanding difficulty, the new \"Battletoads\" aims to challenge both nostalgic fans and newcomers with its unique blend of gameplay styles and its quirky narrative. Prepare for morphing abilities, outlandish enemies, and a healthy dose of irreverent humor as these amphibious heroes fight to save the galaxy in their own inimitable style.\" ",
    "playability": "",
    "time to beat": ""
  },
  {
    "link": "https://howlongtobeat.com/game/17638",
    "mode": "Single-player, Cooperative Multiplayer",
    "text": "Broforce (2015)",
    "genre": "Scrolling, Action, Platform, Run and Gun",
    "image": "../",
    "copies": 0,
    "console": "PC, PlayStation 4, Nintendo Switch, Xbox One",
    "details": "",
    "imageUrl": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/16/09/1456846593-broforce.jpg",
    "completed": "",
    "description": "\"When the forces of evil rear their ugly heads and threaten global stability, the world turns to Broforce – a hilariously over-the-top, under-funded paramilitary group known for their excessive application of force. Released in 2015 by Free Lives, \"Broforce\" is a side-scrolling action platformer that lets you and up to three other players unleash chaos as a diverse roster of 'bros' – parodies of iconic action movie heroes. Prepare to 'brace your loins' for explosive run 'n' gun gameplay as you tackle terrorist forces that dare to jeopardize freedom.\n\n\"Broforce\" is a love letter to classic action films, with each bro possessing unique weapons and special moves inspired by their cinematic counterparts. From Rambo to Terminator to Chuck Norris, you'll mow down enemies and trigger spectacular chain reactions of fire, napalm, and flying limbs in the name of liberty. The game's destructible environments add to the mayhem, allowing for emergent gameplay and creative solutions to overcome obstacles. With its pixelated art style, over-the-top violence, and a healthy dose of self-aware humor, \"Broforce\" delivers a nostalgic yet fresh cooperative experience for players on PC, PlayStation 4, Nintendo Switch, and Xbox One seeking adrenaline-fueled, explosive action.\" ",
    "playability": "",
    "time to beat": "09:00"
  },
  {
    "link": "https://www.igdb.com/games/brothers-a-tale-of-two-sons",
    "mode": "Single-player",
    "text": "Brothers",
    "genre": "Adventure, Puzzle, Indie",
    "image": "../",
    "copies": 0,
    "console": "PC, PlayStation 3, Xbox 360, PlayStation 4, Xbox One, Nintendo Switch, iOS, Android",
    "details": "",
    "imageUrl": "https://c4.wallpaperflare.com/wallpaper/884/921/209/brothers-a-tale-of-two-sons-wallpaper-preview.jpg",
    "completed": "",
    "COMPLETED?": "🏆",
    "description": "\"Brothers: A Tale of Two Sons,\" released in 2013 by Starbreeze Studios and published by 505 Games, is a poignant and innovative adventure puzzle game that explores themes of grief, brotherhood, and resilience. Players simultaneously control two brothers, Naia and Naiee, each with a different analog stick, guiding them through a fantastical and emotionally resonant journey. Their quest begins as they seek a cure for their ailing father, leading them across stunning and varied landscapes filled with intricate puzzles to solve and perilous challenges to overcome.\n\nThe game's unique control scheme is integral to its gameplay, requiring players to coordinate the brothers' actions to navigate the environment, interact with its inhabitants, and face off against formidable foes. The narrative unfolds without dialogue, relying instead on the brothers' gestures, expressions, and the evocative environments to convey their story and their unbreakable bond. \"Brothers: A Tale of Two Sons\" garnered critical acclaim for its artistic presentation, its innovative gameplay mechanics, and its deeply moving narrative, offering a unique and memorable single-player experience available on a wide range of platforms including PC, PlayStation, Xbox, Nintendo Switch, and mobile devices.\" ",
    "playability": "",
    "time to beat": "03:30"
  },
  {
    "link": "https://www.igdb.com/games/chariot",
    "mode": "Cooperative Multiplayer, Single-player",
    "text": "Chariot",
    "genre": "Platform, Puzzle, Indie",
    "image": "../",
    "copies": 0,
    "console": "Wii U, PlayStation 4, Xbox One, PC",
    "details": "",
    "imageUrl": "https://assets2.ignimgs.com/2014/03/18/chariot-buttonjpg-e31afc.jpg",
    "completed": "",
    "description": "\"Chariot,\" released in 2014 by Frima Studio, is a charming and engaging couch co-op platformer that can also be enjoyed solo. Players are tasked with guiding a royal chariot carrying the remains of their recently deceased king through a series of vibrant and challenging underground caves. The core gameplay revolves around unique physics-based mechanics, requiring players to skillfully push, pull, ride, and swing the chariot to navigate the intricate level designs and overcome various obstacles.\n\nWhether played alone or with a friend in local cooperative mode, \"Chariot\" demands clever teamwork and coordination. The second player controls a helpful companion who can assist in maneuvering the chariot, attaching to it to gain height, or collecting valuable loot. The game's puzzles are cleverly integrated into the platforming, often requiring players to utilize the chariot's weight and momentum in creative ways. With its colorful visuals, whimsical atmosphere, and inventive gameplay, \"Chariot\" offers a delightful and rewarding experience for those seeking a cooperative adventure or a unique platforming challenge on Wii U, PlayStation 4, Xbox One, and PC.\" ",
    "playability": "",
    "time to beat": "08:00"
  },
  {
    "link": "https://www.igdb.com/games/commonhood",
    "mode": "Multiplayer, Cooperative",
    "text": "CoOpmmon'hood",
    "genre": "Simulation, Strategy, Base Building, Indie",
    "image": "../",
    "copies": 0,
    "console": "PC",
    "details": "",
    "imageUrl": "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/962090/ss_c21a4b3dcb865ae4b69af951cf5bb0a42303c43c.1920x1080.jpg?t=1698939024",
    "completed": "",
    "description": "\"CoOpmmon'hood,\" also known as \"Commonhood,\" released in 2022 by Genpop Interactive, is a community-focused survival simulation game where collaboration is key to building a thriving, self-sustaining home alongside your neighbors. Set in a world where you must work together, the core gameplay revolves around designing and automating intricate production lines to efficiently manage resources. You'll need to cultivate your own food through farming, ensure the well-being of your community by addressing their various needs, and pool your collective efforts to restore an abandoned factory into a functional and vital hub.\n\nWith a strong emphasis on cooperative multiplayer, \"CoOpmmon'hood\" allows players to strategize and contribute their unique skills to the shared endeavor. From planning the layout of your communal settlement to managing the flow of goods and resources, every decision impacts the entire group. The game blends the strategic depth of simulation titles with the rewarding experience of collaborative problem-solving. As you work together to rebuild and prosper, you'll forge bonds with your fellow players and witness the power of community in overcoming challenges and creating a sustainable future from the ruins of the past, exclusively on PC.\" ",
    "playability": "",
    "time to beat": "15:00"
  },
  {
    "link": "https://www.igdb.com/games/darksiders-genesis",
    "mode": "Story, Cooperative Multiplayer",
    "text": "Darksiders Genesis",
    "genre": "Action RPG, Hack and slash",
    "image": "../",
    "copies": 0,
    "console": "XBOX, PC, PlayStation 4, Nintendo Switch, Google Stadia",
    "details": "",
    "imageUrl": "https://gameranx.com/wp-content/uploads/2020/01/Darksiders-Genesis-4K-Wallpaper-1.jpg",
    "completed": "",
    "description": "\"Darksiders Genesis,\" released in 2019, takes players on an action-packed journey through the events preceding the original \"Darksiders\" game. This installment offers a fresh perspective on the series with its top-down, isometric view, while retaining the signature blend of action, exploration, and puzzle-solving that fans have come to expect. Players step into the roles of the Horsemen of the Apocalypse, War and Strife, as they tear their way through hordes of demonic enemies in a quest that spans the depths of Hell and back.\n\nDeveloped by Airship Syndicate, \"Darksiders Genesis\" introduces Strife as a playable character for the first time, complementing War's familiar combat style with his dual pistols and agile maneuvers. The game features a full story campaign that can be experienced solo, allowing players to switch between War and Strife, or in seamless cooperative multiplayer, where one player controls each Horseman. With a vast array of abilities, weapon upgrades, and creature cores to collect and enhance their powers, players will engage in intense hack-and-slash combat and solve intricate environmental puzzles. \"Darksiders Genesis\" provides a deeper look into the lore of the Darksiders universe and the early exploits of the Horsemen, offering an exciting entry point for newcomers and a rewarding experience for long-time fans on XBOX, PC, PlayStation 4, Nintendo Switch, and Google Stadia.\" ",
    "playability": "",
    "time to beat": "15:00"
  },
  {
    "link": "https://www.igdb.com/games/dayz",
    "mode": "Multiplayer",
    "text": "DayZ",
    "genre": "Survival, Shooter, Open World, Multiplayer",
    "image": "../",
    "copies": 0,
    "console": "XBOX, PC, PlayStation 4",
    "details": "",
    "imageUrl": "https://wallpapers.com/images/hd/dayz-standalone-game-qy2tx1diswucktt5.jpg",
    "completed": "",
    "description": "\"DayZ\" thrusts players into the bleak and unforgiving post-Soviet country of Chernarus, a vast open world ravaged by an unknown virus that has transformed the majority of the population into aggressive, zombie-like infected. Released as a standalone game in 2018, building upon its popular mod origins, \"DayZ\" emphasizes hardcore survival where the environment and other desperate players pose significant threats. As one of the few immune individuals, your primary goal is simple: survive.\n\nHowever, survival in Chernarus is anything but easy. Scarcity of resources breeds hostility among the remaining survivors, leading to tense and often unpredictable player interactions. You'll need to scavenge for food, water, medical supplies, and weapons while constantly being aware of both the infected and potentially hostile humans. \"DayZ\" is known for its emergent gameplay, where player decisions and interactions create unique and often dramatic scenarios. There are no clear objectives or missions; your story is the one you create through your choices and encounters. With its persistent world and focus on realism, including mechanics like hunger, thirst, and injury, \"DayZ\" offers a brutal and immersive multiplayer survival experience on XBOX, PC, and PlayStation 4, where trust is a rare commodity and every encounter could be your last.\"",
    "playability": "",
    "time to beat": "89:00"
  },
  {
    "link": "https://www.igdb.com/games/deep-rock-galactic",
    "mode": "Cooperative Multiplayer",
    "text": "Deep Rock Galactic",
    "genre": "FPS, Action, Cooperative",
    "image": "../",
    "copies": 1,
    "console": "XBOX, PC, PlayStation 4, PlayStation 5",
    "details": "ROCK AND STONE!",
    "imageUrl": "https://images5.alphacoders.com/107/1077310.jpg",
    "completed": "",
    "description": "\"Deep Rock Galactic,\" released in 2020 by Ghost Ship Games, is a thrilling first-person shooter that puts you in the boots of a team of dwarven space miners. But these aren't your typical miners; they're heavily armed and ready to face hordes of hostile alien creatures in procedurally generated cave systems. Teamwork is paramount as you and up to three other players delve into the depths of alien planets to extract valuable resources. You'll need to dig tunnels, navigate treacherous environments, and coordinate your efforts to survive the relentless onslaught of alien threats.\n\nEach of the four playable dwarf classes – the resilient Driller, the versatile Engineer, the agile Scout, and the heavy-hitting Gunner – offers unique abilities and tools that are essential for success. From setting up defensive turrets and lighting up dark caverns to drilling through solid rock and unleashing devastating firepower, every dwarf plays a crucial role in the team's survival and resource acquisition. Known for its addictive gameplay loop, challenging missions, and strong sense of camaraderie, especially when players enthusiastically shout 'Rock and Stone!', \"Deep Rock Galactic\" offers a fantastic cooperative experience on XBOX, PC, PlayStation, and PlayStation 5 for those who enjoy intense FPS action with a mining twist.\"",
    "playability": "GAMEPASS",
    "time to beat": "22:00"
  },
  {
    "link": "https://www.igdb.com/games/diablo-iii-reaper-of-souls",
    "mode": "Cooperative Campaign, Multiplayer",
    "text": "Diablo 3: reaper of souls",
    "genre": "RPG, Hack and slash, Action RPG",
    "image": "../",
    "copies": 0,
    "console": "XBOX, PC, PlayStation 3, PlayStation 4, Nintendo Switch, Xbox 360",
    "details": "",
    "imageUrl": "https://images5.alphacoders.com/470/470301.jpg",
    "completed": "",
    "description": "\"Diablo III: Reaper of Souls,\" the acclaimed expansion to Blizzard Entertainment's action RPG \"Diablo III,\" released in 2014, plunges players back into the dark and gothic world of Sanctuary as a new and terrifying threat emerges. With the Prime Evil contained within the Black Soulstone, a semblance of hope returns – but not for long. Malthael, the Angel of Death, descends upon the mortal realms with a chilling new purpose: to claim the Black Soulstone and bend its immense power to his will, threatening to extinguish all of humanity.\n\nPlayers can continue their journey as one of the core classes or take on the role of the Crusader, a heavily armored warrior wielding divine power. The expansion introduces Act V, a new chapter in the epic saga, along with the Adventure Mode, which offers greater freedom to explore and tackle randomized dungeons and bounties. With its focus on intense hack-and-slash combat, deep character customization, and the thrill of loot hunting, \"Reaper of Souls\" enhances the cooperative multiplayer experience, allowing players to team up and face the forces of death together. This essential addition to \"Diablo III\" delivers a compelling narrative and endless replayability for fans of action RPGs on XBOX, PC, PlayStation, and Nintendo Switch.\" ",
    "playability": "",
    "time to beat": "32:00"
  },
  {
    "link": "https://www.igdb.com/games/diablo-iv",
    "mode": "Multiplayer, Cooperative",
    "text": "Diablo IV",
    "genre": "RPG, Action RPG, Hack and slash",
    "image": "../assets/img/Spin The Wheel Photos/CO-OP/DIABLO IV.png",
    "copies": 4,
    "console": "XBOX, PC, PlayStation 4, PlayStation 5",
    "details": "Blizzard Entertainment",
    "imageUrl": "https://images8.alphacoders.com/132/1329423.jpeg",
    "completed": "",
    "description": "\"Diablo IV,\" the highly anticipated next installment in Blizzard Entertainment's iconic action RPG series, released in 2023, returns players to the dark and dangerous world of Sanctuary. As the eternal conflict between the High Heavens and the Burning Hells rages on, a new darkness spreads across the land. Hatred consumes Sanctuary as cultists and worshippers rise to herald the return of Lilith, the Daughter of Hatred. In this perilous era, only a few brave souls dare to stand against the encroaching evil and bring a glimmer of light to the all-consuming shadows.\n\nPlayers can choose from a range of powerful classes, each with unique skills and playstyles, to confront the demonic hordes and unravel the mysteries of Lilith's return. The game features a vast and interconnected open world to explore, filled with challenging dungeons, engaging quests, and formidable enemies. Whether playing solo or teaming up with friends in cooperative multiplayer, \"Diablo IV\" promises intense hack-and-slash combat, deep character customization, and the addictive pursuit of powerful loot. With its mature themes and dark fantasy setting, this latest chapter in the Diablo saga offers a thrilling and immersive experience for both longtime fans and newcomers to the franchise on XBOX, PC, and PlayStation consoles.\" ",
    "playability": "GAMEPASS",
    "time to beat": "20:00"
  },
  {
    "link": "https://www.igdb.com/games/divinity-original-sin-2",
    "mode": "CoOp Campaign",
    "text": "Divinity 2: Original sin",
    "genre": "RPG, Turnbased strategy, Adventure",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://images5.alphacoders.com/120/1204667.png",
    "completed": "",
    "description": "The Divine is dead. The Void approaches. And the powers lying dormant within you are soon to awaken. The battle for Divinity has begun. Choose wisely and trust sparingly; darkness lurks within every heart.",
    "playability": "OWNED",
    "time to beat": "60 Hours"
  },
  {
    "link": "https://www.igdb.com/games/dune-spice-wars",
    "mode": "Multiplayer, Single-player",
    "text": "Dune: Spice Wars",
    "genre": "Strategy, RTS, 4X",
    "image": "../",
    "copies": 3,
    "console": "PC",
    "details": "Shiro Games",
    "imageUrl": "https://images6.alphacoders.com/123/1230153.png",
    "completed": "",
    "description": "\"Dune: Spice Wars,\" released in 2023 by Shiro Games, the developers behind the acclaimed strategy game Northgard, immerses players in the intricate and politically charged universe of Frank Herbert's Dune. This 4X real-time strategy game casts you as the leader of one of several powerful factions vying for control and dominance over the harsh andResource-rich desert planet of Arrakis, the only known source of the invaluable spice melange.\n\nPlayers must strategically manage their resources, expand their territories, engage in political maneuvering, and wage war in real-time to assert their dominance. The game blends the grand strategic scope of a 4X title with the immediate tactical decisions of an RTS, requiring players to balance long-term planning with swift responses to the dynamic environment and their opponents' actions. Whether through economic might, political intrigue, military conquest, or subtle espionage, every choice you make will shape the destiny of your faction on Arrakis. With its deep strategic layers and immersive Dune setting, \"Dune: Spice Wars\" offers a compelling multiplayer and single-player experience exclusively on PC for strategy enthusiasts looking to command their forces on the sands of Arrakis.\" ",
    "playability": "",
    "time to beat": "25:00"
  },
  {
    "link": "https://www.igdb.com/games/endless-dungeon",
    "mode": "Cooperative Multiplayer, Single-player",
    "text": "Endless Dungeon",
    "genre": "Tower Defense, Action, Roguelike, Tactical",
    "image": "../assets/img/Spin The Wheel Photos/CO-OP/Endless Dungeon.PNG",
    "copies": 4,
    "console": "XBOX, PC, PlayStation 4, PlayStation 5, Nintendo Switch",
    "details": "SEGA, Amplitude Studios",
    "imageUrl": "https://wallpapercave.com/wp/wp13001267.jpg",
    "completed": "",
    "description": "\"Endless Dungeon,\" released in 2023 by Amplitude Studios and published by SEGA, is a thrilling rogue-lite tactical action game set within the award-winning Endless universe. You find yourself stranded on a long-abandoned space station, and your primary objective is to protect a vital crystal core from relentless waves of monstrous inhabitants. To survive, you'll need to recruit a team of shipwrecked heroes, each with their own unique skills and weaponry, and strategically navigate the procedurally generated depths of the station.\n\nBlending elements of tower defense with direct action combat and roguelike progression, \"Endless Dungeon\" requires players to think tactically about both their defensive setups and their moment-to-moment engagements. As you explore the station, you'll discover new heroes to add to your squad, each offering different strategic advantages. Death is not the end, but it does mean starting anew with the knowledge and resources you've gained. Whether playing solo or cooperatively with friends, you'll need to coordinate your defenses, utilize your heroes' abilities effectively, and adapt to the ever-changing layout of the station to survive the endless onslaught. Available on XBOX, PC, PlayStation, and Nintendo Switch, this game offers a challenging and engaging experience that combines strategic planning with intense real-time action.\" ",
    "playability": "",
    "time to beat": "15:00"
  },
  {
    "link": "https://www.escapeacademygame.com/",
    "mode": "Cooperative Multiplayer, Single-player",
    "text": "Escape Academy",
    "genre": "Puzzle, Adventure, Indie",
    "image": "../assets/img/Spin The Wheel Photos/CO-OP/Escape Academy.jpg",
    "copies": 1,
    "console": "PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series S/X, Nintendo Switch",
    "details": "Coin Crew Games",
    "imageUrl": "https://images7.alphacoders.com/125/1251037.jpg",
    "completed": "",
    "description": "\"Escape Academy,\" released in 2022 by Coin Crew Games, invites players to experience the thrill and challenge of escape rooms in a captivating video game format. You take on the role of a student at the titular Escape Academy, a prestigious school where you'll hone your puzzle-solving skills to become the ultimate escape artist. The game is structured around a series of intricately designed escape rooms, each with its own unique theme, puzzles, and secrets to uncover.\n\nYou can tackle these brain-teasing challenges solo or team up with friends in cooperative multiplayer, either locally or online. Communication and collaboration are key as you decipher clues, manipulate the environment, and work against the clock to find the solutions needed to escape. The game features a diverse range of puzzles, testing your logic, observation, and critical thinking. With its engaging narrative and the satisfying rush of cracking a difficult code, \"Escape Academy\" offers a delightful and immersive experience for puzzle enthusiasts on PC, PlayStation, Xbox, and Nintendo Switch, and is also available on GAMEPASS for Xbox players.\"",
    "playability": "GAMEPASS",
    "time to beat": ""
  },
  {
    "link": "https://www.igdb.com/games/exoprimal",
    "mode": "Team-based PvE, Multiplayer",
    "text": "ExoPrimal",
    "genre": "Action, Shooter, Third-Person Shooter",
    "image": "../",
    "copies": 0,
    "console": "XBOX, PC, PlayStation 4, PlayStation 5",
    "details": "Capcom",
    "imageUrl": "https://images6.alphacoders.com/121/1219101.png",
    "completed": "",
    "COMPLETED?": "🏆",
    "description": "\"ExoPrimal,\" released in 2023 by Capcom, throws players into a thrilling and chaotic battle against hordes of history's most formidable dinosaurs. This online-only, team-based action game pits humanity's cutting-edge exosuit technology against the prehistoric menace in intense player-versus-environment (PvE) scenarios. You'll join a squad of futuristic combatants, each equipped with a unique exosuit designed for different combat roles and abilities, to take on massive waves of dinosaurs that pour through mysterious vortexes.\n\nThe gameplay in \"ExoPrimal\" centers around completing dynamic missions and objectives as a team, coordinating your exosuit abilities to effectively eliminate the dinosaur swarms and survive the onslaught. With a variety of exosuits to choose from, players can specialize in offense, defense, or support, encouraging strategic team compositions to tackle the escalating challenges. The game offers a unique blend of third-person shooting action with a focus on cooperative play against overwhelming odds. Available on XBOX, PC, and PlayStation platforms, and also on GAMEPASS for Xbox players, \"ExoPrimal\" delivers a high-octane, dinosaur-slaying experience that tests your combat skills and teamwork in a prehistoric-meets-futuristic showdown.\"",
    "playability": "GAMEPASS",
    "time to beat": "12:00"
  },
  {
    "link": "https://www.igdb.com/games/fallout-76",
    "mode": "Online Multiplayer",
    "text": "Fallout 76",
    "genre": "Action RPG, MMO, Open World",
    "image": "../",
    "copies": 0,
    "console": "XBOX, PC, PlayStation 4",
    "details": "Bethesda Game Studios",
    "imageUrl": "https://images3.alphacoders.com/639/thumb-1920-639657.jpg",
    "completed": "",
    "description": "\"Fallout 76,\" released in 2018 by Bethesda Game Studios, marks a significant departure for the Fallout franchise by bringing the post-nuclear wasteland to life in a persistent online multiplayer world. Set twenty-five years after the Great War, players emerge from Vault 76 in the heart of Appalachia, West Virginia, to explore a vast and dynamic open world. Unlike previous single-player installments, \"Fallout 76\" allows you to team up with other Vault Dwellers to scavenge for resources, build settlements, complete quests, and face the dangers of a mutated landscape together.\n\nInitially met with a mixed reception, the game has evolved significantly through numerous updates, adding substantial story content, non-player characters, and refining its gameplay mechanics. Players can still experience the core Fallout elements of exploration, character progression through the S.P.E.C.I.A.L. system, and crafting, but now within a shared online environment. Whether you're embarking on story-driven questlines, participating in public events, or simply surviving the challenges of the wasteland alongside other players, \"Fallout 76\" offers a unique multiplayer addition to the Fallout universe, available on XBOX, PC, and PlayStation 4, and also accessible through GAMEPASS on Xbox.\" ",
    "playability": "GAMEPASS",
    "time to beat": "32:30"
  },
  {
    "link": "https://www.lego.com/en-us/product/bonsai-tree-10281",
    "mode": "Single-player",
    "text": "Lego Bonsai Tree",
    "genre": "Puzzle, Lego, Building Set",
    "image": "../",
    "copies": 2,
    "console": "",
    "details": "Adults Welcome",
    "imageUrl": "https://www.lego.com/cdn/cs/set/assets/blt479fdafbf0ac80fb/01_mainstage_desktop.jpg?fit=crop&format=jpg&quality=80&width=1600&height=500&dpr=1",
    "completed": "",
    "description": "\"The Lego Bonsai Tree set, released as part of the adult-focused Lego Botanical Collection, offers a rewarding and mindful building experience. Comprising 878 pieces, this set allows you to construct a beautifully detailed artificial bonsai tree, a traditional symbol of peace and balance. The finished model stands over 7 inches (18 cm) tall, making it an elegant display piece for any home or office.\n\nDesigned for adult builders, this set provides a relaxing and engaging project that combines the creativity of Lego with the aesthetic appeal of a bonsai. It also includes interchangeable pieces, allowing you to style your tree with either green leaves or vibrant pink cherry blossoms, offering versatility in its appearance. The set comes with a rectangular pot and a slatted wood-effect stand, completing the authentic look. More than just a toy, the Lego Bonsai Tree is a unique and lasting decorative item that captures the essence of this ancient art form in brick form, perfect for Lego enthusiasts and those seeking a calming and creative building activity.\"",
    "playability": "OWNED",
    "time to beat": ""
  },
  {
    "link": "https://www.igdb.com/games/guardian-heroes--1",
    "mode": "Single-player, Multiplayer (Versus, Cooperative)",
    "text": "Guardian Heroes (2011)",
    "genre": "Fighting, RPG, Hack and slash, Beat 'em up",
    "image": "../",
    "copies": 1,
    "console": "XBOX 360 (via Xbox Live Arcade), Sega Saturn",
    "details": "Treasure",
    "imageUrl": "https://images.alphacoders.com/739/739006.jpg",
    "completed": "",
    "description": "\"Originally released in 1996 for the Sega Saturn and later re-released on Xbox Live Arcade in 2011, \"Guardian Heroes\" is a beloved 2D side-scrolling beat 'em up that seamlessly blends classic action with engaging RPG elements. Developed by the acclaimed studio Treasure, the game follows a group of young adventurers whose lives are forever changed when an enchanted sword falls into their possession, thrusting them into a quest to determine the fate of their kingdom.\n\nPlayers can choose from four distinct characters, each boasting their own unique fighting style, special moves, and branching narrative paths within the game's story mode. This allows for significant replayability as players explore different storylines and character perspectives. Beyond the main quest, \"Guardian Heroes\" features a robust versus mode where up to six players can engage in intense arena combat, showcasing the game's deep fighting mechanics. The combination of fast-paced beat 'em up action, character progression through leveling and skill acquisition, and multiple narrative routes cemented \"Guardian Heroes\" as a standout title of its era, offering a unique blend of genres that continues to be appreciated by fans on both its original platform and its Xbox 360 re-release.\" ",
    "playability": "OWNED",
    "time to beat": "05:00"
  },
  {
    "link": "https://www.igdb.com/games/monaco-whats-yours-is-mine",
    "mode": "Single-player, Cooperative Multiplayer",
    "text": "Monaco: What's Yours Is Mine (2013)",
    "genre": "Puzzle, Strategy, Adventure, Indie, Stealth",
    "image": "../",
    "copies": 3,
    "console": "PC, Xbox 360, Mac, Linux",
    "details": "Pocketwatch Games",
    "imageUrl": "https://images.launchbox-app.com/82082749-d837-4646-9010-158a53d7a6e7.png",
    "completed": "",
    "description": "\"Monaco: What's Yours Is Mine,\" an indie gem developed by Pocketwatch Games and released in 2013, is a unique and stylish top-down stealth adventure game that emphasizes cooperative gameplay. Best known for winning the 2010 Independent Games Festival (IGF) Award for its innovative design, \"Monaco\" casts players as a colorful cast of thieves, each with distinct abilities, as they plot and execute elaborate heists in the glamorous backdrop of Monaco.\n\nThe game's core mechanics revolve around strategic planning, silent infiltration, and coordinated teamwork. Whether playing solo or with up to three friends in local or online co-op, players must utilize their chosen character's skills – such as the Locksmith's fast picking, the Pickpocket's ability to snatch items unnoticed, or the Mole's talent for tunneling – to navigate intricate environments, bypass security systems, and make off with valuable loot. The charming pixel art style and the dynamic, reactive world add to the game's unique appeal. With its challenging puzzles, intricate level designs, and the requirement for seamless cooperation, \"Monaco: What's Yours Is Mine\" offers a thrilling and rewarding heist experience for players on PC, Xbox 360, Mac, and Linux.\" ",
    "playability": "OWNED",
    "time to beat": "09:00"
  },
  {
    "link": "https://www.igdb.com/games/new-super-mario-bros-u-deluxe",
    "mode": "Story, Cooperative Multiplayer",
    "text": "New Super Mario Bros. U Deluxe (2019)",
    "genre": "Platformer, Adventure",
    "image": "../",
    "copies": 1,
    "console": "SWITCH",
    "details": "Nintendo",
    "imageUrl": "https://images6.alphacoders.com/947/947063.png",
    "completed": "",
    "description": "\"New Super Mario Bros. U Deluxe,\" released in 2019 for the Nintendo Switch, offers a delightful and accessible platforming adventure perfect for both seasoned Mario fans and newcomers. This enhanced version combines the critically acclaimed New Super Mario Bros. U with the challenging New Super Luigi U, providing a wealth of content in one package. With its classic side-scrolling gameplay, players can jump, dash, and power-up their way through a variety of vibrant and imaginative worlds filled with iconic enemies, hidden secrets, and engaging platforming challenges.\n\nThe game features simple and intuitive controls, making it easy for players of all skill levels to pick up and enjoy. Additionally, it introduces new playable characters like Toadette and Nabbit, who are optimized for younger or less-experienced players, offering unique abilities to aid their journey. Whether tackling the main story in single-player or teaming up with up to three friends in local cooperative multiplayer, \"New Super Mario Bros. U Deluxe\" provides endless fun. The inclusion of helpful features like a Hints gallery and reference videos makes it an excellent entry point into the wonderful world of Mario, promising a charming and enjoyable experience for the whole family exclusively on the Nintendo Switch.\"",
    "playability": "OWNED",
    "time to beat": "10:00"
  },
  {
    "link": "https://www.igdb.com/games/generation-zero",
    "mode": "Cooperative Multiplayer, Single-player",
    "text": "Generation Zero",
    "genre": "Action, FPS, Open World, Survival",
    "image": "../",
    "copies": 0,
    "console": "XBOX, PC, PlayStation 4",
    "details": "Avalanche Studios",
    "imageUrl": "https://images6.alphacoders.com/926/thumb-1920-926870.jpg",
    "completed": "",
    "description": "\"Generation Zero,\" released in 2019 by Avalanche Studios, throws players into a tense and atmospheric open world set in a reimagined 1980s Sweden. What begins as a serene exploration of the countryside quickly turns into a desperate fight for survival as hostile, mysterious machines begin to invade the peaceful landscape. You and your friends, playing as teenagers returning from a trip, find yourselves in the midst of this mechanical uprising, with no clear explanation of their origin or purpose.\n\nThe game emphasizes guerrilla tactics and scavenging for resources as you confront these formidable robotic enemies. Whether playing solo or in seamless cooperative multiplayer with up to three other players, you'll need to strategically plan your attacks, utilize the environment to your advantage, and manage your limited ammunition and supplies. The persistent open world means that damage you inflict on the machines is lasting, encouraging careful and tactical engagements. As you fight back against the metallic invaders, you'll also uncover the mysteries behind their appearance and search for ways to survive in this explosive game of cat and mouse. Available on XBOX, PC, and PlayStation 4, and also on GAMEPASS for Xbox players, \"Generation Zero\" offers a unique blend of open-world exploration, intense FPS combat, and cooperative survival against a chilling mechanical threat.\"",
    "playability": "GAMEPASS",
    "time to beat": "20:00"
  },
  {
    "link": "https://www.igdb.com/games/grounded",
    "mode": "Cooperative Multiplayer, Single-player",
    "text": "Grounded",
    "genre": "Action, Adventure, Survival, Indie",
    "image": "../",
    "copies": 1,
    "console": "XBOX, PC, Nintendo Switch, PlayStation 4, PlayStation 5",
    "details": "Obsidian Entertainment",
    "imageUrl": "https://thathashtagshow.com/wp-content/uploads/2022/07/Friends.0.jpeg",
    "completed": "",
    "description": "\"Grounded,\" released in full in 2022 by Obsidian Entertainment, throws players into a unique and perilous survival adventure where they have been mysteriously shrunken down to the size of an ant and must navigate the treacherous landscape of an ordinary suburban backyard. This imaginative setting transforms familiar flora and fauna into colossal obstacles and dangerous predators. Players must learn to adapt to their minuscule scale, crafting tools, building shelters, and scavenging for resources to survive the daily challenges of this oversized world.\n\nWhether venturing out solo or teaming up with up to three other players in cooperative multiplayer, \"Grounded\" offers a compelling survival experience. You'll need to explore the diverse micro-biomes of the backyard, from the dense undergrowth to the murky puddles, each teeming with insects and environmental hazards. Crafting is essential for survival, allowing you to create weapons, armor, and shelters from the materials you gather. As you delve deeper into the mysteries of your miniaturization, you'll uncover a narrative that drives your exploration and survival. Available on XBOX, PC, Nintendo Switch, and PlayStation platforms, and also on GAMEPASS for Xbox players, \"Grounded\" delivers a captivating and often surprisingly tense survival experience in a familiar yet entirely new perspective.\"",
    "playability": "GAMEPASS",
    "time to beat": "30:00"
  },
  {
    "link": "https://www.igdb.com/games/how-to-survive-2",
    "mode": "Single-player, Cooperative Multiplayer",
    "text": "How to survive 2: Storm warning edition",
    "genre": "Action RPG, Survival, Zombie",
    "image": "../",
    "copies": 1,
    "console": "PC, PlayStation 4, Xbox One, Nintendo Switch",
    "details": "Eko Software",
    "imageUrl": "https://img.gg.deals/b3/31/aba85e71ba6bb3a31255afff8e163d7d540a_1920xt1080_S1000.jpg",
    "completed": "",
    "description": "\"How to Survive 2: Storm Warning Edition\" is an enhanced version of the 2016 survival action RPG developed by Eko Software. Set in the zombie-infested bayou of Louisiana, this game challenges players to endure the undead apocalypse while facing the additional threat of severe weather conditions. As a survivor, you'll need to scavenge for resources, craft weapons and tools, build and upgrade your shelter, and learn essential survival skills to stay alive in this harsh and unforgiving environment.\n\nThe 'Storm Warning Edition' typically includes all previously released DLC, offering an expanded experience with new characters, missions, and challenges. Players can tackle the zombie hordes and the elements solo or team up with friends in cooperative multiplayer, where teamwork and resource management are crucial for survival. The game features a crafting system that allows you to create a wide array of items, from basic tools to powerful firearms. With its focus on realistic survival mechanics, intense combat against the undead, and the added dynamic of dangerous storms, \"How to Survive 2: Storm Warning Edition\" provides a challenging and engaging experience for fans of the zombie survival genre on PC, PlayStation 4, Xbox One, and Nintendo Switch.\"",
    "playability": "",
    "time to beat": ""
  },
  {
    "link": "https://www.igdb.com/games/human-fall-flat",
    "mode": "CoOp Campaign",
    "text": "Human Fall Flat",
    "genre": "Puzzle, Platform",
    "image": "../",
    "copies": 1,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://pisces.bbystatic.com/image2/BestBuy_US/images/products/6546/6546174_rd.jpg",
    "completed": "",
    "description": "\"Human: Fall Flat\" is a quirky, open-ended physics-based puzzle platform adventure. Your goal is to escape dreamlands by solving puzzles with nothing but your wits and physics.",
    "playability": "",
    "time to beat": "6 Hours"
  },
  {
    "link": "https://www.igdb.com/games/ilomilo",
    "mode": "CoOp Campaign",
    "text": "Ilo and Milo",
    "genre": "Puzzle, Adventure",
    "image": "../",
    "copies": 1,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://i.ytimg.com/vi/wudSXR6_iUU/sddefault.jpg",
    "completed": "",
    "description": "\"ilomilo\" is a charming puzzle game where you guide the two inseparable friends, ilo and milo, as they navigate intricate and surreal environments to reunite. Released in 2010 and developed by Southend Interactive, this game offers a unique blend of cooperative and single-player gameplay, challenging players to manipulate blocks, pathways, and the characters themselves to solve the increasingly complex puzzles.\n\nEach level presents a series of interconnected cubes and platforms, and your goal is to bring ilo and milo together. While you can control both characters simultaneously in single-player, the game truly shines in its cooperative mode, where two players each take control of one friend. Communication and coordination are essential to overcome obstacles, create new paths, and utilize each character's abilities effectively. The game's gentle learning curve and increasingly intricate level design provide a satisfying and engaging experience for players of all ages.\n\n\"ilomilo\" is celebrated for its distinctive art style, featuring a soft, toy-like aesthetic that contributes to its whimsical and relaxing atmosphere. The game's ambient soundtrack further enhances the experience, creating a soothing and immersive world. With its inventive puzzle mechanics and its emphasis on friendship and cooperation, \"ilomilo\" stands as a delightful and memorable title in the puzzle genre, originally released on Xbox Live Arcade and later ported to other platforms.",
    "playability": "",
    "time to beat": "4 Hours"
  },
  {
    "link": "https://www.igdb.com/games/it-takes-two",
    "mode": "CoOp Campaign",
    "text": "IT TAKES TWO",
    "genre": "Platform, Puzzle, Adventure",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "details": "EA",
    "imageUrl": "https://wallpapercat.com/w/full/5/2/4/84825-1920x2716-mobile-hd-it-takes-two-background-photo.jpg",
    "completed": "🏆",
    "COMPLETED?": "🏆",
    "description": "\"It Takes Two,\" released in 2021 by Hazelight Studios and published by Electronic Arts, is a critically acclaimed cooperative action-adventure platformer that delivers a heartwarming and inventive experience. Designed exclusively for two players, this game tells the story of Cody and May, a married couple on the brink of divorce who are magically transformed into dolls. Their only hope to return to their human forms is to work together and mend their fractured relationship.\n\nPlayers are immersed in a whimsical and imaginative world where everyday objects become larger-than-life obstacles and challenges. Each level introduces unique gameplay mechanics that require seamless cooperation and communication between the two players. From platforming and puzzle-solving to action sequences and mini-games, \"It Takes Two\" constantly surprises with its variety and creativity. The game's narrative is as important as its gameplay, exploring themes of love, communication, and compromise in a relatable and engaging way.\n\nWith its stunning visuals, emotional storytelling, and innovative cooperative gameplay, \"It Takes Two\" offers a memorable and rewarding experience that celebrates the power of teamwork and connection. The game's Friend's Pass system allows one player to purchase the game, and the other can play for free, making it even easier to share this unique adventure. Available on XBOX, \"It Takes Two\" is a must-play for those seeking a cooperative game that delivers both fun and emotional depth.\" ",
    "playability": "",
    "time to beat": "12 Hours"
  },
  {
    "link": "https://www.igdb.com/games/knights-and-bikes",
    "mode": "CoOp Campaign",
    "text": "Knights on Bikes",
    "genre": "Action, Adventure",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://gameranx.com/wp-content/uploads/2016/07/Knights-Bikes-4K-Wallpaper-2.jpg",
    "completed": "",
    "description": "\"Knights And Bikes,\" released in 2019 by Foam Sword and Double Fine Presents, is a charming cooperative action-adventure game that celebrates the joys of childhood exploration and the power of friendship. Set on a fictional British island in the late 1980s, the game follows the heartwarming story of Nessa and Demelza, two imaginative and adventurous girls who embark on a quest to uncover the secrets of a legendary ancient treasure.\n\nPlayers take control of Nessa and Demelza as they explore the island's vibrant landscapes, from sandy beaches and mysterious forests to ancient ruins and bustling villages. The gameplay blends classic beat 'em up action with puzzle-solving elements, requiring players to utilize the girls' unique abilities and their trusty bicycles to overcome obstacles and battle quirky enemies. The game's emphasis on cooperative play allows two players to experience the adventure together, fostering a sense of shared discovery and camaraderie. However, it can also be enjoyed in single-player mode, with the second character controlled by AI.\n\n\"Knights And Bikes\" is renowned for its hand-painted art style, its witty writing, and its nostalgic portrayal of childhood adventures and the bonds of friendship. With its blend of action, exploration, and a touching narrative, this game offers a delightful and memorable experience for players on XBOX who appreciate a lighthearted and imaginative journey.\" ",
    "playability": "",
    "time to beat": "6 Hours"
  },
  {
    "link": "",
    "mode": "",
    "text": "Legendary: Marvel Card Game",
    "genre": "",
    "image": "../",
    "copies": 0,
    "console": "",
    "details": "",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/6246263c0f3d2738d79c971c/0ee7e0cc-4583-41e6-b799-eec747da78e5/20220108_175929.jpg",
    "completed": "",
    "COMPLETED?": "🏆",
    "description": "\"Legendary: A Marvel Deck Building Game\" is a cooperative card game where players team up as their favorite Marvel heroes to battle iconic villains. Designed by Devin Low and published by Upper Deck Entertainment, this game immerses players in the Marvel universe, allowing them to recruit powerful heroes, defeat villainous masterminds, and overcome challenging scenarios.\n\nEach player starts with a basic deck of S.H.I.E.L.D. agents, but quickly builds their hand by acquiring legendary heroes like Spider-Man, Wolverine, Captain America, and many others. The game features a variety of scenarios inspired by classic Marvel storylines, each with its own unique setup, villains, and challenges. Players must strategically coordinate their actions, utilizing their heroes' abilities and working together to defeat the mastermind's scheme before it's too late.\n\n\"Legendary\" offers a dynamic and engaging gameplay experience with a high degree of replayability. The game's complexity and strategic depth appeal to both casual and hardcore gamers, and its cooperative nature fosters a sense of teamwork and shared accomplishment. With numerous expansions available, the game continues to expand the roster of playable heroes, villains, and scenarios, providing endless opportunities for Marvel fans to create their own legendary team-ups and epic battles.\" ",
    "playability": "OWNED",
    "time to beat": ""
  },
  {
    "link": "https://www.igdb.com/games/livelock",
    "mode": "CoOp Campaign",
    "text": "Livelock",
    "genre": "Action, Shooter, TopDown",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://images8.alphacoders.com/719/719163.jpg",
    "completed": "",
    "description": "\"Livelock,\" released in 2016 by Tuque Games, is a cooperative top-down shooter set in a post-apocalyptic future where machines rule the Earth. Players take on the role of one of the Capital Intellects – uploaded human consciousnesses in powerful mechanical bodies – tasked with reviving what remains of humanity. The game offers a blend of fast-paced, action-packed combat and strategic cooperative gameplay.\n\nPlayers can choose from three distinct Capital Intellects, each with unique abilities and playstyles. Vanguard excels at close-quarters combat, Hex focuses on ranged attacks and crowd control, and Catalyst provides support and defensive capabilities. Whether playing solo or with up to three friends in online or local co-op, players must work together to overcome hordes of robotic enemies, navigate challenging environments, and solve environmental puzzles. The game features a progression system that allows players to customize their Capital Intellects with new weapons, skills, and upgrades, enhancing their combat effectiveness.\n\n\"Livelock\" delivers a visually striking and intense experience, with its focus on cooperative action and character customization. The game's narrative explores themes of consciousness, survival, and the struggle to reclaim a world lost to machines. Available on XBOX, \"Livelock\" offers a thrilling and strategic top-down shooter experience for those who enjoy cooperative gameplay and futuristic settings.\" ",
    "playability": "",
    "time to beat": "5 Hours"
  },
  {
    "link": "https://www.igdb.com/games/lovers-in-a-dangerous-spacetime",
    "mode": "Local CoOp",
    "text": "LOVERS In A Dangerous Spacetime",
    "genre": "Action, Space, CoOp",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://images.pushsquare.com/ab5789d54855a/large.jpg",
    "completed": "",
    "COMPLETED?": "🏆",
    "description": "Explore a colorful galaxy in a massive neon battleship that you control together with up to 4 players. Each player pilots a different ship system, requiring teamwork to survive and find lost space-bunnies!",
    "playability": "",
    "time to beat": "6 Hours"
  },
  {
    "link": "https://www.igdb.com/games/marvel-ultimate-alliance",
    "mode": "CoOp Campaign",
    "text": "Marvel ultimate alliance",
    "genre": "Action RPG, Superhero",
    "image": "../assets/img/Spin The Wheel Photos/CO-OP/MarvelUA.jpg",
    "copies": 1,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://www.psu.com/wp/wp-content/uploads/2007/08/wolverine.jpg",
    "completed": "",
    "description": "Marvel Ultimate Alliance is an action role-playing game featuring over 22 playable characters from the Marvel Universe. Players can create their own team of heroes and engage in both story-driven and non-linear gameplay.",
    "playability": "",
    "time to beat": "15 Hours"
  },
  {
    "link": "",
    "mode": "",
    "text": "Marvel Ultimate Alliance 3: The Black Order ",
    "genre": "",
    "image": "../",
    "copies": 0,
    "console": "SWITCH",
    "details": "",
    "imageUrl": "https://images6.alphacoders.com/102/1028050.jpg",
    "completed": "",
    "description": "",
    "playability": "",
    "time to beat": ""
  },
  {
    "link": "",
    "mode": "",
    "text": "Marvel's Avengers",
    "genre": "",
    "image": "../",
    "copies": 0,
    "console": "",
    "details": "",
    "imageUrl": "https://4kwallpapers.com/images/wallpapers/marvels-avengers-marvel-superheroes-playstation-4-3840x2160-4969.jpg",
    "completed": "",
    "description": "",
    "playability": "",
    "time to beat": ""
  },
  {
    "link": "https://www.igdb.com/games/minecraft-dungeons",
    "mode": "CoOp Campaign",
    "text": "Minecraft Dungeons",
    "genre": "Action RPG, Dungeon Crawler",
    "image": "../",
    "copies": 1,
    "console": "XBOX",
    "details": "Mojang",
    "imageUrl": "https://images6.alphacoders.com/108/1082090.jpg",
    "completed": "",
    "description": "Fight your way through an all-new action-adventure game, inspired by classic dungeon crawlers and set in the Minecraft universe! Up to four players can team up and fight together in local and online co-.",
    "playability": "",
    "time to beat": "8 Hours"
  },
  {
    "link": "https://www.igdb.com/games/monster-hunter-rise",
    "mode": "CoOp Multiplayer",
    "text": "Monster hunter rise",
    "genre": "Action RPG, Monster Hunting",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "details": "Capcom",
    "imageUrl": "https://images2.alphacoders.com/130/1305009.jpeg",
    "completed": "",
    "description": "Rise to the challenge and join the hunt! Monster Hunter Rise is the latest installment in the action RPG series, delivering a mix of classic elements and unique new mechanics for both solo and multiplayer gameplay.",
    "playability": "",
    "time to beat": "40 Hours"
  },
  {
    "link": "",
    "mode": "",
    "text": "NBA2k (WNBA Season)",
    "genre": "",
    "image": "../",
    "copies": 0,
    "console": "",
    "details": "",
    "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQmonlmBQ6nWGYdzU6Bji4AdDIhmH4OutyZYA&s",
    "completed": "",
    "description": "",
    "playability": "",
    "time to beat": ""
  },
  {
    "link": "https://www.igdb.com/games/out-of-space",
    "mode": "Local CoOp",
    "text": "Out of Space CoOpuch Edition",
    "genre": "Strategy, Simulation",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://www.nintendo.com/eu/media/images/10_share_images/games_15/nintendo_switch_download_software_1/H2x1_NSwitchDS_OutOfSpaceCoOpuchEdition.jpg",
    "completed": "",
    "COMPLETED?": "🏆",
    "description": "Out of Space is a co- game about living together in space. Clean up, furnish and maintain a house in space while dealing with alien goo and doing chores to survive your daily space-life with your friends.",
    "playability": "",
    "time to beat": "8 Hours"
  },
  {
    "link": "https://www.igdb.com/games/outriders",
    "mode": "CoOp Campaign",
    "text": "OUTRIDERS",
    "genre": "Action RPG, Shooter",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2021/03/Outriders_Launch-Thumbnail-XBOX-wireplaceholder_JPG.jpg",
    "completed": "",
    "COMPLETED?": "🏆",
    "description": "OUTRIDERS is a 1-3 player co- RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you'll create your own Outrider and embark on a journey across the hostile planet.",
    "playability": "",
    "time to beat": "20 Hours"
  },
  {
    "link": "https://www.igdb.com/games/overcooked",
    "mode": "Local CoOp",
    "text": "Overcooked",
    "genre": "Simulation, Party",
    "image": "../",
    "copies": 1,
    "console": "XBOX",
    "imageUrl": "https://images5.alphacoders.com/116/1164433.jpg",
    "completed": "",
    "description": "Overcooked is a chaotic couch co- cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook and serve up a variety of tasty orders before the baying customers storm out.",
    "playability": "",
    "time to beat": "7 Hours"
  },
  {
    "link": "https://www.igdb.com/games/palworld",
    "mode": "CoOp Multiplayer",
    "text": "Palworld",
    "genre": "Action RPG, Survival",
    "image": "../",
    "copies": 2,
    "console": "XBOX",
    "imageUrl": "https://images7.alphacoders.com/134/1348510.jpeg",
    "completed": "",
    "description": "Palworld is a multiplayer survival crafting game where you can collect mysterious creatures called 'Pals'. Build facilities, fight alongside your Pals, and experience a completely new type of survival game!",
    "playability": "",
    "time to beat": "25 Hours"
  },
  {
    "link": "https://www.igdb.com/games/payday-2",
    "mode": "CoOp Campaign",
    "text": "Payday 2 Crimewave",
    "genre": "Action, FPS",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://images.alphacoders.com/104/1047164.jpg",
    "completed": "",
    "description": "PAYDAY 2 is an action-packed, four-player co- shooter where you rob banks and get paid. The Crimewave edition includes all DLC and enhanced features.",
    "playability": "",
    "time to beat": "23 Hours"
  },
  {
    "link": "",
    "mode": "",
    "text": "Photosynthesis",
    "genre": "Board Game",
    "image": "../",
    "copies": 0,
    "console": "",
    "details": "",
    "imageUrl": "https://assetsio.gnwcdn.com/photosynthesis-board-game-layout.jpg?width=1200&height=1200&fit=bounds&quality=70&format=jpg&auto=webp",
    "completed": "",
    "COMPLETED?": "🏆",
    "description": "",
    "playability": "OWNED",
    "time to beat": ""
  },
  {
    "link": "https://www.igdb.com/games/plateup",
    "mode": "Local CoOp",
    "text": "Plate UP!",
    "genre": "Simulation, Strategy",
    "image": "../assets/img/Spin The Wheel Photos/CO-OP/Plate UP!.jpg",
    "copies": 5,
    "console": "XBOX",
    "imageUrl": "https://m.media-amazon.com/images/I/81J6zlCtQ3L.jpg",
    "completed": "",
    "description": "PlateUp! is a roguelite management game where you run a restaurant with your friends. Design your kitchen, cook delicious recipes, and serve hungry customers in this challenging co- experience.",
    "playability": "GAMEPASS",
    "time to beat": "15 Hours"
  },
  {
    "link": "https://www.igdb.com/games/portal-2",
    "mode": "CoOp Campaign",
    "text": "PORTAL 2",
    "genre": "Puzzle, 1stPerson",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://www.hdwallpapers.in/download/portal_2_game-wide.jpg",
    "completed": "🏆",
    "COMPLETED?": "🏆",
    "description": "Portal 2 draws from the award-winning formula of innovative gameplay, story, and music that earned the original Portal over 70 industry accolades and created a cult following.",
    "playability": "",
    "time to beat": "8.5 Hours"
  },
  {
    "link": "https://www.igdb.com/games/red-dead-redemption-2",
    "mode": "CoOp Story Missions",
    "text": "Red Dead Redemption 2",
    "genre": "Action Adventure, Open World",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "details": "Rockstar Games",
    "imageUrl": "https://wallpaperswide.com/download/red_dead_redemption_2_cowgirl_western_video_game-wallpaper-3840x2160.jpg",
    "completed": "🏆",
    "description": "America, 1899. Arthur Morgan and the Van der Linde gang are outlaws on the run. With federal agents and the best bounty hunters in the nation massing on their heels, the gang must rob, steal and fight their way across the rugged heartland of America in order to survive.",
    "playability": "",
    "time to beat": "47 Hours"
  },
  {
    "link": "https://www.igdb.com/games/redfall",
    "mode": "CoOp Campaign",
    "text": "Redfall",
    "genre": "FPS, Open World",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://images4.alphacoders.com/115/1151727.jpg",
    "completed": "🏆",
    "COMPLETED?": "🏆",
    "description": "The island town of Redfall, Massachusetts, is under siege by a legion of vampires who have cut off the island from the outside world. Trapped with a handful of survivors, choose from a roster of heroes and squad up to create the perfect team of vampire slayers.",
    "playability": "",
    "time to beat": "15 Hours"
  },
  {
    "link": "https://www.igdb.com/games/resident-evil-revelations-2",
    "mode": "CoOp Campaign",
    "text": "Resident evil revelation 2",
    "genre": "Survival Horror, Action",
    "image": "../",
    "copies": 1,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://www.itl.cat/pngfile/big/9-95574_revelations-2-hd-wallpapers-resident-evil-revelations-2.jpg",
    "completed": "",
    "COMPLETED?": "🏆",
    "description": "The beginning of the Resident Evil Revelations 2 tale sees fan favorite Claire Redfield make a dramatic return. Survivor of the Raccoon City incident depicted in previous Resident Evil games, Claire now works for the anti-bioterrorism organization Terra Save.",
    "playability": "",
    "time to beat": "11 Hours"
  },
  {
    "link": "https://www.igdb.com/games/sea-of-thieves",
    "mode": "Online CoOp",
    "text": "Sea of thieves",
    "genre": "Action Adventure, Pirate",
    "image": "../assets/img/Spin The Wheel Photos/CO-OP/Sea Of Thieves.jpg",
    "copies": 2,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://shadow.tech/app/uploads/2025/01/SEAOFTHIEVES_KEYART.jpg",
    "completed": "",
    "description": "A shared-world action-adventure game that lets you be the pirate you've always dreamed of in a vast, fantastical world filled with treasure, mystery and fearsome enemies.",
    "playability": "",
    "time to beat": "30 Hours"
  },
  {
    "link": "",
    "mode": "",
    "text": "Space lines fare out",
    "genre": "",
    "image": "../",
    "copies": 0,
    "console": "",
    "details": "",
    "imageUrl": "https://images.alphacoders.com/124/thumb-1920-1249151.png",
    "completed": "",
    "COMPLETED?": "🏆",
    "description": "",
    "playability": "",
    "time to beat": ""
  },
  {
    "link": "https://www.igdb.com/games/state-of-decay-2",
    "mode": "CoOp Campaign",
    "text": "State of Decay 2",
    "genre": "Survival Horror, Open World",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://images4.alphacoders.com/130/1305362.jpeg",
    "completed": "",
    "COMPLETED?": "🏆",
    "description": "The dead have risen and civilization has fallen. Not even the military could stop the zombies, and now it's up to you to gather survivors and build a community in a post-apocalyptic world – a world where every decision matters, and where you define what it means to survive.",
    "playability": "",
    "time to beat": "20 Hours"
  },
  {
    "link": "https://www.igdb.com/games/stranded-deep",
    "mode": "CoOp Campaign",
    "text": "Stranded Deep",
    "genre": "Survival, Adventure",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "details": "",
    "imageUrl": "https://w0.peakpx.com/wallpaper/584/377/HD-wallpaper-stranded-deep-game-pc-xbox.jpg",
    "completed": "",
    "description": "Take the role of a plane crash survivor stranded in the Pacific Ocean. CoOpme face to face with some of the most life threatening scenarios in a procedurally generated world. Explore underwater and island environments as you hunt for supplies to craft the tools, weapons, and shelter you'll need to stay alive.",
    "playability": "MUST BUY",
    "time to beat": "25 Hours"
  },
  {
    "link": "https://www.igdb.com/games/streets-of-rage-4",
    "mode": "CoOp Campaign",
    "text": "Streets of rage 4",
    "genre": "Beat 'em up, Action",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://images.alphacoders.com/107/1077492.jpg",
    "COMPLETED?": "🏆",
    "description": "The all-time classic Streets of Rage, known as Bare Knuckle in Japan, is a beat 'em up series known for this timeless gameplay and electronic dance influenced music.",
    "time to beat": "4 Hours"
  },
  {
    "link": "https://www.igdb.com/games/terraria",
    "mode": "CoOp Multiplayer",
    "text": "Terraria",
    "genre": "Action, Adventure, Sandbox",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://wallpapers.com/images/featured/terraria-9jnp0hmkf1tqc0l2.jpg",
    "description": "Dig, fight, explore, build! Nothing is impossible in this action-packed adventure game. Join the adventure in this 2D sandbox game where the world is your canvas and the ground itself is your paint.",
    "time to beat": "50 Hours"
  },
  {
    "link": "https://www.igdb.com/games/tetris-effect-connected",
    "mode": "CoOp Multiplayer",
    "text": "Tetris effect: connected",
    "genre": "Puzzle, Music",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://wallpapers.com/images/hd/tetris-effect-connected-oibc4vrp3j6i8ugo.jpg",
    "description": "Tetris Effect: CoOpnnected adds all-new co- and competitive online and local multiplayer modes to the original game, including Zone Battle, a one-on-one battle of cascading line clears and remote games.",
    "time to beat": "3 Hours"
  },
  {
    "link": "https://www.igdb.com/games/the-ascent",
    "mode": "CoOp Campaign",
    "text": "The ASCENT",
    "genre": "Action RPG, Cyberpunk",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://images6.alphacoders.com/117/1170861.jpg",
    "COMPLETED?": "🏆",
    "description": "The Ascent is a solo and co- Action-shooter RPG set in a cyberpunk world. The mega corporation that owns you and everyone, The Ascent Group, has just collapsed. Can you survive without it?",
    "time to beat": "12 Hours"
  },
  {
    "link": "https://www.igdb.com/games/teenage-mutant-ninja-turtles-shredder-s-revenge",
    "mode": "CoOp Campaign",
    "text": "TMNT: Shredders Revenge",
    "genre": "Beat 'em up, Action",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://images.alphacoders.com/124/1248051.png",
    "COMPLETED?": "🏆",
    "description": "Teenage Mutant Ninja Turtles: Shredder's Revenge features groundbreaking gameplay rooted in timeless classic brawling mechanics, brought to you by the beat 'em up experts at Dotemu and Tribute Games.",
    "time to beat": "2.5 Hours"
  },
  {
    "link": "https://www.igdb.com/games/unravel-two",
    "mode": "CoOp Campaign",
    "text": "Unravel Two",
    "genre": "Platform, Puzzle",
    "image": "../",
    "copies": 0,
    "imageUrl": "https://images5.alphacoders.com/947/947353.jpg",
    "COMPLETED?": "🏆",
    "description": "When you cut ties to the past, new bonds form. In Unravel Two, create a Yarny of your very own. Then build relationships with other Yarnys in local co- or as a single player, fostering friendship and support as you journey together.",
    "time to beat": "6 Hours"
  },
  {
    "link": "https://www.igdb.com/games/valheim",
    "mode": "CoOp Multiplayer",
    "text": "Valheim",
    "genre": "Survival, Action, Open World",
    "image": "../",
    "copies": 0,
    "console": "PC",
    "imageUrl": "https://wallpapers.com/images/hd/valheim-iron-gate-official-poster-jd4yumfoubb0h788.jpg",
    "description": "A brutal exploration and survival game for 1-10 players, set in a procedurally-generated purgatory inspired by viking culture. Battle, build, and conquer your way to a saga worthy of Odin's patronage!",
    "time to beat": "70 Hours"
  },
  {
    "link": "https://www.igdb.com/games/vampire-survivors",
    "mode": "CoOp Local",
    "text": "Vampire survivors",
    "genre": "Action, Roguelike",
    "image": "../assets/img/Spin The Wheel Photos/CO-OP/Vampire Survivors.JPG",
    "copies": 3,
    "imageUrl": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2022/03/Feature-Image_Vampire-Survivors-Build-for-Mad-Forest-1.jpg",
    "description": "Vampire Survivors is a gothic horror casual game with roguelite elements. Fight against continuous waves of monsters and survive until the timer runs out while collecting items and powering up!",
    "time to beat": "8 Hours"
  },
  {
    "link": "https://www.igdb.com/games/warframe",
    "mode": "CoOp Campaign",
    "text": "WarFrame",
    "genre": "Action RPG, Shooter",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://images3.alphacoders.com/111/1117710.jpg",
    "description": "Warframe is a free-to-play cooperative third-person shooter set in an evolving sci-fi world. Join your friends in player-vs-enemy raids across the solar system and master the power of the Warframes.",
    "time to beat": "40 Hours"
  },
  {
    "link": "https://www.igdb.com/games/wilmots-warehouse",
    "mode": "CoOp Local",
    "text": "Wilmonts Warehouse",
    "genre": "Puzzle, Strategy",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/19190458/Screenshot_customers.png?quality=90&strip=all&crop=0,3.4613147178592,100,93.077370564282",
    "description": "A game about keeping a warehouse running in tip-top shape. You play as Wilmot, a hard working warehouse employee tasked with organizing and storing everything that arrives. Work with a friend in local co- to manage your warehouse efficiently!",
    "time to beat": "10 Hours"
  },
  {
    "link": "https://www.igdb.com/games/zheros",
    "mode": "CoOp Campaign",
    "text": "ZHEROS",
    "genre": "Beat 'em up, Action",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/423270/capsule_616x353.jpg?t=1493118832",
    "description": "ZHEROS is a next gen beat'em up based on combat and action. Fight against armies of robots and bizarre creatures either alone or in co- mode. Face challenging enemies, upgrade your combat skills and discover new ways to eliminate your foes!",
    "time to beat": "6 Hours"
  },
  {
    "link": "https://www.igdb.com/games/zombie-army-4-dead-war",
    "mode": "CoOp Campaign",
    "text": "Zombie Warrior 4: Dead War",
    "genre": "Action, FPS, Zombie",
    "image": "../",
    "copies": 0,
    "console": "XBOX",
    "imageUrl": "https://images8.alphacoders.com/107/1070065.jpg",
    "completed": "",
    "description": "Hitler's hordes are back for more in this spine-chilling shooter from the makers of Sniper Elite 4! Abominable occult enemies, epic weapons and a harrowing new campaign for 1-4 players await in 1940s Europe, as you fight to save humankind from undead Armageddon!",
    "playability": "",
    "time to beat": "15 Hours"
  }
]