[
  { "text": "CyberBadger Cete",
    "game": "ERGOarena",
    "details": "CyberBadger Cete ATTACKS!",
    "image": ["../assets/img/ERGOvillians/ErgoBadgers (ErgoVillian) .jpg",
    "../assets/img/ERGOvillians/ErgoBadgers variant 1 (ErgoVillian) .jpg",
    "../assets/img/ERGOvillians/ErgoBadgers variant 2 (ErgoVillian) .jpg",
    "../assets/img/ERGOvillians/ErgoBadgers variant 3 (ErgoVillian) .jpg"], 
    "copies": 19,
    "reward": "Party leader gets to pick any available PVP game this week.",
    "punishment": "Party leader deletes 1 HCMC probability and 2 weekday “FUN” events. Start up HCMC again unless PVP has been removed.",
    "genre": "ERGOvillians",
    "mode": "ERGOarena",
    "Time per match": "6mins",
    "link": "https://ergosphere-02b692b18f50.herokuapp.com/pages/BossFight.html",
    "description": "The CyberBadger Cete has ambushed you! Defend your party from the CyberBadger Cete and claim your reward!",
    "imageUrl": ""
  },  
  { "text": "PURSCERx17",
    "game": "ERGOarena",
    "details": "PURSCERx17 ATTACKS!",
    "image": "../assets/img/ERGOvillians/PURSCERx17 (ErgoVillian) .jpg",
    "copies": 1,
    "reward": "Party leader gets to pick any available PVP game for the week. Party also gains 50 ducats ",
    "punishment": " {AGRESSER} Add 10 mins to daily 30 min work out for the rest of the week. Spinner Deletes 2 spin options and 2 weekday “FUN” events (can not be PvP). No PvP game will be picked this week.",
    "genre": "ERGOvillians",
    "mode": "ERGOarena",
    "Time per match": "6mins",
    "link": "https://ergosphere-02b692b18f50.herokuapp.com/pages/BossFight.html",
    "description": "STRENGTH",
    "imageUrl": ""
  },  
  { "text": "Forbearer Ramis",
    "game": "ERGOarena",
    "details": "Forbearer Ramis ATTACKS!",
    "image": "../assets/img/ERGOvillians/Forbearer Ramis (ErgoVillian) .jpg",
    "copies": 1,
    "reward": "Party leader gets to pick any available PVP game for the week. Party also gains 50 ducats ",
    "punishment": "{CONFUSION} All rounds for fight night have the “Confusion” mod for this week.Party leader deletes 2 spin options and 2 weekday “FUN” events (can not be PvP). No PvP game will be picked this week. ",
    "genre": "ERGOvillians",
    "mode": "ERGOarena",
    "Time per match": "6mins",
    "link": "https://ergosphere-02b692b18f50.herokuapp.com/pages/BossFight.html",
    "description": "CONSTITUTION",
    "imageUrl": ""
  },  
  { "text": "Aphen Neel",
    "game": "ERGOarena",
    "details": "Aphen Neel ATTACKS!",
    "image": "../assets/img/ERGOvillians/Aphen Neel (ErgoVillian) .jpg",
    "copies": 1,
    "reward": "Party leader gets to pick any available PVP game for the week. Party also gains 50 ducats ",
    "punishment": "{DECEPTION} All bets only pay half of the winnings this week. Party leader deletes 2 spin options and 2 weekday “FUN” events (can not be PvP). No PvP game will be picked this week. ",
    "genre": "ERGOvillians",
    "mode": "ERGOarena",
    "Time per match": "6mins",
    "link": "https://ergosphere-02b692b18f50.herokuapp.com/pages/BossFight.html",
    "description": "INTELLINGENCE",
    "imageUrl": ""
  },  
  { "text": "CURVE",
    "game": "ERGOarena",
    "details": "CURVE ATTACKS!",
    "image": "../assets/img/ERGOvillians/Curve (ErgoVillian) .jpg", 
    "copies": 1,
    "reward": "Party leader gets to pick any available PVP game for the week. Party also gains 50 ducats ",
    "punishment": "{CLAIRVOYANCE} Block and positive weekly mods gained next week. Party leader deletes 2 spin options and 2 weekday “FUN” events (can not be PvP). No PvP game will be picked this week ",
    "genre": "ERGOvillians",
    "mode": "ERGOarena",
    "Time per match": "6mins",
    "link": "https://ergosphere-02b692b18f50.herokuapp.com/pages/BossFight.html",
    "description": "PERCEPTION",
    "imageUrl": ""
  },  
  {"game": "3ON3 FREESTYLE",
    "details": "",
    "image": "../assets/img/Spin The Wheel Photos/PVP/3ON3 FREESTYLE.png",
    "text": "3ON3 FREESTYLE",
    "copies": 4,
    "console": "XBOX",
    "genre": "Sports",
    "mode": "quickplay",
    "Time per match": "8mins",
    "playability": "Free to play",
    "link": "https://www.igdb.com/games/3on3-freestyle",
    "description": "Welcome to one of the most vibrant, diverse, exciting and competitive but unifying sports in the world - street basketball. Pick your player from a pool of custom-designed, one-of-a-kind characters based on real-life street basketball players, team up with your friends online or in-person, and hit the court to play authentic, fast-paced 3 on 3 street basketball real-time matches against live opponents in settings inspired by the world’s most-revered street basketball venues. Once the ball is tipped, you can take on opponents with the signature, jaw-dropping basketball tricks each character possesses, link up with your teammates for soaring alley-oops and no-look passes, and create your own style which turns you into a street basketball legend.",
    "imageUrl": "https://static.invenglobal.com/upload/image/2020/09/01/i1598933182160053.jpeg"
  },
  {"game": "Super Animal Royale",
      "details": "Quick play mode",
      "image": "../assets/img/Spin The Wheel Photos/PVP/Animal Royal.PNG",
      "text": "Animal Royal",
      "copies": 0,
      "console": "XBOX",
      "genre": "Shooter",
      "mode": "quickplay",
      "Time per match": "",
      "playability": "Free to play",
      "link": "https://www.igdb.com/games/super-animal-royale",
      "description": "Super Animal Royale is a top-down 2D battle royale with a unique twist: the combatants are adorable, yet fiercely competitive, animals. Developed and published by Pixile Studios, this game throws up to 64 players into a vibrant and chaotic arena where survival is the name of the game. Choose your animal, from a variety of foxes, bears, squirrels, and more, and customize them with a wide array of outfits and weapons. Parachute into the island and scavenge for firearms, explosives, and health items to outlast your opponents. The game's charm lies in its contrast between the cute animal characters and the intense, fast-paced action. While the art style is colorful and whimsical, the gameplay is strategic and demanding, requiring quick reflexes and tactical awareness. Super Animal Royale offers a refreshing take on the battle royale genre, blending cuteness with carnage in a way that is both entertaining and addictive.",
      "imageUrl": "https://images7.alphacoders.com/116/thumb-1920-1168998.jpg"
  },
  {"game": "Apex Legends",
    "details": "Quick play mode",
    "image": "../assets/img/Spin The Wheel Photos/PVP/Apex Legends.jpg",
    "text": "Apex Legends",
    "copies": 2,
    "console": "XBOX",
    "genre": "Shooter, Tactical",
    "mode": "quickplay",
    "Time per match": "",
    "playability": "Free to play",
    "link": "https://www.igdb.com/games/apex-legends",
    "description": "Apex Legends, developed by Respawn Entertainment, is a fast-paced and dynamic hero shooter set in the Titanfall universe. This free-to-play battle royale game distinguishes itself with its focus on squad-based combat, where players form teams of three and choose from a diverse roster of 'Legends,' each with unique abilities and playstyles. Set in the Outlands, a region beyond the Frontier War, players engage in intense firefights, utilizing a variety of weapons and tactical maneuvers. Communication and coordination are crucial for success, as squads must work together to survive and outmaneuver their opponents. Beyond the core battle royale mode, Apex Legends offers various limited-time modes and arenas, constantly evolving the gameplay experience. With its smooth gunplay, innovative movement mechanics, and engaging character design, Apex Legends has established itself as a prominent force in the battle royale genre, offering a blend of strategic depth and adrenaline-pumping action.",
    "imageUrl": "https://wallpapers.com/images/hd/apex-legends-4k-map-view-5clcoiylm9etu5kk.jpg"
  },
  {"game": "Destiny 2 Crucible",
    "details": "Competitive mode",
    "image": "../assets/img/Spin The Wheel Photos/PVP/Destiny 2 Crucible.jpg",
    "text": "Destiny 2 Crucible",
    "copies": 5,
    "console": "XBOX",
    "genre": "Shooter, Role-playing (RPG), Adventure",
    "mode": "quickplay",
    "Time per match": "",
    "playability": "Owned",
    "link": "https://www.igdb.com/games/destiny-2",
    "description": "Destiny 2 is a dynamic and evolving first-person shooter set in a shared-world environment. Developed by Bungie, the game immerses players in a rich science fiction universe where they assume the role of Guardians, protectors of Earth wielding incredible powers. The Crucible is the dedicated player-versus-player (PvP) arena within Destiny 2, offering a variety of competitive modes where Guardians clash in intense firefights. From classic team deathmatch to objective-based modes and elimination rounds, the Crucible provides a thrilling test of skill, strategy, and reflexes. Players can customize their Guardians with a vast arsenal of weapons, armor, and abilities, creating unique builds to dominate the battlefield. Destiny 2 is known for its fluid gunplay, its blend of futuristic weaponry and supernatural powers, and its ongoing updates that introduce new maps, modes, and challenges to the Crucible experience.",
    "imageUrl": "https://a-static.besthdwallpaper.com/destiny-2-warriors-wallpaper-2560x1920-89510_27.jpg"
  },
  {"game": "Escape Academy",
    "details": "PvP mode, no longer on gamepass",
    "image": "../assets/img/Spin The Wheel Photos/PVP/Escape Academy .png",
    "text": "Escape Academy",
    "copies": 1,
    "console": "XBOX",
    "genre": "Puzzle, Adventure, Visual Novel",
    "mode": "quickplay",
    "Time per match": "45mins",
    "playability": "Gamepass",
    "link": "https://www.igdb.com/games/escape-academy",
    "description": "Welcome to the Escape Academy, a place where aspiring Escapists hone their skills to become the ultimate masters of escape. Developed by Coin Crew Games, this puzzle-adventure title invites players to step into the role of a student at this prestigious institution. You'll tackle a series of intricately designed escape rooms, each with its own unique theme, challenges, and narrative twists. The gameplay involves solving a variety of puzzles, from deciphering codes and riddles to manipulating objects and uncovering hidden clues. You can embark on this escape room adventure solo or team up with a friend in cooperative multiplayer, either locally or online, adding a collaborative layer to the experience. The game also features a colorful cast of characters, including the Academy's faculty, who provide guidance and add to the engaging story. If you enjoy the challenge and excitement of escape rooms, Escape Academy offers a virtual and immersive way to test your wits and puzzle-solving abilities.",
    "imageUrl": "https://images.igdb.com/igdb/image/upload/t_cover_big/co4kjz.webp"
  },
  {"game": "ExoPrimal",
    "details": "Quick play PvP only",
    "image": "../assets/img/Spin The Wheel Photos/PVP/Exoprimal 2.png",
    "text": "ExoPrimal",
    "copies": 0,
    "console": "",
    "genre": "Action",
    "mode": "quickplay",
    "Time per match": "",
    "playability": "Free to Play",
    "link": "",
    "description": "ExoPrimal is a team-based action game that pits players against hordes of dinosaurs in futuristic combat scenarios. Developed by Capcom, the game features squads of players donning advanced exosuits, each with unique abilities and roles, to tackle dynamic objectives. While it includes player-versus-player (PvP) elements, the primary focus is on the cooperative experience of fighting off the dinosaur threat. ExoPrimal blends the thrill of action combat with strategic team play, as players must coordinate their exosuits to survive the onslaught and complete mission objectives. The game offers a unique twist on the dinosaur genre by combining it with futuristic technology and team-based action.",
    "imageUrl": "https://images5.alphacoders.com/121/1219098.jpg"
  },
  {"game": "Fallguys",
      "details": "Doubles mode",
      "image": "../assets/img/Spin The Wheel Photos/PVP/Fall Guys.JPG",
      "text": "Fallguys",
      "copies": 2,
      "console": "",
      "genre": "Party",
      "mode": "quickplay",
      "Time per match": "",
      "playability": "Free to Play",
      "link": "https://www.igdb.com/games/fall-guys",
      "description": "Fall Guys is a vibrant and chaotic massively multiplayer party game where up to 60 players compete in a series of whimsical obstacle courses. Developed by Mediatonic and published by Devolver Digital, the game throws players into a series of escalating challenges, from races and survival rounds to team-based games. The goal is to navigate through these colorful and often unpredictable levels, avoiding elimination and ultimately being crowned the victor. With its emphasis on silly physics, unpredictable outcomes, and a strong sense of fun, Fall Guys has become a popular choice for lighthearted and entertaining multiplayer action.",
      "imageUrl": "https://wallpapers.com/images/hd/fall-guys-ultimate-knockout-start-game-scene-o7jaz69z8p1md0xh.jpg"
  },
  {"game": "FIFA",
    "details": "Online mode, 1- 6min qtrs. game Hard difficulty",
    "image": "../assets/img/Spin The Wheel Photos/PVP/FIFA.jpg",
    "text": "FIFA",
    "copies": 0,
    "console": "",
    "genre": "Sports",
    "mode": "Online",
    "Time per match": "6 mins",
    "playability": "Owned",
    "link": "https://www.igdb.com/games/ea-sports-fc-24",
    "description": "EA SPORTS FC 24, developed by EA Vancouver and EA Romania, is the latest installment in the long-running and highly popular football (soccer) simulation series. It offers a comprehensive and immersive digital football experience, featuring a vast selection of licensed teams, leagues, and players from around the world. Players can engage in various game modes, including career mode, online multiplayer matches, and the popular Ultimate Team mode, where they build their dream squads from player cards. The game is known for its realistic gameplay, aiming to capture the nuances of the sport with accurate player movements, ball physics, and tactical options. With each iteration, the series introduces new features and improvements to enhance the authenticity and depth of the virtual football experience.",
    "imageUrl": "https://c4.wallpaperflare.com/wallpaper/996/342/520/video-game-fifa-18-cristiano-ronaldo-fifa-wallpaper-preview.jpg"
  },
  {"game": "Fortnite",
      "details": "Doubles mode",
      "image": "../assets/img/Spin The Wheel Photos/PVP/Fortnight.jpg",
      "text": "Fortnite",
      "copies": 1,
      "console": "XBOX",
      "genre": "Battle Royale, Creative, Survival",
      "mode": "Doubles",
      "Time per match": "",
      "playability": "Free to Play",
      "link": "https://www.igdb.com/games/fortnite",
      "description": "Fortnite is a multifaceted online game that offers a variety of experiences. The most well-known mode, Battle Royale, pits players against each other in a large-scale free-for-all where the last player or team standing wins. Players parachute onto an island, scavenge for weapons and resources, and build structures to defend themselves and gain a strategic advantage. Beyond Battle Royale, Fortnite also features Creative mode, which empowers players to design and build their own islands and games, fostering creativity and community. Additionally, Fortnite includes Save the World, a cooperative mode where players team up to fight off hordes of monsters and defend their base. This diverse range of gameplay options has contributed to Fortnite's widespread popularity and its evolution beyond a traditional shooter.",
      "imageUrl": "https://c4.wallpaperflare.com/wallpaper/387/450/379/2017-5k-fortnite-wallpaper-preview.jpg"
  },
  {"game": "Fuzion Frenzy",
      "details": "",
      "image": "",
      "text": "Fuzion Frenzy",
      "copies": 0,
      "console": "360",
      "genre": "Arcade",
      "mode": "quickplay",
      "Time per match": "",
      "playability":"" ,
      "link": "https://www.igdb.com/games/fuzion-frenzy",
      "description": "Fuzion Frenzy is a launch title for the Microsoft Xbox. At its core, Fuzion Frenzy is a four-player party game featuring 45 different mini-games (not including the titular Fuzion Frenzy). A demo of the game was included with some other launch titles in the US, including Halo, Munch's Oddysee, the first Project Gotham Racing game and Amped. The title was among the first to be released as a part of the Xbox Originals program.",
      "imageUrl": "https://i.ytimg.com/vi/MCjgCg3boyc/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLAXF9udVX8yR3j8EbUI7DYrAPkhew"
  },
  {"game": "Marvel Rivals",
    "details": "",
    "image": "../assets/img/Spin The Wheel Photos/PVP/Marvel Rivals.jpg",
    "text": "Marvel Rivals",
    "copies": 5,
    "console": "XBOX",
    "genre": "Hero Shooter",
    "mode": "quickplay",
    "Time per match": "",
    "playability": "Free to play",
    "link": "https://www.igdb.com/games/marvel-rivals",
    "description": "Marvel Rivals is a team-based hero shooter where players embody iconic characters from the Marvel Universe. Developed by NetEase Games in collaboration with Marvel Games, it features a diverse roster of heroes and villains, each with unique abilities and playstyles. Teams of players compete in objective-based matches, utilizing their chosen characters' powers and coordinating strategies to achieve victory. The game emphasizes fast-paced action, dynamic environments, and the thrill of controlling beloved Marvel characters in a competitive setting. With its focus on character abilities and teamwork, Marvel Rivals offers a fresh take on the hero shooter genre, drawing upon the rich lore and characters of the Marvel universe.",
    "imageUrl": "https://images3.alphacoders.com/138/1387471.jpg"
  },
  {"game": "Gears 5",
    "details": "PvP quick play",
    "image": "../assets/img/Spin The Wheel Photos/PVP/Gears 5.jpg",
    "text": "Gears 5",
    "copies": 0,
    "console": "",
    "genre": "Third-person shooter",
    "mode": "quickplay",
    "Time per match": "",
    "playability": "Owned",
    "link": "https://www.igdb.com/games/gears-5",
    "description": "Gears 5, developed by The Coalition and published by Xbox Game Studios, is a third-person shooter that continues the acclaimed Gears of War saga. Set on the fictional planet of Sera, the game follows Kait Diaz as she embarks on a journey to uncover the origins of the Locust and her own connection to the enemy. Known for its intense and visceral combat, Gears 5 features a variety of multiplayer modes, including competitive PvP matches where players battle in teams using iconic weapons and cover mechanics. The game emphasizes strategic gameplay, with players utilizing cover, flanking maneuvers, and synchronized attacks to outmaneuver their opponents. Gears 5 also offers a refined version of Horde mode, where players cooperate to survive waves of increasingly difficult enemies. With its focus on action, story, and multiplayer competition, Gears 5 provides a comprehensive and engaging experience for fans of the shooter genre.",
    "imageUrl": "https://images4.alphacoders.com/102/1023659.jpg"
  },
    {"game": "Halo Infinite (2021)",
      "details": "Tactical slayer ranked mode",
      "image": "../assets/img/Spin The Wheel Photos/PVP/Halo Infinite.jpg",
      "text": "Halo Infinite",
      "copies": 3,
      "console": "XBOX",
      "genre": "Shooter",
      "mode": "quickplay",
      "Time per match": "",
      "playability":"" ,
      "link": "https://www.igdb.com/games/halo-infinite",
      "description": "",
      "imageUrl": "https://preview.redd.it/bolce7ycqid51.png?width=1080&crop=smart&auto=webp&s=2b0cec2f22136b8503b7ae0d881f4808963d1a11"
    },
    {"game": "HAWKED!",
      "details": "Quick play mode",
      "image": "../assets/img/Spin The Wheel Photos/PVP/Hawked.PNG",
      "text": "HAWKED!",
      "copies": 1,
      "console": "",
      "genre": "",
      "mode": "quickplay",
      "Time per match": "",
      "playability":"" ,
      "link": "https://www.igdb.com/games/hawked",
      "description": "HAWKED is a PvPvE extraction shooter where you compete with rival players and battle AI enemies while racing to collect precious artifacts. Team up with other Renegades and complete contracts to unlock powerful treasures and get rich in the process!",
      "imageUrl": "https://static-eu.prod-my.games/chronos-public-eu-hw-prod/site/news/2024/02/75-ReleaseAnnouncement/1.jpg"
    },
    {"game": "Headbangers: Rhythm Royale",
      "details": "Quick play mode, no longer on gamepass",
      "image": "../assets/img/Spin The Wheel Photos/PVP/Headbangers Rhythm Royale.PNG",
      "text": "Headbangers: Rhythm Royale",
      "copies": 0,
      "console": "",
      "genre": "",
      "mode": "quickplay",
      "Time per match": "",
      "playability":"" ,
      "link": "",
      "description": "",
      "imageUrl": "https://www.godisageek.com/wp-content/uploads/Headbangers-Rhythm-Royale.jpg"
    },
    {"game": "Hunt showdown 1896",
      "details": "Time to beat - {battle royal}",
      "image": "",
      "text": "Hunt showdown 1896",
      "copies": 0,
      "console": "",
      "genre": "",
      "mode": "quickplay",
      "Time per match": "",
      "playability":"" ,
      "link": "https://www.igdb.com/games/hunt-showdown",
      "description": "Hunt: Showdown is a competitive first-person PvP bounty hunting game with heavy PvE elements. Set in the darkest corners of the world, it packs the thrill of survival games into match-based format.",
      "imageUrl": "https://clan.cloudflare.steamstatic.com/images//30897473/fffbc0169fea137dc5606915cd8f4cc2168f88f0.jpg"
    },
    {"game": "Naraka: Bladepoint",
      "details": "Quick play mode",
      "image": "",
      "text": "Naraka: Bladepoint",
      "copies": 2,
      "console": "",
      "genre": "",
      "mode": "quickplay",
      "Time per match": "",
      "playability":"" ,
      "link": "https://www.igdb.com/games/naraka-bladepoint",
      "description": "NARAKA: BLADEPOINT is a up to 60-player PVP mythical action combat experience with martial arts inspired melee combat, gravity defying mobility, vast arsenals of melee & ranged weapons, legendary customizable heroes with epic abilities.",
      "imageUrl": "https://w0.peakpx.com/wallpaper/805/934/HD-wallpaper-naraka-bladepoint-game.jpg"
    },
    {"game": "NBA 2k",
      "details": "4 3v3 games",
      "image": "../assets/img/Spin The Wheel Photos/PVP/NBA2k Blacktop.PNG",
      "text": "NBA 2k",
      "copies": 0,
      "console": "XBOX",
      "genre": "",
      "mode": "quickplay",
      "Time per match": "",
      "playability":"" ,
      "link": "https://www.igdb.com/games/nba-2k24",
      "description": "NBA 2K24 is the latest iteration of the world-renowned basketball video game franchise. Experience realistic gameplay, manage your team in MyCAREER, and compete online in various game modes.",
      "imageUrl": "https://wallpapercave.com/wp/wp1970961.jpg"
    },
    {"game": "Overwatch 2",
      "details": "Ranked mode",
      "image": "../assets/img/Spin The Wheel Photos/PVP/Overwatch2.webp",
      "text": "Overwatch 2",
      "copies": 5,
      "console": "",
      "genre": "Hero Shooter",
      "mode": "quickplay",
      "Time per match": "",
      "playability": "Free to Play",
      "link": "https://www.igdb.com/games/overwatch-2",
      "description": "Overwatch 2 is a team-based hero shooter that pits two teams of five players against each other in a variety of game modes. Developed by Blizzard Entertainment, the game features a diverse and ever-expanding roster of heroes, each with unique abilities, weapons, and roles. Players choose their hero to contribute to their team's composition, requiring strategic thinking and coordination to achieve victory. Matches take place on maps set in various locations around the globe. Overwatch 2 builds upon the original Overwatch with new heroes, maps, and gameplay changes, while retaining its core focus on fast-paced, objective-based team combat. The game's vibrant art style, dynamic gameplay, and emphasis on teamwork have contributed to its popularity within the competitive gaming scene.",
      "imageUrl": "https://images.squarespace-cdn.com/content/v1/611d60fe1bdfad3944022ea3/1670817335437-4S45B8M5R4M1OMO75U7E/1049881.jpg"
    },
    {"game": "Paladins",
      "details": "Quick play mode",
      "image": "../assets/img/Spin The Wheel Photos/PVP/Paladins.jpg",
      "text": "Paladins",
      "copies": 0,
      "console": "",
      "genre": "",
      "mode": "quickplay",
      "Time per match": "",
      "playability":"" ,
      "link": "https://www.igdb.com/games/paladins",
      "description": "Paladins is a free-to-play fantasy team-based first-person shooter. Players take on the role of a Champion in objective-based game modes including Siege, Team Deathmatch, and Ranked matches.",
      "imageUrl": "https://images5.alphacoders.com/869/thumb-1920-869254.jpg"
    },
    {"game": "POWERSTAR Golf",
     "details": "back 9, Bingwa pick coarse",
     "image": "../assets/img/Spin The Wheel Photos/PVP/POWERSTAR Golf.jpg",
     "text": "POWERSTAR Golf",
     "copies": 3,
     "console": "XBOX",
     "genre": "Sports",
     "mode": "quickplay",
     "Time per match": "1hr",
     "scoring": "",
     "playability":"Owned" ,
     "link": "",
     "description": "\"POWERSTAR Golf,\" released as a launch title for the Xbox One in November 2013, offers an accessible and arcade-style take on the sport of golf. Developed by Zoë Mode and published by Microsoft Studios, this sports game distinguishes itself with unique character abilities and caddies that provide gameplay advantages. Each of the game's characters possesses a special move, allowing for impressive shots and skillful maneuvers, while the caddies offer their own distinct sets of skills to aid players on the course.\n\nBeyond the core golfing mechanics, \"POWERSTAR Golf\" incorporates RPG-like elements. Players earn experience points by completing various challenges on the beautifully stylized 18-hole courses set in exotic locales. These points can be used to level up characters and acquire new gear, including a wide array of clubs and balls, offering a significant degree of customization to suit different playstyles. The game features both single-player career events and asynchronous multiplayer, where players can compete against ghost versions of others on leaderboards, adding a layer of ongoing competition.\n\nReception for \"POWERSTAR Golf\" was mixed, with a Metacritic score of 65/100. While praised for its engaging gameplay, unique character abilities, and accessible nature reminiscent of the \"Hot Shots Golf\" series, some critics noted its last-generation visuals and the inclusion of microtransactions for unlocking gear. Despite this, the game offered a distinct arcade golfing experience on the Xbox One, providing a fun and less simulation-focused alternative to more traditional golf titles. A free version was also available, offering a selection of courses and events, with the option to purchase the full game and additional content such as new courses and characters later on.",
     "imageUrl": "https://www.gamespot.com/a/uploads/screen_kubrick/78/787590/2389870-ci-189874771230337596.jpg"
    },
    {"game": "Predecessor",
     "details": "Quick play mode",
     "image": "../assets/img/Spin The Wheel Photos/PVP/Predecessor.PNG",
     "text": "Predecessor",
     "copies": 3,
     "console": "XBOX",
     "genre": "",
     "mode": "quickplay",
     "Time per match": "",
     "scoring": "",
     "playability":"Owned" ,
     "link": "",
     "description": "\"Predecessor,\" fully released on August 20, 2024, is a free-to-play, third-person multiplayer online battle arena (MOBA) developed and published by Omeda Studios. Born from the ashes of Epic Games' discontinued MOBA, Paragon (2016-2018), Predecessor aims to recapture the unique blend of strategic depth and direct action that made its spiritual predecessor so appealing to its dedicated fanbase. Omeda Studios, founded in 2020 by Robbie Singh, Andrea Garella, and Steven Meilleur, with guidance from Paragon's former creative director Steve Superville, successfully secured funding from Epic Games to bring this vision to life using Unreal Engine 5.\n\nMatches in Predecessor pit two teams of five players against each other on a symmetrical map featuring three lanes, a jungle, and strategically placed defensive towers. The ultimate objective is to destroy the enemy team's core while protecting your own. Players choose from a roster of over 40 unique heroes, each possessing four distinct abilities and a basic attack. As players earn gold and experience during a match by defeating enemies and securing objectives, they can purchase items to customize their hero's build and enhance their abilities, allowing for diverse playstyles and strategic adaptations.\n\nPredecessor entered a buy-to-play early access phase in December 2022 before launching its free-to-play open beta in March 2024, garnering a player base of over two million prior to its full release on PC (via Steam and Epic Games Store), PlayStation 4 and 5, and Xbox Series X|S. While still evolving, Predecessor has been praised by many for its engaging gameplay, faithful recreation of Paragon's core mechanics, and high-quality graphics, aiming to provide both veterans of the original game and newcomers with a fresh and exciting MOBA experience. The game continues to receive updates, with new heroes, items, and features being added to refine and expand the gameplay.",
     "imageUrl": "https://cdnb.artstation.com/p/assets/images/images/051/211/823/large/adriano-grasso-promocombo-funding-final.jpg?1656709539"
    },
    {"game": "PUBG: Battlegrounds",
     "details": "Quick play mode",
     "image": "",
     "text": "PUBG: Battlegrounds",
     "copies": 0,
     "console": "XBOX",
     "genre": "",
     "mode": "quickplay",
     "Time per match": "",
     "scoring": "",
     "playability":"Owned" ,
     "link": "https://www.igdb.com/games/pubg-battlegrounds",
     "description": "PUBG: BATTLEGROUNDS is a battle royale shooter that pits 100 players against each other in a struggle for survival. Gather supplies and outwit your opponents to become the last person standing.",
     "imageUrl": "https://www.hdwallpapers.in/download/pubg_playerunknowns_battlegrounds_4k_hd-3840x2160.jpg"   
    },
    {"game": "ROCKET LEAGUE",
     "details": "Quick play mode",
     "image": "",
     "text": "ROCKET LEAGUE",
     "copies": 0,
     "console": "XBOX",
     "genre": "",
     "mode": "quickplay",
     "Time per match": "",
     "scoring": "",
     "playability":"Owned" ,
     "link": "https://www.igdb.com/games/rocket-league",
     "description": "Rocket League is a high-powered hybrid of arcade-style soccer and vehicular mayhem with easy-to-understand controls and fluid, physics-driven competition. Hit the field by yourself or with friends in 1v1, 2v2, and 3v3 matches.",
     "imageUrl": "https://wallpapersok.com/images/hd/rocket-league-poster-art-gc3hnsq6vdkak9y9.jpg"
    },
    {"game": "Rogue Company",
     "details": "Quick play mode",
     "image": "",
     "text": "Rogue Company",
     "copies": 0,
     "console": "XBOX",
     "genre": "",
     "mode": "quickplay",
     "Time per match": "",
     "scoring": "",
     "playability":"Owned" ,
     "link": "https://www.igdb.com/games/rogue-company",
     "description": "Rogue Company is a free-to-play multiplayer tactical third-person hero shooter. Choose your Rogue, master their abilities, and dominate your opponents in objective-based game modes.",
     "imageUrl": "https://images2.alphacoders.com/109/1093135.png"
        
    },
    {"game": "Smite",
     "details": "Quick play mode",
     "image": "",
     "text": "Smite",
     "copies": 0,
     "console": "XBOX",
     "genre": "MOBA",
     "mode": "quickplay",
     "Time per match": "",
     "scoring": "",
     "playability":"Owned" ,
     "link": "https://www.igdb.com/games/smite",
     "description": "SMITE is the multiplayer online battle arena that puts players in control of mythological gods from a third-person perspective. Join over 35 million players in the ultimate Battleground of the Gods!",
     "imageUrl": "https://4kwallpapers.com/images/wallpapers/smite-2-2024-games-3840x2160-14814.jpg"   
    },
    {"game": "Sonic all-star racing",
     "details": "Quick play mode",
     "image": "",
     "text": "Sonic all-star racing",
     "copies": 1,
     "console": "XBOX",
     "genre": "Racing",
     "mode": "2 Grand Prix Runs",
     "Time per match": "15mins",
     "scoring": "",
     "playability":"Owned" ,
     "link": "https://www.igdb.com/games/sonic-all-stars-racing-transformed",
     "description": "Sonic and the All-Stars cast line up on the starting grid once again to battle for supremacy in the ultimate race. Transform your vehicle to race across land, water and air in the most extreme courses ever seen!",
     "imageUrl": "https://images7.alphacoders.com/795/thumb-1920-795029.jpg"
    },
    {"game": "Splitgate",
     "details": "Quick play mode",
     "image": "",
     "text": "Splitgate",
     "copies": 1,
     "console": "XBOX",
     "genre": "",
     "mode": "quickplay",
     "Time per match": "",
     "scoring": "",
     "playability":"Owned" ,
     "link": "https://www.igdb.com/games/splitgate",
     "description": "Splitgate is a free-to-play, fast-paced multiplayer shooter that features player-controlled portals. This sci-fi shooter takes the FPS genre to a new dimension with its portal mechanics, delivering high-flying, multi-dimensional combat. Evoking memories of the most revered shooters of the past two decades, Splitgate embraces the classic and familiar feel of close-quarters combat while adding a unique twist.",
     "imageUrl": "https://thumb.spokesman.com/QrrJXCjkou3PuJzpLJRuY7ohnV0=/2500x1405/smart/media.spokesman.com/photos/2021/09/29/6154bceb0c0e6.hires.jpg"
    },
    {"game": "Star Wars Battlefront",
     "details": "Quick play mode",
     "image": "",
     "text": "Star Wars Battlefront",
     "copies": 0,
     "console": "XBOX",
     "genre": "",
     "mode": "quickplay",
     "Time per match": "",
     "scoring": "",
     "playability":"Owned" ,
     "link": "",
     "description": "",
     "imageUrl": "https://images2.alphacoders.com/481/thumb-1920-481286.jpg"  
    },
    {"game": "The Finals",
     "details": "Quick play mode",
     "image": "",
     "text": "The Finals",
     "copies": 0,
     "console": "XBOX",
     "genre": "",
     "mode": "quickplay",
     "Time per match": "",
     "scoring": "",
     "playability":"Owned" ,
     "link": "",
     "description": "",
     "imageUrl": "https://images6.alphacoders.com/134/1344126.png"   
    },
    {"game": "Titanfall 2",
     "details": "Quick play mode",
     "image": "",
     "text": "Titanfall 2",
     "copies": 0,
     "console": "XBOX",
     "genre": "",
     "mode": "quickplay",
     "Time per match": "",
     "scoring": "",
     "playability":"Owned" ,
     "link": "",
     "description": "",
     "imageUrl": "https://cdn.wccftech.com/wp-content/uploads/2016/08/Titanfall-2-1080P-Wallpaper-1-1400x788.jpg"   
    },
    {"game": "Valorant",
      "details": "Ranked mode",
      "image": "../assets/img/Spin The Wheel Photos/PVP/Valorant.jpg",
      "text": "Valorant",
      "copies": 2,
      "console": "XBOX",
      "genre": "Tactical Shooter",
      "mode": "Ranked",
      "Time per match": "",
      "scoring": "",
      "playability": "Free to Play",
      "link": "",
      "description": "Valorant is a free-to-play tactical first-person shooter developed and published by Riot Games. In this game, players are divided into two teams, Attackers and Defenders, and engage in matches where strategic planning, precise aiming, and coordinated teamwork are essential. Each player selects an 'Agent,' a character with unique abilities that complement their gunplay skills. The game blends elements of classic tactical shooters with hero-based abilities, requiring players to master both gun control and strategic use of their Agent's powers. Ranked mode in Valorant offers a competitive environment where players climb the ranks based on their performance, facing off against opponents of similar skill levels.",
      "imageUrl": "https://www.pixground.com/valorant-agents-4k-wallpaper/?download-img=fhd"
    },
    {"game": "WILDSTYLE Board game",
     "details": "Board game",
     "image": "",
     "text": "WILDSTYLE Board game",
     "copies": 0,
     "console": "Tabletop",
     "genre": "Board Game",
     "mode": "quickplay",
     "Time per match": "40mins",
     "scoring": "The game ends after 3 rounds and you'll score for objectives and for each map hex where you have a tag AND lose points for cop cars and solo tags. The crew with the most points wins!",
     "playability":"Owned" ,
     "link": "https://boardgamegeek.com/boardgame/366782/wildstyle#:~:text=Each%20time%20you%20collect%20a,in%20any%20order%20they%20choose.",
     "description": "Welcome to Wildstyle, where the city is your canvas and the streets belong to the people. Rock to the beat of your favorite pirate radio station while you and your crew tag the city. Make sure your rivals know where their turf ends and where yours begins. Watch out for the man though, because not everyone in the city appreciates your artistic endeavors and they might call the fuzz on you!",
     "imageUrl": "https://images.squarespace-cdn.com/content/v1/5eb1163a9032cf1574e8c6bd/4c98211a-cab8-40e8-a25f-c21d6f99f7ea/Wildstyle-044.jpg"
    }
    ]
