[
    {"TITLE": "Shady Part of Me",
    "STATUS": "",
    "GENRE": "Platform, Puzzle, Role-playing (RPG), Adventure, Indie",
    "CONSOLE": "XBOX",
    "TIME TO BEAT": "5hrs",
    "Playability": "Game Pass",
    "COMPLETED?": "",
    "LINK": "https://www.igdb.com/games/shady-part-of-me",
    "DESCRIPTION": "\"Shady Part of Me,\" released in 2020 and developed by Douze Dixièmes and published by Focus Home Interactive, is a visually striking puzzle-platformer that takes players on an introspective and dreamlike journey. The game centers around a little girl who is afraid of light and her shadow, which represents her more confident side. Voiced by Hannah Murray (known for her roles in \\\"Game of Thrones\\\" and \\\"Skins\\\"), the narrative explores their emotional struggles as they navigate surreal dreamscapes filled with unexpected twists.\n\nThe core gameplay mechanic involves seamlessly switching between the 3D perspective of the little girl and the 2D perspective of her shadow. Players must utilize the unique abilities of both characters – the girl can manipulate objects in the foreground, while the shadow can interact with elements on walls and other 2D surfaces. Cooperation between the two is essential to solve the contemplative puzzles and progress through the poetic narrative. Adding another layer to the gameplay is the ability to rewind time, encouraging experimentation without the fear of failure.\n\nThe game's environments are presented in a distinctive watercolor art style, contributing to the dreamlike atmosphere. While some critics noted the game's shorter length (around 5 hours) and a narrative that could leave some players with unanswered questions, \\\"Shady Part of Me\\\" was generally praised for its beautiful visuals, innovative puzzle design, and the poignant themes of personal growth and overcoming inner turmoil. It was considered a memorable indie title that effectively blends emotional storytelling with engaging gameplay mechanics.",
    "imageUrl": "https://images5.alphacoders.com/111/1119786.jpg"
    },
    {"TITLE": "Harold Halibut",
    "STATUS": "",
    "GENRE": "Simulator, Adventure, Indie",
    "CONSOLE": "XBOX",
    "TIME TO BEAT": "11hrs",
    "Playability": "Game Pass",
    "COMPLETED?": "",
    "LINK": "https://www.igdb.com/games/harold-halibut",
    "DESCRIPTION": "\"Harold Halibut,\" released on April 16, 2024, is a unique narrative-driven adventure game developed and published by the German independent studio Slow Bros. This visually stunning game distinguishes itself with its entirely handmade aesthetic; the characters and environments were meticulously sculpted from clay and other materials, then digitally scanned and brought to life with a stop-motion feel. Set on the FEDORA, a city-sized spaceship that fled a Cold War-era Earth and subsequently crashed into an alien ocean, the game takes place 250 years after this exodus.\n\nYou step into the role of Harold Halibut, a young and amiable lab assistant working for the ship's lead scientist, Jeanne Mareaux, who tirelessly seeks a way for the community to escape their submerged home. Harold's daily life involves running errands and assisting the diverse and quirky inhabitants of the FEDORA. However, his routine is disrupted by an unexpected encounter with an alien being, which propels him into an extraordinary quest that might hold the key to the scientist's re-launch plans.\n\nThe gameplay primarily revolves around exploration and conversations with the memorable cast of characters. While there are some simple interactions and mini-games, the focus is heavily on the narrative and the relationships Harold develops. The game has been praised for its breathtaking, handcrafted world, the charming and believable characters brought to life by excellent voice acting, and a heartwarming story that explores themes of friendship and finding one's place. Although some critics noted the game's slow pace and lack of significant gameplay challenges, \\\"Harold Halibut\\\" has been celebrated for its artistic achievement and its touching, often humorous, portrayal of life in an unusual and captivating setting. The game garnered nominations and wins at various award ceremonies, including the BAFTA and the German Developer Awards, for its artistic and narrative qualities.",
    "imageUrl": "https://wallpapercave.com/wp/wp13853224.jpg"
    },
    {"TITLE": "The Last Case of Benedict Fox",
    "STATUS": "",
    "GENRE": "",
    "CONSOLE": "XBOX",
    "TIME TO BEAT": "12hrs",
    "Playability": "Game Pass",
    "COMPLETED?": "",
    "LINK": "https://www.igdb.com/games/the-last-case-of-benedict-fox",
    "DESCRIPTION": "\"The Last Case of Benedict Fox,\" released in 2023 and developed by Plot Twist, is a Metroidvania-style action-adventure game with a dark, intriguing narrative steeped in Lovecraftian and gothic horror elements. Players step into the shoes of Benedict Fox, a self-proclaimed detective bound to his deceased companion – a demon – whose consciousness resides within his soul. This unusual partnership grants Benedict unique powers and allows him to delve into the memories of the recently deceased.\n\nThe game begins as Benedict investigates the mysterious death of his wife and the disappearance of their child in a decaying mansion. To unravel the truth, he must explore the real world and venture into the surreal and nightmarish realms of Limbo, the final memories of the departed. Utilizing his detective skills, combat prowess enhanced by his demonic link, and the ability to navigate through memories, Benedict pieces together the unsettling events that transpired.\n\n\\\"The Last Case of Benedict Fox\\\" is characterized by its distinctive art style, blending a painterly aesthetic with eerie and unsettling creature designs. The gameplay involves intricate exploration of interconnected environments, challenging platforming sections, and visceral combat encounters. While the game received mixed reviews upon release, it was often praised for its atmospheric presentation, the intriguing premise of its narrative, and the unique dynamic between Benedict and his demonic companion. Some criticism was directed towards aspects of its combat and pacing, but the game's commitment to its dark and mysterious tone, coupled with its Metroidvania structure, offered a compelling experience for fans of atmospheric and story-driven adventures.",
    "imageUrl": "https://images3.alphacoders.com/124/thumb-1920-1247182.jpg"
    },
    {"TITLE": "Marlow Briggs and the Mask of Death (2013)",
    "STATUS": "",
    "GENRE": " Puzzle, Hack and slash/Beat 'em up, Adventure",
    "CONSOLE": "360",
    "TIME TO BEAT": "10hrs",
    "Playability": "owned",
    "COMPLETED?": "",
    "LINK": "https://www.igdb.com/games/marlow-briggs-and-the-mask-of-death",
    "DESCRIPTION": "\"Marlow Briggs and the Mask of Death,\" released in 2013, is a high-octane action-adventure hack-and-slash game developed by ZootFly and published by 505 Games. Paying homage to classic action heroes and over-the-top scenarios, the game puts players in the role of the titular Marlow Briggs, a Native American logger whose peaceful life is violently interrupted. When his girlfriend is kidnapped and he is left for dead, Marlow is bonded to an ancient Mayan death mask, granting him incredible power and a thirst for vengeance.\n\nThe gameplay is characterized by its fast-paced combat, reminiscent of character action games. Marlow wields a magical spear that can transform into various weapons, allowing for fluid combos and devastating attacks against hordes of enemies. Players navigate lush jungle environments, ancient ruins, and industrial complexes, engaging in acrobatic platforming and facing off against monstrous creatures and human adversaries. The narrative is intentionally campy and filled with humorous dialogue, embracing its B-movie inspirations.\n\nWhile \\\"Marlow Briggs and the Mask of Death\\\" didn't achieve widespread critical acclaim, it was noted for its relentless action and over-the-top presentation. Some reviewers found the gameplay repetitive and the story simplistic, but others appreciated its straightforward, action-packed approach and its willingness to embrace its pulpy source material. The game's focus on constant combat and exaggerated scenarios offered a distinct experience for players seeking a less serious and more immediately gratifying action title. The character of Marlow Briggs, with his stoic demeanor contrasting with the absurd situations, contributed to the game's unique, if divisive, charm.",
    "imageUrl": "https://i.gadgets360cdn.com/products/large/marlowbriggs-1647614928471-1000x1000-1659522729.jpg"
    },
    {"TITLE": "1979 Revolution: Black Friday (2016)",
    "STATUS": "",
    "GENRE": "Adventure, Indie, Historical",
    "CONSOLE": "XBOX",
    "TIME TO BEAT": "6hrs",
    "Playability": "owned",
    "COMPLETED?": "",
    "LINK": "https://www.igdb.com/games/1979-revolution-black-friday",
    "DESCRIPTION": "\"1979 Revolution: Black Friday,\" released in 2016 and developed by iNK Stories, is a powerful and immersive interactive drama that plunges players into the heart of the Iranian Revolution. Based on true stories and historical events, the game casts you as Reza Shirazi, a young photojournalist who returns to his homeland of Tehran in 1978, just as the country is on the cusp of immense upheaval and protests against the ruling Shah. Armed with your camera, you become entangled in the dangerous world of revolution, civil unrest, and the complex moral choices that come with it.\n\nThe gameplay emphasizes narrative and player choice, reminiscent of interactive films. You navigate the tense atmosphere of a city under martial law, participating in protests, exploring covert headquarters, and interacting with a diverse cast of characters, from passionate revolutionaries to conflicted government supporters and worried family members. A key mechanic involves photography; as a photojournalist, you capture pivotal moments, and the game often presents these in-game photos alongside actual archival images from the time, adding a layer of historical authenticity and impact.\n\nDeveloped with meticulous research, including interviews with eyewitnesses and historical scholars, \\\"1979 Revolution: Black Friday\\\" aims to provide a nuanced perspective on a significant and often misunderstood period in history. It delves into the various ideologies and factions within the revolutionary movement, avoiding simplistic portrayals. While the core story of Reza is fictional, his experiences are woven from the fabric of real events and testimonies. The game garnered critical acclaim for its bold approach to a sensitive historical subject, its compelling narrative, and its efforts to educate players about the complexities of the Iranian Revolution from an Iranian perspective. It received nominations and awards for its impactful storytelling and unique approach to blending gaming with historical education.",
    "imageUrl": "https://static1.dualshockersimages.com/wordpress/wp-content/uploads/2018/07/dims.jpg"
    },
    {"TITLE": "Alan Wake",
      "STATUS": "🟢",
      "GENRE": "Action Adventure",
      "CONSOLE": "Game Pass",
      "TIME TO BEAT": "14hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/alan-wake",
      "DESCRIPTION": "\"Alan Wake,\" originally released in 2010 and developed by the Finnish studio Remedy Entertainment, is a critically acclaimed action-adventure game with a strong emphasis on psychological thriller elements and a unique narrative structure inspired by television series. Players step into the role of Alan Wake, a bestselling crime fiction author suffering from writer's block, who retreats with his wife Alice to the seemingly idyllic small town of Bright Falls in Washington state. However, their peaceful getaway takes a dark turn when Alice mysteriously disappears, and Alan finds himself plagued by nightmares that bleed into reality through the pages of a thriller novel he doesn't remember writing.\n\nThe gameplay revolves around exploring the atmospheric environments of Bright Falls and engaging in intense combat with shadowy figures known as the Taken. A core mechanic involves the strategic use of light to weaken these enemies before they can be harmed by conventional weapons. Alan wields a flashlight, flares, and other light sources as crucial tools for survival. The story unfolds episodically, complete with cliffhangers and recaps, mirroring the structure of a suspenseful TV show. Throughout his desperate search for Alice, Alan encounters a cast of memorable and often eccentric characters, unraveling the town's dark secrets and confronting a malevolent supernatural presence known as the Dark Presence.\n\n\\\"Alan Wake\\\" was praised for its compelling narrative, its cinematic presentation, and its innovative gameplay mechanics that blend psychological horror with action elements. The game's eerie atmosphere, inspired by the works of Stephen King and \\\"The Twilight Zone,\\\" captivated players and critics alike. While initially an Xbox 360 exclusive, it later saw a release on PC. In 2021, a remastered version, \\\"Alan Wake Remastered,\\\" brought the game to a new generation of consoles and PC with enhanced visuals. The game's unique blend of storytelling and gameplay solidified its status as a cult classic and paved the way for a long-awaited sequel, \\\"Alan Wake 2,\\\" released in 2023, further expanding the intriguing lore and the mysteries surrounding the troubled writer and the dark forces of Cauldron Lake.",
      "imageUrl": "https://images.alphacoders.com/117/1179971.jpg"
    },
    {"TITLE": "Avowed",
      "STATUS": "🟣",
      "GENRE": "RPG",
      "CONSOLE": "",
      "TIME TO BEAT": "",
      "Playability": "SEASON 3",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/avowed",
      "DESCRIPTION": "\"Avowed,\" released on February 18, 2025, is a first-person fantasy role-playing game developed by Obsidian Entertainment, the acclaimed studio behind titles like \\\"Pillars of Eternity\\\" and \\\"The Outer Worlds.\\\" Set in the Living Lands, a mysterious and untamed island in the world of Eora (familiar to fans of \\\"Pillars of Eternity\\\"), the game casts you as an envoy from the Aedyr Empire tasked with investigating a spreading supernatural plague known as the Dreamscourge. However, your mission soon becomes deeply personal as you discover a connection to this land and are drawn into its ancient secrets and conflicts.\n\nThe gameplay blends visceral first-person combat with deep role-playing elements. Players can wield a variety of weapons, including swords, guns, and magical spells, and seamlessly switch between different loadouts to suit their playstyle. The combat emphasizes combining physical attacks with magical abilities, such as freezing or ensnaring enemies. While not a fully open-world experience, \\\"Avowed\\\" features large, explorable zones filled with diverse environments, from lush forests to arid deserts and ancient ruins. As you explore, you'll encounter a cast of memorable companions with their own unique abilities and backstories, whose relationships with you will be shaped by your choices.\n\nObsidian, known for its intricate narratives and player agency, emphasizes choices and consequences in \\\"Avowed.\\\" Dialogue options allow you to shape your character's personality and influence your relationships with companions and the various factions within the Living Lands, such as the Aedyr Empire loyalists, the rebellious factions of the Living Lands, and the enigmatic Steel Garotte. While romance options are not included, the bonds you forge with your companions are a central part of the experience. The game's development saw some shifts, initially envisioned with multiplayer elements, it later refocused on a single-player, narrative-driven experience under the direction of Carrie Patel. \\\"Avowed\\\" received generally favorable reviews, with praise for its engaging combat and the weight of player choices, though some critics noted issues with the main narrative and technical bugs at launch. It was also available day one on Xbox Game Pass.",
      "imageUrl": "https://images.alphacoders.com/134/1348504.jpeg"
    },
    {"TITLE": "Broken Age",
      "STATUS": "",
      "GENRE": "Puzzle",
      "CONSOLE": "",
      "TIME TO BEAT": "13:00",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/broken-age",
      "DESCRIPTION": "\"Broken Age,\" a charming point-and-click adventure game developed by Double Fine Productions, was released in two acts, with Act 1 in 2014 and Act 2 in 2015. This beautifully hand-painted game tells the parallel stories of two seemingly unrelated teenagers leading vastly different lives. Vella Tartine is a young woman from a peaceful village chosen to be a sacrifice to a monstrous creature, but she bravely decides to defy her fate. Shay Volta is a boy living in isolation aboard a seemingly benevolent spaceship, his days filled with repetitive, artificial adventures orchestrated by the ship's computer.\n\nPlayers can freely switch between Vella and Shay's narratives, solving puzzles in their respective worlds that sometimes subtly hint at a larger connection. Vella's story involves traditional point-and-click exploration and interaction with quirky characters as she seeks a way to defeat the monster. Shay's journey involves navigating the peculiar logic of his spaceship and questioning the nature of his sheltered existence. The game features the voice talents of Elijah Wood as Shay and Masasa Moyo as Vella, alongside a host of other notable actors.\n\n\\\"Broken Age\\\" holds a significant place in video game history as one of the first major crowdfunded games through Kickstarter. Its success helped pave the way for other independent game development projects. The game was praised for its stunning art style, its witty writing, and the engaging storylines of its two protagonists. While some critics felt the pacing of the second act was uneven, the overall experience was lauded for its heart, humor, and the satisfying convergence of Vella and Shay's narratives. It stands as a testament to Double Fine's storytelling prowess and the power of community-backed game development.",
      "imageUrl": "https://artfiles.alphacoders.com/904/thumb-1920-90435.jpg"
    },
    {"TITLE": "Creatures of Ava",
      "STATUS": "",
      "GENRE": "Action Adventure",
      "CONSOLE": "",
      "TIME TO BEAT": "20hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/creatures-of-ava",
      "DESCRIPTION": "\"Creatures of Ava,\" released in 2024 and developed by Inverge Studios and published by 11 bit studios, is an enchanting action-adventure game set on the vibrant and diverse alien planet of Ava. Players step into the role of Vic, a young explorer who finds herself on this breathtaking world teeming with unique and often misunderstood creatures. However, Ava is facing a growing threat: a mysterious infection known as the Rot is corrupting the land and turning its peaceful inhabitants aggressive.\n\nThe core gameplay revolves around the innovative mechanic of 'Melody Taming.' Instead of combat, Vic learns to play various melodic songs using her flute to communicate with and soothe the infected creatures, curing them of the Rot and forming deep bonds. Each creature responds to different melodies, encouraging experimentation and discovery. As Vic explores Ava's varied biomes – from lush jungles to glowing caves and windswept highlands – she uncovers the secrets of the Rot and the ancient civilization that once thrived on the planet.\n\n\\\"Creatures of Ava\\\" emphasizes exploration, puzzle-solving, and building relationships with the alien fauna. Players learn about the unique behaviors and needs of each creature, working to understand their place in Ava's delicate ecosystem. The game features a distinct visual style, blending colorful environments with imaginative creature designs. While combat is absent, the challenges lie in deciphering the creatures' musical language and navigating the environmental puzzles. \\\"Creatures of Ava\\\" was praised for its unique approach to creature interaction, its beautiful world-building, and its themes of empathy and ecological harmony, offering a refreshing and heartwarming adventure in a genre often focused on conflict."
,
      "imageUrl": "https://images2.alphacoders.com/137/thumb-1920-1371578.jpeg"
    },
    {"TITLE": "Cyberpunk 2077",
      "STATUS": "",
      "GENRE": "Shooter, Role-playing (RPG), Adventure",
      "CONSOLE": "XBOX",
      "TIME TO BEAT": "57hrs",
      "Playability": "owned",
      "COMPLETED?": "🏆",
      "LINK": "https://www.igdb.com/games/cyberpunk-2077-ultimate-edition",
      "DESCRIPTION": "\"Cyberpunk 2077,\" released in 2020 by CD Projekt Red, is an open-world action role-playing game set in Night City, a sprawling and dangerous megacity obsessed with power, glamour, and body modification in a dystopian future. Players step into the shoes of V, a customizable mercenary on a quest for immortality through a unique cybernetic implant. The narrative is heavily driven by player choice, impacting the story, character relationships, and the world around V.\n\nThe gameplay blends first-person exploration, intense combat (both ranged and melee), hacking abilities, and intricate character customization. Players can augment V with a vast array of cyberware, enhancing their abilities and tailoring their playstyle. Night City is a massive and detailed environment to explore, offering a main storyline filled with compelling characters and branching paths, as well as numerous side quests and activities. The game features a star-studded cast, including Keanu Reeves as Johnny Silverhand, a digital ghost inhabiting V's mind.\n\nUpon its initial release, \\\"Cyberpunk 2077\\\" was highly anticipated due to the pedigree of CD Projekt Red (known for \\\"The Witcher 3: Wild Hunt\\\"). However, it faced significant criticism for its numerous technical issues and bugs, particularly on older consoles. Despite these initial problems, the game was praised for its immersive world-building, compelling narrative, and the depth of its character development. Over subsequent years, CD Projekt Red has released numerous patches and updates to address the technical issues and enhance the gameplay experience. An expansion, \\\"Phantom Liberty,\\\" further enriched the story and introduced new characters and areas. \\\"Cyberpunk 2077\\\" has become a notable example of a game with a rocky launch that has seen significant improvements post-release, fostering a dedicated player base drawn to its rich lore and engaging cyberpunk setting.",
      "imageUrl": "https://www.hdwallpapers.in/download/cyborg_futuristic_johnny_silverhand_4k_hd_cyberpunk_2077-HD.jpg"
    },
    {"TITLE": "Disco Elysium",
      "STATUS": "🟣",
      "GENRE": "RPG",
      "CONSOLE": "",
      "TIME TO BEAT": "60hrs",
      "Playability": "SEASON 2",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/disco-elysium",
      "DESCRIPTION": "\"Disco Elysium,\" released in 2019 by Estonian independent studio ZA/UM, is a groundbreaking role-playing game that throws players into the worn shoes of Harry Du Bois, a detective with a severe case of amnesia and a penchant for self-destruction. Set in the gritty and politically charged district of Martinaise in the fictional city of Revachol, the game focuses heavily on narrative, dialogue, and skill checks rather than traditional combat. As Harry investigates a bizarre murder, he must piece together not only the crime but also his own shattered identity.\n\nThe gameplay is unique, eschewing traditional RPG combat for intricate conversations and internal monologues. Harry's skills represent different facets of his personality and psyche, from logic and rhetoric to empathy and physical endurance. These skills frequently interject during dialogues and environmental interactions, offering conflicting opinions, revealing hidden information, and influencing the success or failure of actions through dice roll-based checks. The game features an extensive amount of text and branching dialogue trees, allowing for a high degree of player agency in shaping Harry's personality and the course of the investigation.\n\n\\\"Disco Elysium\\\" garnered widespread critical acclaim for its innovative gameplay, its richly detailed world, its darkly humorous and philosophical writing, and its memorable cast of characters. It won numerous awards, including several Game of the Year accolades, for its fresh approach to the RPG genre and its profound narrative depth. The game tackles mature themes of politics, societal decay, mental health, and the search for meaning with intelligence and wit. In 2021, an expanded version titled \\\"Disco Elysium - The Final Cut\\\" was released, featuring full voice acting for all characters and new content, further enhancing the immersive and unforgettable experience of inhabiting the fractured mind of Detective Harry Du Bois in the fascinatingly bleak world of Revachol.",
      "imageUrl": "https://images8.alphacoders.com/119/1193016.jpg"
    },
    {"TITLE": "Firewatch",
      "STATUS": "",
      "GENRE": "Walking Simulator",
      "CONSOLE": "",
      "TIME TO BEAT": "5hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/firewatch",
      "DESCRIPTION": "\"Firewatch,\" released in February 2016, is a single-player first-person mystery adventure set in the breathtaking Wyoming wilderness of 1989. Developed by Campo Santo and published in partnership with Panic, this narrative-driven game puts you in the shoes of Henry, a man seeking solace from his complicated life by taking a job as a fire lookout in Shoshone National Forest.\n\nPerched high in your watchtower, your primary connection to the outside world is through a handheld radio, linking you with your supervisor, Delilah. Voiced by Cissy Jones (known for \"The Walking Dead: Season 1\"), Delilah becomes your sole emotional lifeline as you navigate the isolation and your responsibilities of spotting smoke and ensuring the forest's safety. Rich Sommer (\"Mad Men\") lends his voice to Henry, creating a compelling dynamic between the two characters.\n\nAs an unusually hot and dry summer heightens tensions, strange occurrences begin to unfold, drawing Henry out of his tower and into the vast, unknown wilderness. You'll explore a stunningly beautiful environment, shaped by the artistic vision of Olly Moss and Jane Ng (\"The Cave,\" \"Brutal Legend\"), as you unravel a mystery that will test the burgeoning relationship between Henry and Delilah. The gripping story and script were crafted by Sean Vanaman and Jake Rodkin (both from \"The Walking Dead: Season 1,\" \"Poker Night at the Inventory\"), with fluid first-person animation by James Benson (\"Ori & The Blind Forest\") and a stirring original soundtrack by Chris Remo (\"Gone Home\").\n\n\"Firewatch\" garnered significant praise for its compelling narrative, the exceptional voice acting of Jones and Sommer, and its unique art style that beautifully captures the atmosphere of the Wyoming wilderness. The game received numerous accolades, including a BAFTA Games Award for Debut Game for Campo Santo in 2017. While some critics noted its slower pace and focus on dialogue and exploration over traditional gameplay mechanics, many lauded it as a powerful and memorable experience that redefined narrative possibilities in gaming. It's a game about adults having adult conversations about adult things, exploring themes of isolation, connection, and confronting one's past against the backdrop of a captivating natural landscape.",
      "imageUrl": "https://images3.alphacoders.com/129/1292799.jpg"
    },
    {"TITLE": "Flintlock: Siege of the Dawn",
      "STATUS": "🟣",
      "GENRE": "Action Adventure, RPG",
      "CONSOLE": "XBOX",
      "TIME TO BEAT": "20hrs",
      "Playability": "Game Pass",
      "COMPLETED?": "🏆",
      "LINK": "https://www.igdb.com/games/flintlock-the-siege-of-dawn",
      "DESCRIPTION": "\"Flintlock: Siege of the Dawn,\" released on July 18, 2024, is an action role-playing game developed by A44 Games, the studio behind \"Ashen,\" and published by Kepler Interactive. Set in a unique fantasy world where magic and gunpowder collide, the game throws you into a desperate battle for humanity's survival. The gates to the afterlife have been opened, unleashing vengeful gods and their undead armies upon the land of Kian, pushing the living to the brink of extinction. The once-proud city of Dawn now faces imminent destruction, and it's time for the Coalition army to fight back.\n\nYou step into the boots of Nor Vanek, an elite soldier in the Coalition army, driven by vengeance against the gods. Joining her on this perilous journey is Enki, a mysterious, fox-like companion imbued with magical powers. This unlikely duo must work together, blending Nor's combat prowess with Enki's arcane abilities, to traverse the ravaged landscapes of Kian and confront the god's formidable legions. Enki's magic not only enhances Nor's combat skills but also provides unique traversal options, allowing them to utilize rifts to soar through the skies and navigate the world.\n\n\"Flintlock\" blends elements of the Soulslike genre with a focus on rapid mobility and explosive combat. Players will engage in dynamic battles, seamlessly weaving together melee attacks, gunpowder weaponry, and magic. Utilizing Nor's gunpowder abilities allows for strategic use of verticality, delivering devastating attacks from above or making swift escapes from danger. As you explore the world, you'll discover new equipment, strengthen your arsenal, and upgrade your gear in preparation for the ultimate showdown against the gods. While the game retains a challenging edge, it offers adjustable difficulty levels, making it potentially more accessible to newcomers of the Soulslike genre. Reception for \"Flintlock: Siege of the Dawn\" upon its release was mixed, with praise for its combat and unique setting, but some criticism regarding its narrative and character polish.",
      "imageUrl": "https://images8.alphacoders.com/136/1369674.png"
    },
    {"TITLE": "Hauntii",
      "STATUS": "",
      "GENRE": "Action Adventure, Indie",
      "CONSOLE": "PC, PlayStation 5, Xbox Series S/X, Nintendo Switch",
      "TIME TO BEAT": "14:00",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/hauntii",
      "DESCRIPTION": "\"Hauntii\" is a visually striking action-adventure game that immerses players in a beautifully hand-drawn haunted world. Taking on the role of a ghost, you'll navigate ethereal landscapes, unraveling the mysteries of this spectral realm through clever puzzle-solving and a unique possession mechanic. As a ghost, you have the ability to interact with the environment and its inhabitants in unconventional ways, including possessing living characters to manipulate the world and overcome obstacles.\n\nThe game's distinctive art style creates a captivating and atmospheric experience, drawing players into a world filled with secrets and intriguing characters. As you explore the haunted locations, you'll piece together the narrative, uncover the lore of this ghostly plane, and utilize your spectral abilities to progress. 'Hauntii' promises a blend of engaging puzzles, fluid movement, and a compelling story set in a visually stunning and mysterious world, available on PC, PlayStation 5, Xbox Series S/X, and Nintendo Switch. Prepare to embrace your spectral form and discover the secrets that lie within the haunted realm.\"",
      "imageUrl": "https://images7.alphacoders.com/136/thumb-1920-1363212.jpeg"
    },
    {"TITLE": "Kunitsu-Gami: Path of the Goddess",
      "STATUS": "🟢",
      "GENRE": "Action Adventure, Strategy",
      "CONSOLE": "XBOX, PC, PlayStation 5",
      "TIME TO BEAT": "34:00",
      "Playability": "Game Pass",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/kunitsu-gami-path-of-the-goddess",
      "DESCRIPTION": "\"Kunitsu-Gami: Path of the Goddess\" is an upcoming action-adventure title that seamlessly blends dynamic combat with strategic elements, all set within a visually striking world inspired by traditional Japanese art. As a player, your central role is to safeguard the goddess and cleanse the land from a spreading defilement. The game promises a unique experience where you'll engage in intense action sequences while also employing tactical thinking to overcome the challenges that lie ahead. With its distinct artistic style and the fusion of action and strategy gameplay, 'Kunitsu-Gami: Path of the Goddess' offers a captivating journey to protect the divine and restore purity to a beautifully realized world, coming to XBOX, PC, and PlayStation 5, and available on Game Pass for Xbox players.\"",
      "imageUrl": "https://cdn.wccftech.com/wp-content/uploads/2024/07/Kunitsu-Gami-Path-of-the-Goddess-1920x1080.jpg"
    },
    {"TITLE": "South Of Midnight",
      "STATUS": "🟣",
      "GENRE": "Action Adventure, Mythology",
      "CONSOLE": "XBOX, PC",
      "TIME TO BEAT": "",
      "Playability": "SEASON 4",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/south-of-midnight",
      "DESCRIPTION": "\"South of Midnight\" is an eagerly anticipated action-adventure game that captivates with its distinctive stop-motion-inspired visual style, setting it apart in the gaming landscape. Set in the mystical American South, the game promises a journey through a world deeply intertwined with folklore and brimming with mythical creatures drawn from regional legends. Players will step into a coming-of-age narrative, exploring rich environments and confronting fantastical beings as they navigate a compelling storyline. Developed by Compulsion Games, known for their narrative-driven titles, 'South of Midnight' is poised to offer a unique blend of action, exploration, and storytelling, inviting players to immerse themselves in a world where Southern charm meets mythical wonder, coming to XBOX and PC.\"",
      "imageUrl": "https://images5.alphacoders.com/138/1386032.jpg"
     },
     {"TITLE": "The inner world",
      "STATUS": "",
      "GENRE": "Action Adventure, Point-and-Click, Indie",
      "CONSOLE": "XBOX, PC, PlayStation 4, Nintendo Switch, iOS, Android",
      "TIME TO BEAT": "08:00",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/the-inner-world",
      "DESCRIPTION": "\"The Inner World\" is a charming point-and-click adventure game that stands out with its beautifully hand-drawn, cartoonish art style and quirky sense of humor. Players follow the whimsical adventures of Robert, a lovable novice from the last wind monastery, as he embarks on a quest to unravel the secrets of Asposia, a peculiar world located inside-out. The gameplay centers around solving a variety of creative and often humorous puzzles by interacting with the environment and its bizarre inhabitants. Developed by Studio Fizbin, 'The Inner World' has been praised for its engaging storyline, memorable characters, and its unique visual presentation, offering a delightful and lighthearted adventure for players on XBOX, PC, PlayStation 4, Nintendo Switch, and mobile platforms.\"",
      "imageUrl": "https://www.newgamenetwork.com/images/uploads/gallery/TheInnerWorld/innerworld_04.jpg"
     },
     {"TITLE": "The Rewinder",
      "STATUS": "🟢",
      "GENRE": "Adventure, Puzzle, Indie",
      "CONSOLE": "XBOX, PC, Nintendo Switch, PlayStation 4, PlayStation 5",
      "TIME TO BEAT": "05:00",
      "Playability": "Game Pass",
      "COMPLETED?": "Jayber, Flight",
      "LINK": "https://www.igdb.com/games/the-rewinder",
      "DESCRIPTION": "\"The Rewinder\" is a captivating pixel-art adventure game deeply inspired by the rich tapestry of Chinese folklore. Players step into the role of a 'Rewinder,' an individual with the extraordinary ability to delve into the memories of others. By entering these recollections, you can manipulate past events and observe how these alterations ripple through time, influencing the present and ultimately shaping destinies. The gameplay revolves around solving intricate mysteries and uncovering hidden truths by strategically changing the past. Developed by Misty Mountain Studio, 'The Rewinder' offers a unique narrative experience with its distinctive visual style and its intriguing time-manipulation mechanics, available on XBOX, PC, Nintendo Switch, and PlayStation platforms, and also accessible via Game Pass.\"",
      "imageUrl": "https://cdn.mobygames.com/cff4f910-c270-11ed-ab6b-02420a000194.webp"
     },
     {"TITLE": "TUNIC",
      "STATUS": "",
      "GENRE": "Action Adventure, Indie, Isometric",
      "CONSOLE": "PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series S/X, Nintendo Switch, Mac",
      "TIME TO BEAT": "20:00",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/tunic",
      "DESCRIPTION": "\"TUNIC\" is a charming and critically acclaimed action-adventure game presented from an engaging isometric perspective, reminiscent of classic titles while offering a fresh and modern experience. Players embark on an enigmatic journey as a small, fox-like protagonist exploring a mysterious and interconnected island filled with ancient ruins, hidden pathways, and challenging enemies. The game encourages exploration and discovery, with a unique in-game manual that players piece together page by page, offering cryptic clues and insights into the world's secrets and mechanics. Developed by Andrew Shouldice and published by Finji, 'TUNIC' has been praised for its beautiful art style, its rewarding sense of discovery, and its surprisingly deep and challenging combat, available on PC, PlayStation, Xbox, Nintendo Switch, and Mac.\"",
      "imageUrl": "https://gameranx.com/wp-content/uploads/2019/09/Tunic-1.jpg"
     },
     {"TITLE": "Hellblade: Senua's Sacrifice",
      "STATUS": "Completed",
      "GENRE": "Action Adventure, Psychological Horror",
      "CONSOLE": "PC, PlayStation 4, Xbox One, Nintendo Switch",
      "TIME TO BEAT": "09:00",
      "Playability": "Game Pass",
      "COMPLETED?": "🏆",
      "LINK": "https://www.igdb.com/games/hellblade-senuas-sacrifice",
      "DESCRIPTION": "\"Hellblade: Senua's Sacrifice,\" released in 2017 by Ninja Theory, is a dark and intensely atmospheric action-adventure game that offers a profound and unflinching exploration of psychosis through the eyes of Senua, a traumatized Celtic warrior haunted by the voices in her head. Set in a visually stunning and often nightmarish world inspired by Norse mythology and Celtic culture, the game seamlessly blends visceral combat with psychological horror elements. Senua's internal struggles are intricately woven into the gameplay and narrative, creating a deeply immersive and often unsettling experience. Praised for its innovative portrayal of mental health and its breathtaking visuals, 'Hellblade: Senua's Sacrifice' delivers a powerful and unforgettable journey, available on PC, PlayStation 4, Xbox One, and Nintendo Switch, and also accessible through Game Pass.\"",
      "imageUrl": "https://images7.alphacoders.com/709/709447.jpg"
     },
    {"TITLE": "ReCore: Definitive Edition",
      "STATUS": "Completed",
      "GENRE": "Action Adventure",
      "CONSOLE": "",
      "TIME TO BEAT": "",
      "Playability": "Game Pass",
      "COMPLETED?": "🏆",
      "LINK": "https://www.igdb.com/games/recore-definitive-edition",
      "DESCRIPTION": "ReCore: Definitive Edition is an action-adventure game with a vibrant, post-apocalyptic setting. As Joule Adams, explore a world with robotic companions, solve puzzles, and engage in fast-paced combat.",
      "imageUrl": "https://www.shanethegamer.com/wp-content/uploads/2016/09/recore.jpg"
    },
    {"TITLE": "Senua's Saga Hellblade 2",
      "STATUS": "Completed",
      "GENRE": "Action Adventure",
      "CONSOLE": "XBOX",
      "TIME TO BEAT": "9hrs",
      "Playability": "Game Pass",
      "COMPLETED?": "🏆",
      "LINK": "https://www.igdb.com/games/senuas-saga-hellblade-ii",
      "DESCRIPTION": "Senua's Saga: Hellblade II is an action-adventure game with breathtaking visuals and a focus on psychological horror. Continue Senua's journey through the Viking age, battling inner demons and external threats with visceral combat.",
      "imageUrl": "https://www.siliconera.com/wp-content/uploads/2024/05/senuas-saga-hellblade-2-review-cinematic-masterpiece.jpg?fit=1200%2C675"
    },
    {
      "TITLE": "Starfield",
      "STATUS": "Completed",
      "GENRE": "RPG",
      "CONSOLE": "",
      "TIME TO BEAT": "100hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/starfield",
      "DESCRIPTION": "Starfield is an action RPG set in the vast expanse of space, developed by Bethesda Game Studios. Explore countless planets, customize your character, and embark on an epic journey through the stars with stunning graphics.",
      "imageUrl": "https://cdn.wccftech.com/wp-content/uploads/2022/02/Starfield-game-HD-scaled.jpg"
    },
    {
      "TITLE": "Fe",
      "STATUS": "",
      "GENRE": "Adventure",
      "CONSOLE": "",
      "TIME TO BEAT": "15hrs",
      "Playability": "Game Pass",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/fe",
      "DESCRIPTION": "Fe is an action-adventure game with a unique, wordless storytelling approach and a beautiful, stylized art style. Explore a Nordic forest as a small creature, interacting with the environment and other animals through sound and movement.",
      "imageUrl": "https://assets1.ignimgs.com/thumbs/userUploaded/2018/2/15/fereview36190303feblogrollpreview-1518735046810.jpeg"
    },
    {
      "TITLE": "Gris",
      "STATUS": "",
      "GENRE": "Platformer",
      "CONSOLE": "",
      "TIME TO BEAT": "6hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/gris",
      "DESCRIPTION": "Gris is a platform-adventure game with a breathtaking watercolor art style, telling a poignant story of a young girl's journey through sorrow. Solve environmental puzzles and navigate surreal landscapes in this visually stunning experience.",
      "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRwAhfv-2l_VFbLVICbT_U2NQaq05Rc5I5nLA&s"
    },
    {
      "TITLE": "Jusant",
      "STATUS": "Completed",
      "GENRE": "Puzzle",
      "CONSOLE": "",
      "TIME TO BEAT": "5hrs",
      "Playability": "",
      "COMPLETED?": "🏆",
      "LINK": "https://www.igdb.com/games/jusant",
      "DESCRIPTION": "Jusant is a puzzle game with a serene and minimalist art style, where players climb a towering, desolate tower. Solve environmental puzzles and uncover the history of a fallen civilization in this atmospheric climbing adventure.",
      "imageUrl": "https://cdna.artstation.com/p/assets/images/images/069/824/956/4k/nicolas-vidal-chap3-17.jpg?1701106734"
    },
    {
      "TITLE": "Planet of Lana",
      "STATUS": "",
      "GENRE": "Adventure",
      "CONSOLE": "",
      "TIME TO BEAT": "6hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/planet-of-lana",
      "DESCRIPTION": "Planet of Lana is an adventure game with a hand-painted art style, set on a beautiful and mysterious alien world. Guide Lana and her animal companion through dangerous landscapes, solving puzzles and evading robotic enemies.",
      "imageUrl": "https://images2.alphacoders.com/137/thumb-1920-1377612.jpg"
    },
    {
      "TITLE": "Spirit of the North: Enhanced Edition",
      "STATUS": "",
      "GENRE": "Adventure",
      "CONSOLE": "",
      "TIME TO BEAT": "8hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/spirit-of-the-north-enhanced-edition",
      "DESCRIPTION": "Spirit of the North: Enhanced Edition is a single-player adventure game inspired by the landscapes of Iceland, featuring a wordless narrative and a focus on atmosphere and exploration as a regular fox intertwined with a magical spirit.",
      "imageUrl": "https://www.heypoorplayer.com/wp-content/uploads/2020/11/Spirit-of-the-North-EE-Magic-scaled.jpg"
    },
    {
      "TITLE": "Dragon Age: The Veilguard",
      "STATUS": "",
      "GENRE": "RPG",
      "CONSOLE": "",
      "TIME TO BEAT": "100hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/dragon-age-the-veilguard",
      "DESCRIPTION": "Dragon Age: The Veilguard is an upcoming RPG set in the Dragon Age universe, promising a character-driven narrative with a diverse cast of companions. Expect tactical combat, deep lore, and impactful choices in a high-fantasy setting.",
      "imageUrl": "https://4kwallpapers.com/images/wallpapers/dragon-age-the-3840x1080-18399.jpg"
    },
    {
      "TITLE": "Dragon Age: Inquisition",
      "STATUS": "",
      "GENRE": "RPG",
      "CONSOLE": "",
      "TIME TO BEAT": "88hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/dragon-age-inquisition",
      "DESCRIPTION": "Dragon Age: Inquisition is an action RPG with a vast open world and a focus on tactical combat. As the Inquisitor, lead a team of diverse characters to save Thedas from a demonic threat, making impactful choices that shape the world.",
      "imageUrl": "https://images3.alphacoders.com/555/555170.jpg"
    },
    {
      "TITLE": "Nine Sols",
      "STATUS": "",
      "GENRE": "Action RPG - Soulslike",
      "CONSOLE": "",
      "TIME TO BEAT": "30hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "",
      "DESCRIPTION": "Nine Sols is an action RPG - Soulslike game with a unique blend of Taiwanese Taoism and cyberpunk elements. Explore a hand-drawn world, battle challenging enemies, and uncover the secrets of an ancient civilization.",
      "imageUrl": "https://images.alphacoders.com/129/1296794.jpg"
    },
    {
      "TITLE": "The Outer Worlds",
      "STATUS": "",
      "GENRE": "RPG",
      "CONSOLE": "",
      "TIME TO BEAT": "40hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/the-outer-worlds",
      "DESCRIPTION": "The Outer Worlds is an action RPG with a retro-futuristic art style, set in a colony far from Earth. Explore a vibrant world, make impactful choices, and build a crew of quirky characters in this darkly humorous adventure.",
      "imageUrl": "https://images3.alphacoders.com/104/thumb-1920-1042708.jpg"
    },
    {
      "TITLE": "We Happy Few",
      "STATUS": "",
      "GENRE": "Action Adventure",
      "CONSOLE": "",
      "TIME TO BEAT": "66hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/we-happy-few",
      "DESCRIPTION": "We Happy Few is an action-adventure game set in a dystopian English city in the 1960s with a striking, stylized art style. As one of the 'Downers' trying to escape, navigate a society dependent on a happiness-inducing drug, and uncover dark secrets.",
      "imageUrl": "https://images6.alphacoders.com/721/721399.png"
    },
    {
      "TITLE": "The Wandering Village",
      "STATUS": "",
      "GENRE": "Simulation",
      "CONSOLE": "",
      "TIME TO BEAT": "18hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/the-wandering-village",
      "DESCRIPTION": "The Wandering Village is a city-building simulation game with a unique concept: build a village on the back of a giant, wandering creature. Manage resources, research technologies, and form a symbiotic relationship with your host in a beautifully realized world.",
      "imageUrl": "https://images8.alphacoders.com/127/1270169.jpg"
    },
    {
      "TITLE": "As Dusk Falls",
      "STATUS": "",
      "GENRE": "Adventure",
      "CONSOLE": "",
      "TIME TO BEAT": "15hrs",
      "Playability": "",
      "COMPLETED?": "",
      "LINK": "https://www.igdb.com/games/as-dusk-falls",
      "DESCRIPTION": "As Dusk Falls is an interactive drama adventure game with a distinctive rotoscoped art style. Explore the intertwined lives of two families across decades, making impactful choices that determine their fates in this gripping narrative.",
      "imageUrl": "https://cdna.artstation.com/p/assets/images/images/052/611/824/4k/amit-ginni-patpatia-screen-2560x1440-2022-08-11-14-12-42png09.jpg?1660231929"
    }
]