[
  {
    "Link": "https://www.justwatch.com/us/tv-show/utopia-2013",
    "GENRE": "Comedy, Science-Fiction, Action & Adventure, Drama, Made in Europe, Mystery Thriller",
    "TITLE": "Utopia (2013)",
    "STATUS": "🟢",
    "RUNTIME": "00:52",
    "OwnerShip": "PRIME",
    "DESCRIPTION": "\"Utopia,\" a British conspiracy thriller that premiered in 2013, is known for its distinctive visual style, its darkly satirical tone, and its grippingly suspenseful narrative. Created by Dennis Kelly, the series follows a group of seemingly unconnected strangers who find their lives violently intertwined when they come into possession of an original manuscript for a legendary graphic novel called 'The Utopia Experiments.' This novel is rumored to predict catastrophic events and conspiracies, and its contents are highly sought after by a shadowy and ruthless organization known as 'The Network.'\n\nAs the group of strangers – including a comic book enthusiast, an IT consultant, a young teenager, and others – try to decipher the meaning of the manuscript and protect themselves from the relentless pursuit of The Network, they uncover a disturbing conspiracy with far-reaching implications for humanity's future. The series is celebrated for its striking cinematography, its bold use of color, its atmospheric soundtrack, and its ability to blend moments of dark humor with intense violence and paranoia. While the show was praised for its originality and its thought-provoking themes, it also generated controversy for its graphic content. Despite its relatively short run, 'Utopia' has garnered a cult following for its unique and unsettling vision of a world threatened by powerful forces operating in the shadows. This series is available for streaming on Prime Video.\" ",
    "LAST WATCHED": "",
    "Max Episodes": "10 weeks, 10 episodes",
    "Series Length": "2 seasons, 6 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/marvels-cloak-and-dagger",
    "GENRE": "Action & Adventure, Drama, Science-Fiction, Young Adult Drama, Superhero",
    "TITLE": "Marvel's Cloak & Dagger (2018)",
    "STATUS": "",
    "RUNTIME": "00:42",
    "imageUrl": "https://c4.wallpaperflare.com/wallpaper/91/409/316/marvel-s-cloak-dagger-2018-tv-series-wallpaper-preview.jpg",
    "OwnerShip": "Hulu",
    "DESCRIPTION": "\"Marvel's Cloak & Dagger,\" which premiered in 2018, tells the story of two teenagers, Tandy Bowen (Olivia Holt) and Tyrone Johnson (Aubrey Joseph), who come to realize they possess newly acquired superpowers that are mysteriously connected. Hailing from vastly different backgrounds, Tandy is a privileged young woman who can create daggers of light, while Tyrone is a young man from a disadvantaged neighborhood with the ability to engulf others in darkness and teleport.\n\nSet in New Orleans, the series explores the complexities of their intertwined lives and the challenges they face as they grapple with their newfound abilities. The show delves into themes of social justice, race, class, and trauma, providing a more grounded and character-driven perspective within the superhero genre. While it is set within the Marvel universe, it offers a standalone narrative with its own unique tone and style. 'Marvel's Cloak & Dagger' presents a compelling story of two individuals who must learn to control their powers and understand their connection to each other, all while navigating the difficulties of adolescence and the harsh realities of their city, available on Hulu.\" ",
    "LAST WATCHED": "",
    "Max Episodes": "10 weeks, 10 episodes",
    "Series Length": "2 seasons, 10 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/ahsoka",
    "GENRE": "Drama, Fantasy, Science-Fiction, Action Adventure",
    "TITLE": "Ahsoka (2023)",
    "STATUS": "",
    "RUNTIME": "00:45",
    "imageUrl": "https://images8.alphacoders.com/132/1329213.jpeg",
    "OwnerShip": "Disney+",
    "DESCRIPTION": "\"Ahsoka,\" which premiered in 2023, expands the Star Wars universe with a focus on the fan-favorite character Ahsoka Tano, a former Jedi Knight who was once the Padawan of Anakin Skywalker. Set after the events of 'Star Wars Rebels' and 'The Mandalorian,' the series follows Ahsoka as she navigates a galaxy still grappling with the aftermath of the Empire's fall and the rising threats that emerge. Rosario Dawson reprises her role as Ahsoka, bringing the character from animation into live-action.\n\nThe narrative centers on Ahsoka's pursuit of Grand Admiral Thrawn, a cunning and strategic Imperial officer who poses a significant danger to the fragile peace of the New Republic. The series also introduces new characters and revisits familiar faces, exploring Ahsoka's past, her relationships, and her ongoing journey as a powerful Force user. The series blends elements of action, adventure, and political intrigue, staying true to the spirit of Star Wars while carving out its own distinct storyline. Available on Disney+, 'Ahsoka' offers a compelling and visually rich addition to the Star Wars saga, appealing to both dedicated fans and those new to the franchise.\" ",
    "LAST WATCHED": "se1",
    "Max Episodes": "10 weeks, 10 episodes",
    "Series Length": "2 seasons, 8 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/fallout-2023",
    "GENRE": "Drama, Science-Fiction, Post Apocalyptic World, Action Adventure",
    "TITLE": "Fallout (2024)",
    "STATUS": "",
    "RUNTIME": "00:59",
    "imageUrl": "https://4kwallpapers.com/images/wallpapers/fallout-movie-3440x1440-16730.jpg",
    "OwnerShip": "PRIME",
    "DESCRIPTION": "\"Fallout (2024),\" an Amazon Prime Video original series, brings the iconic post-apocalyptic world of the Fallout video game franchise to life in live-action. Set in a retro-futuristic America devastated by nuclear war, the series introduces new characters and stories within the established Fallout universe. While specific plot details may vary, the core narrative revolves around the survivors of this cataclysmic event, some of whom have lived sheltered in underground Vaults designed to protect them from the surface world's radiation and dangers. When these Vault Dwellers emerge, they are confronted with the harsh realities of a transformed landscape, populated by mutated creatures, warring factions, and the remnants of pre-war society.\n\nThe series likely explores themes familiar to fans of the games, such as the struggle for survival, the moral ambiguities of a world without law, and the remnants of American culture twisted by the passage of time and nuclear fallout. Given the source material, viewers can expect a blend of adventure, dark humor, and social commentary, all set against a backdrop of decaying technology and mutated wildlife. 'Fallout (2024)' promises to be a significant addition to the post-apocalyptic genre, offering both fans of the games and newcomers a glimpse into a richly realized and dangerous world.\" ",
    "LAST WATCHED": "se1",
    "Max Episodes": "10 weeks, 10 episodes",
    "Series Length": "1 seasons, 8 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/firefly",
    "GENRE": "Science-Fiction, Drama, Action & Adventure, SYFY Drama",
    "TITLE": "Firefly (2002)",
    "STATUS": "🟢",
    "RUNTIME": "00:47",
    "imageUrl": "https://images7.alphacoders.com/111/1116812.jpg",
    "OwnerShip": "Hulu",
    "DESCRIPTION": "\"Firefly,\" which premiered in 2002, is a beloved and critically acclaimed science fiction series created by Joss Whedon, known for his work on 'Buffy the Vampire Slayer' and his contributions to the Marvel Cinematic Universe. Set 500 years in the future, the show follows the adventures of the crew of Serenity, a 'Firefly'-class spaceship. These are not your typical heroes; they are a group of outcasts, smugglers, and mercenaries who operate on the fringes of civilized space.\n\nThe series stars Nathan Fillion as Malcolm 'Mal' Reynolds, the charismatic captain of Serenity, a veteran of a losing civil war who now makes a living taking on odd jobs and avoiding the authorities. The crew includes his second-in-command, Zoe Washburne (Gina Torres), the pilot Wash (Alan Tudyk), the mercenary Jayne Cobb (Adam Baldwin), the companion Inara Serra (Morena Baccarin), the doctor Simon Tam (Sean Maher), his mysterious sister River (Summer Glau), and the religious Shepherd Book (Ron Glass). Together, they navigate the dangers and opportunities of the 'Verse,' a vast and untamed region of space.\nn'Firefly' is celebrated for its unique blend of science fiction and Western genres, its sharp writing, its complex and relatable characters, and its ability to seamlessly shift between action, humor, and poignant drama. Despite its tragically short run of only one season, the series has garnered a dedicated following and is considered a cult classic for its originality and its enduring appeal. You can find this gem of science fiction storytelling on Hulu.\" ",
    "LAST WATCHED": "",
    "Max Episodes": "10 weeks, 10 episodes",
    "Series Length": "1 season, 14 episodes"
  },
  {
    "Link": " https://www.justwatch.com/us/tv-show/halo",
    "GENRE": "Science-Fiction, Mystery & Thriller, War & Military, SYFY Military, Action Adventure",
    "TITLE": "Halo (2022)",
    "STATUS": "",
    "RUNTIME": "00:52",
    "imageUrl": "https://4kwallpapers.com/images/wallpapers/halo-2022-series-master-chief-natascha-mcelhone-bokeem-3840x2160-7969.jpg",
    "OwnerShip": "Netflix",
    "DESCRIPTION": "\"Halo (2022)\" is a live-action television adaptation of the immensely popular and influential Halo video game franchise. Set in the 26th century, the series plunges viewers into the midst of a galactic war between humanity and the Covenant, a powerful alliance of alien species driven by a fanatical religious belief. The narrative centers on Master Chief Sierra-117, a genetically engineered supersoldier known as a Spartan, who serves as humanity's most formidable weapon against the Covenant. \n\nThe series explores the origins of the Spartans, their rigorous training, and the ethical complexities of their creation. It also delves into the mysteries surrounding the Halo rings, colossal ring-shaped megastructures that hold immense power and significance within the conflict. While staying true to the core elements of the Halo universe – including the iconic characters, weapons, and settings – the television adaptation aims to offer a fresh perspective on the established lore. It examines the human cost of war, the nature of heroism, and the potential for both unity and division in the face of overwhelming odds. Available on Netflix, 'Halo (2022)' brings the epic scale and action-packed battles of the games to the small screen, offering a compelling narrative for both longtime fans and those new to the franchise.\" ",
    "LAST WATCHED": "",
    "Max Episodes": " 10 weeks, 10 episodes",
    "Series Length": "2 seasons, 8 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/kingdom-2019",
    "GENRE": "Action & Adventure, Drama, Horror, Thriller, Period Piece",
    "TITLE": "Kingdom (2019)",
    "STATUS": "🟢",
    "RUNTIME": "00:50",
    "imageUrl": "https://w0.peakpx.com/wallpaper/89/350/HD-wallpaper-tv-show-kingdom-2019.jpg",
    "OwnerShip": "Netflix",
    "DESCRIPTION": "\"Kingdom,\" a South Korean period horror thriller series released on Netflix in 2019, offers a unique and captivating blend of historical drama and zombie apocalypse. Set during Korea's medieval Joseon dynasty, the story follows Crown Prince Lee Chang, played by Ju Ji-hoon, who becomes embroiled in a political conspiracy and a desperate struggle against a mysterious plague that is rapidly turning the population into ravenous undead.\n\nAs the kingdom grapples with political turmoil and the threat of a zombie outbreak, the Crown Prince is sent on a perilous mission to investigate the origins of the disease. He uncovers a sinister plot that threatens to destabilize the entire nation, even as the number of infected grows exponentially. The series is celebrated for its stunning cinematography, its intricate period costumes and sets, and its thrilling action sequences, particularly the intense and fast-paced battles against the hordes of undead. 'Kingdom' also delves into themes of power, corruption, and the resilience of the human spirit in the face of unimaginable horror. With its compelling narrative and its fusion of historical setting with the zombie genre, this series offers a fresh and exciting take on both, making it a standout on Netflix for fans of period dramas and horror alike.\" ",
    "LAST WATCHED": "",
    "Max Episodes": "12 episodes",
    "Series Length": "2 seasons, 6 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/loki",
    "GENRE": "Action & Adventure, Drama, Fantasy, Science-Fiction, Superhero",
    "TITLE": "Loki (2021)",
    "STATUS": "",
    "RUNTIME": "54min",
    "imageUrl": "https://images4.alphacoders.com/138/1385082.jpg",
    "OwnerShip": "Disney+",
    "DESCRIPTION": "The mercurial villain Loki resumes his role as the God of Mischief in a new series that takes place after the events of \"Avengers: Endgame.\"",
    "LAST WATCHED": "se2",
    "Max Episodes": "12 episodes",
    "Series Length": "2 seasons, 6 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/mr-and-mrs-smith-2024",
    "GENRE": "Action & Adventure, Comedy, Drama, Romance, Spy Thriller",
    "TITLE": "Mr. & Mrs. Smith (2024)",
    "STATUS": "",
    "RUNTIME": "50min",
    "imageUrl": "https://hips.hearstapps.com/hmg-prod/images/maya-erskine-donald-glover-mr-and-mrs-smith-65a0101375261.jpg?crop=1.00xw:0.846xh;0,0.0296xh",
    "OwnerShip": "Amazon Prime",
    "DESCRIPTION": "Two lonely strangers land jobs working for a mysterious spy agency that offers them a glorious life of espionage, wealth, world travels, and a dream brownstone in Manhattan. The catch? New identities in an arranged marriage as Mr. and Mrs. John and Jane Smith.",
    "LAST WATCHED": "se1",
    "Max Episodes": "8 episodes",
    "Series Length": "1 season, 8 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/tales-from-the-loop",
    "GENRE": "Drama, Science-Fiction, Mystery & Thriller, Emotional Drama",
    "TITLE": "Tales from the Loop (2020)",
    "STATUS": "",
    "RUNTIME": "53min",
    "imageUrl": "https://wallpapercave.com/wp/wp8377950.jpg",
    "OwnerShip": "Amazon Prime",
    "DESCRIPTION": "The townspeople who live above \"The Loop,\" a machine built to unlock and explore the mysteries of the universe, experience things previously consigned to the realm of science fiction.",
    "LAST WATCHED": "se1",
    "Max Episodes": "8 episodes",
    "Series Length": "1 season, 8 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/the-boys",
    "GENRE": "Action & Adventure, Comedy, Drama, Science-Fiction, Superhero",
    "TITLE": "The Boys (2019)",
    "STATUS": "",
    "RUNTIME": "60min",
    "imageUrl": "https://images.alphacoders.com/136/thumb-1920-1362150.jpeg",
    "OwnerShip": "Amazon Prime",
    "DESCRIPTION": "A group of vigilantes known informally as \"The Boys\" set out to take down corrupt superheroes with no more than blue-collar grit and a willingness to fight dirty.",
    "LAST WATCHED": "se3",
    "Max Episodes": "24 episodes",
    "Series Length": "3 seasons, 8 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/the-changeling",
    "GENRE": "Drama, Fantasy, Horror, Mystery & Thriller",
    "TITLE": "The Changeling (2023)",
    "STATUS": "",
    "RUNTIME": "60min",
    "imageUrl": "https://www.apple.com/tv-pr/shows-and-films/t/the-changeling/images/season-01/show-home-graphic-header/key-art-01/4x1/Apple_TV_The_Changeling_key_art_graphic_header_4_1_show_home.jpg",
    "OwnerShip": "Apple TV+",
    "DESCRIPTION": "A fairytale for grown-ups. A horror story, a parenthood fable and a perilous odyssey through a New York City you didn't know existed.",
    "LAST WATCHED": "",
    "Max Episodes": "8 episodes",
    "Series Length": "1 season, 8 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/the-witcher",
    "GENRE": "Action & Adventure, Drama, Fantasy, Science-Fiction",
    "TITLE": "Witcher (2019)",
    "STATUS": "",
    "RUNTIME": "60min",
    "imageUrl": "https://w0.peakpx.com/wallpaper/98/966/HD-wallpaper-the-witcher-2019-yennefer-freya-allan-man-poster-anya-chalotra-actress-the-witcher-people-ciri-pink-tv-series-actor-henry-cavill-pinj.jpg",
    "OwnerShip": "Subscription",
    "DESCRIPTION": "Geralt of Rivia, a mutated monster-hunter for hire, journeys toward his destiny in a turbulent world where people often prove more wicked than beasts.",
    "LAST WATCHED": "se2",
    "Max Episodes": "3",
    "Series Length": "3 seasons, 8 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/3-body-problem",
    "GENRE": "Drama, Mystery & Thriller, Science-Fiction",
    "TITLE": "3 Body Problem (2024)",
    "STATUS": "",
    "RUNTIME": "55min",
    "imageUrl": "https://www.mrstebo.co.uk/content/images/size/w1200/2024/04/mrstebo_a_synthwave_image_demonstrating_the_three-body_problem_d789e5df-6758-4255-a244-71245eafeb8f.png",
    "OwnerShip": "Subscription",
    "DESCRIPTION": "A young woman's fateful decision in 1960s China reverberates across space and time to a group of brilliant scientists in the present day. As the laws of nature unravel before their eyes, five former colleagues reunite to confront the greatest threat in humanity's history.",
    "LAST WATCHED": "se1",
    "Max Episodes": "8 episodes",
    "Series Length": "1 season, 8 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/american-gods",
    "GENRE": "Drama, Fantasy, Mystery & Thriller, Science-Fiction",
    "TITLE": "American Gods (2017)",
    "STATUS": "",
    "RUNTIME": "01:00",
    "imageUrl": "https://images.static-bluray.com/movies/covers/298424_front.jpg",
    "OwnerShip": "Buy",
    "DESCRIPTION": "\"American Gods,\" which premiered in 2017, is a visually stunning and conceptually ambitious series based on Neil Gaiman's acclaimed fantasy novel of the same name. The show intricately weaves together elements of mythology, fantasy, and contemporary drama to present a unique and captivating narrative. At its core, 'American Gods' explores the ongoing conflict between the Old Gods of mythology – deities from various ancient pantheons brought to America by immigrants – and the New Gods of modern society, who represent concepts like technology, media, and celebrity.\n\nThe series follows Shadow Moon (Ricky Whittle), a recently released ex-convict who becomes the bodyguard and traveling partner of the mysterious Mr. Wednesday (Ian McShane). As Shadow travels with Wednesday, he is drawn into a hidden world where the Old Gods are real and are struggling to maintain their power against the rising influence of the New Gods. The show features a rich tapestry of characters, including the seductive Bilquis (Yetide Badaki), the fiery Mad Sweeney (Pablo Schreiber), and the enigmatic Laura Moon (Emily Browning), among many others.\n\n'American Gods' is celebrated for its striking visual style, its bold and often surreal imagery, its thought-provoking exploration of cultural identity and belief systems, and its complex character dynamics. While the series faced some production challenges and changes in showrunners, it offers a unique and imaginative take on the clash between tradition and modernity, making it a compelling watch for fans of fantasy and thought-provoking drama. The series originally aired on Starz.\" ",
    "LAST WATCHED": "",
    "Max Episodes": "26 episodes",
    "Series Length": "3 seasons, 10 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/marvels-runaways",
    "GENRE": "Action & Adventure, Drama, Science-Fiction, Superhero",
    "TITLE": "MARVELS Runaways (2017)",
    "STATUS": "🟢",
    "RUNTIME": "50min",
    "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2017/10/Runaways.jpg",
    "OwnerShip": "Hulu",
    "DESCRIPTION": "Six teenagers discover that their parents are secretly members of a supervillain cabal called The Pride. After deciding they're no longer safe in their own homes, the kids go on the run. In the midst of hiding from their elders, the teens learn about themselves and become a cohesive unit to take down The Pride.",
    "LAST WATCHED": "se1",
    "Max Episodes": "33 episodes",
    "Series Length": "3 seasons, 10 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/shogun-2024",
    "GENRE": "Action & Adventure, Drama, History, War & Military",
    "TITLE": "SHOGUN (2024)",
    "STATUS": "",
    "RUNTIME": "01:00",
    "imageUrl": "https://images6.alphacoders.com/135/1354311.jpeg",
    "OwnerShip": "Hulu",
    "DESCRIPTION": "\"SHOGUN (2024)\" is a historical drama series that transports viewers to feudal Japan, a land of samurai, lords, and intricate political maneuverings. The story unfolds as a mysterious European ship washes ashore in a remote fishing village. This unexpected arrival sets in motion a chain of events that could drastically alter the balance of power in the nation.\n\nLord Yoshii Toranaga, a powerful and cunning daimyo (feudal lord), recognizes the significance of the secrets the ship carries. These secrets have the potential to tip the scales in his favor, allowing him to outmaneuver his enemies and solidify his position as Shogun, the supreme military ruler of Japan. The series likely delves into themes of honor, loyalty, ambition, and the clash of cultures as the European presence intersects with the established traditions and conflicts of feudal Japan. Expect a visually rich and compelling narrative filled with political intrigue, intense battles, and the exploration of complex characters navigating a pivotal moment in Japanese history. This series is available for streaming on Hulu.\" ",
    "LAST WATCHED": "",
    "Max Episodes": "10 episodes",
    "Series Length": "1 season, 10 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/the-bear",
    "GENRE": "Comedy, Drama, Food & Cooking",
    "TITLE": "THE BEAR (2022)",
    "STATUS": "🟢",
    "RUNTIME": "00:30",
    "imageUrl": "https://images3.alphacoders.com/132/1324977.jpeg",
    "OwnerShip": "Hulu/FX",
    "DESCRIPTION": "\"THE BEAR,\" which premiered in 2022, is a critically acclaimed comedy-drama series that offers a raw and intense look into the world of professional cooking and the personal struggles of those who inhabit it. The show centers on Carmen 'Carmy' Berzatto (Jeremy Allen White), a young and highly skilled chef from the world of fine dining who returns to his hometown of Chicago to take over his family's struggling Italian beef sandwich shop after a tragic death.\n\nCarmy's transition from the rarefied atmosphere of Michelin-starred restaurants to the chaotic and pressure-cooker environment of a small, family-owned establishment is the driving force of the narrative. He faces the challenges of managing a stubborn and resistant staff, dealing with the shop's financial woes, and grappling with his own grief and personal demons. The series explores themes of family, ambition, loss, and the relentless pursuit of culinary perfection.\n\n'THE BEAR' is praised for its visceral portrayal of the restaurant industry, its dynamic pacing, its authentic Chicago setting, and the compelling performances of its cast, including Ebon Moss-Bachrach, Ayo Edebiri, and Oliver Platt. The show's ability to blend moments of high-stress intensity with moments of quiet vulnerability has resonated with audiences and critics alike, establishing it as a standout drama with a unique comedic edge, available on Hulu/FX.\" ",
    "LAST WATCHED": "",
    "Max Episodes": "18 episodes",
    "Series Length": "2 seasons, 10 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/true-detective",
    "GENRE": "Crime, Drama, Mystery & Thriller",
    "TITLE": "True Detective (2014)",
    "STATUS": "",
    "RUNTIME": "60min",
    "imageUrl": "https://wallpapercat.com/w/full/e/1/5/1855349-2560x1440-desktop-hd-true-detective-tv-series-wallpaper-image.jpg",
    "OwnerShip": "HBO/Max",
    "DESCRIPTION": "An American anthology police detective series utilizing multiple timelines in which investigations seem to unearth personal and professional secrets of those involved, both within or outside the law.",
    "LAST WATCHED": "se4",
    "Max Episodes": "32 episodes",
    "Series Length": "4 seasons, 8 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/wu-tang-an-american-saga",
    "GENRE": "Drama, Music, Biography",
    "TITLE": "Wu-Tang: An American Saga (2019)",
    "STATUS": "",
    "RUNTIME": "00:50",
    "imageUrl": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/02/wu-tang-an-american-saga.jpg",
    "OwnerShip": "Hulu",
    "DESCRIPTION": "\"Wu-Tang: An American Saga,\" which premiered in 2019, is a compelling drama series that chronicles the formation and rise of the iconic hip-hop group, the Wu-Tang Clan. Set in the early 1990s, the series delves into the gritty realities of Staten Island, New York, where the Wu-Tang Clan emerged from a backdrop of poverty, crime, and the pervasive crack cocaine epidemic. The narrative focuses on how these young men, united by their passion for music and their desire to escape their circumstances, came together to forge a unique and revolutionary sound that would forever change the landscape of hip-hop.\n\nThe series explores the individual backgrounds and struggles of the group's members, including RZA, GZA, Ol' Dirty Bastard, Method Man, Raekwon, Ghostface Killah, Inspectah Deck, U-God, and Masta Killa. It portrays the challenges they faced, from navigating the dangerous streets and dealing with rival gangs to finding their artistic voice and overcoming personal obstacles. 'Wu-Tang: An American Saga' is praised for its realistic depiction of the era, its powerful performances, and its exploration of the complex social and cultural forces that shaped the Wu-Tang Clan's music and their enduring legacy. Available on Hulu, this series offers a captivating blend of music, drama, and biography, providing a nuanced and insightful look into the origins of one of hip-hop's most influential groups.\" ",
    "LAST WATCHED": "se1",
    "Max Episodes": "30 episodes",
    "Series Length": "3 seasons, 10 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/american-conspiracy-the-octopus-murders",
    "GENRE": "Documentary, Crime, History",
    "TITLE": "American Conspiracy (2024)",
    "STATUS": "",
    "RUNTIME": "00:45",
    "imageUrl": "https://images.justwatch.com/backdrop/312296090/s640/american-conspiracy-the-octopus-murders",
    "OwnerShip": "Netflix",
    "DESCRIPTION": "\"American Conspiracy: The Octopus Murders,\" a 2024 Netflix documentary series, delves into a chilling and complex case that has fueled speculation and controversy for decades. The series centers on the death of journalist Danny Casolaro, who was found dead in a West Virginia hotel room in 1991. While authorities ruled his death a suicide, Casolaro's family and friends strongly suspect foul play, believing he was murdered to silence his investigation into a vast and shadowy conspiracy he called 'The Octopus.'\n\nCasolaro was pursuing a story that connected a series of seemingly unrelated events, including government surveillance, stolen software, and unsolved murders. He claimed to have uncovered a network of powerful individuals and organizations involved in a far-reaching cover-up. The series likely explores the evidence Casolaro was gathering, the people he was interviewing, and the obstacles he encountered in his pursuit of the truth. It will also examine the circumstances surrounding his death and the lingering questions that continue to fuel the belief that it was not a suicide.\n\nThrough interviews, archival footage, and investigative analysis, 'American Conspiracy: The Octopus Murders' aims to shed light on this enduring mystery. It will likely appeal to viewers interested in true crime, conspiracy theories, and the exploration of power and corruption within society. The series offers a deep dive into a case that raises unsettling questions about the lengths to which some might go to protect their secrets.\" ",
    "LAST WATCHED": "",
    "Max Episodes": "6 episodes",
    "Series Length": "1 season, 6 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/the-program-unraveling-sex-ed",
    "GENRE": "Documentary, Crime",
    "TITLE": "The Program (2024)",
    "STATUS": "",
    "RUNTIME": "01:00",
    "imageUrl": "https://resizing.flixster.com/s-EXGGySW766OuNVEWmkPks6fI4=/fit-in/705x460/v2/https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/p26774273_b_h8_ab.jpg",
    "OwnerShip": "HBO/Max",
    "DESCRIPTION": "\"The Program (2024)\" is a documentary series that delves into the disturbing realities of the 'troubled teen industry.' Specifically, the series focuses on Ivy Ridge Academy, one such institution that operated under the guise of providing therapeutic intervention for adolescents. Through the firsthand accounts of former students, the documentary exposes a pattern of systemic abuse and mistreatment that occurred within these facilities.\n\nThe narrative likely unfolds through interviews and archival footage, piecing together the experiences of those who were subjected to the program's methods. The series promises to unveil horrific claims, including psychological and physical abuse, solitary confinement, sexual misconduct, and forced manual labor. By centering the story on the indelible memories of former students, 'The Program (2024)' aims to provide a powerful and unsettling exposé of the practices that were employed within Ivy Ridge Academy and, by extension, the broader industry of programs claiming to offer behavioral correction for troubled youth. This documentary is likely to be a challenging but important watch, raising questions about accountability, the definition of 'therapy,' and the protection of vulnerable individuals within these systems. It is available for viewing on HBO/Max.\" ",
    "LAST WATCHED": "",
    "Max Episodes": "3 episodes",
    "Series Length": "1 season, 3 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/wild-wild-country",
    "GENRE": "Documentary, Crime, Religion & Spirituality",
    "TITLE": "Wild Wild Country (2018)",
    "STATUS": "",
    "RUNTIME": "01:05",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYmRhZWNmN2UtNGQ1MC00MGI5LTgxMmUtNmU4NTRmODQ5ODU0XkEyXkFqcGc@._V1_.jpg",
    "OwnerShip": "Netflix",
    "DESCRIPTION": "\"Wild Wild Country,\" a gripping 2018 Netflix documentary series, chronicles the stranger-than-fiction story of the controversial Rajneesh movement and its establishment of a utopian city in the Oregon desert. The series delves into the complex and often conflicting perspectives of the movement's followers, the local residents of the surrounding community, and the escalating tensions that ultimately led to a national scandal.\n\nAt the center of the narrative is Bhagwan Shree Rajneesh, the charismatic and enigmatic spiritual leader who attracted thousands of followers from around the world. His right-hand woman, Ma Anand Sheela, becomes a powerful and polarizing figure, managing the day-to-day operations of the commune and fiercely defending its interests. The documentary explores the movement's rise, its clashes with the established social order of Oregon, and the increasing paranoia and criminal activity that marked its decline.\n\nThrough archival footage, news reports, and interviews with former members and local residents, 'Wild Wild Country' paints a nuanced and compelling portrait of a unique chapter in American history. It examines themes of religious devotion, power, conflict, and the clash between utopian ideals and the realities of human nature, offering a thought-provoking exploration of a community that challenged the boundaries of societal norms. This six-part series is a captivating and often unsettling look at a story that continues to fascinate and confound viewers.\" ",
    "LAST WATCHED": "",
    "Max Episodes": "6 episodes",
    "Series Length": "1 season, 6 episodes"
  },
  {
    "Link": "https://www.justwatch.com/us/tv-show/you-are-what-you-eat-a-twin-experiment",
    "GENRE": "Documentary, Food & Cooking, Reality TV",
    "TITLE": "You are what you eat (2024)",
    "STATUS": "",
    "RUNTIME": "00:40",
    "imageUrl": "https://ceufast.com/imgs/healthy_eating_habits_you_are_what_you_eat_1140px.jpg",
    "OwnerShip": "Netflix",
    "DESCRIPTION": "\"You Are What You Eat: A Twin Experiment,\" released in 2024 on Netflix, is a documentary series that takes a unique approach to exploring the impact of diet on the human body. The series centers around a scientific experiment involving identical twins who are placed on different, strictly controlled diets over an eight-week period. This setup allows researchers to isolate the effects of specific food choices while minimizing genetic variations, as identical twins share nearly identical DNA.\n\nThe documentary likely follows the twins' journeys as they adhere to their assigned dietary plans, which may include comparing plant-based and omnivorous diets. The series will likely showcase the observed changes in their health, physical fitness, and overall well-being. By tracking various physiological markers and gathering data from the twins, the series aims to provide insights into how different food choices can influence factors such as energy levels, metabolism, cardiovascular health, and even gut microbiome composition.\n\nBeyond the scientific findings, 'You Are What You Eat: A Twin Experiment' may also delve into the practical aspects of dietary changes, exploring the challenges and successes the twins encounter while adjusting to their new lifestyles. It could also touch upon the broader implications of dietary choices for individual health and public health, prompting viewers to consider the relationship between food and their own well-being. This documentary series offers a blend of scientific investigation and real-life experiences, providing a potentially informative and engaging look at the power of diet.\" ",
    "LAST WATCHED": "",
    "Max Episodes": "4 episodes",
    "Series Length": "1 season, 4 episodes"
  }
]