[
  {"title": "30 Minute Full Body Cardio HIIT Workout [NO REPEAT]",
    "active": "",
    "channel": "Juice & Toya",
    "time": "34:42",
    "type": "Cardio, HIIT",
    "decription": "Get ready for a fast-paced, 30-minute full-body cardio HIIT session designed to get your heart rate up right in your own home. You won't need any equipment, just some space to move, as Juice & Toya guide you through the routine from their bright, indoor workout area. The format involves 20 different exercises, each performed for 25 seconds, followed by a quick 10-second pause, and then another 25 seconds of a variation on that same exercise before a 20-second rest. Since there are no repeats across the main 20 exercises, you can expect a dynamic workout that keeps things interesting from start to finish. 🔥",
    "equipment": "None",
    "imageUrl":"https://shoutoutla.s3.us-west-1.amazonaws.com/wp-content/uploads/2021/08/c-PersonalLaToyaJuliusJohnsonWhite__JuiceAndToya_1620867465554.jpg",
    "link": "https://www.youtube.com/watch?v=tgm_QjUiwlk"
  },
  {"title": "20 Minute Full Body Cardio HIIT Workout [NO REPEAT]",
    "active": "",
    "channel": "Juice & Toya",
    "time": "27:05",
    "type": "Cardio, HIIT",
    "decription": "If you're looking for a quick and intense workout, this video offers a 20-minute cardio HIIT session led by Juice and Toya. You won't need any equipment as it's entirely bodyweight-based, making it easy to do anywhere. They appear to be filming in a home gym setting and are dressed in athletic attire ready for the workout. Expect a challenging format consisting of two rounds of nine different exercises, pushing you through 45 seconds of work followed by just 15 seconds of rest for each move, with a short 30-second breather between the two rounds. It's designed to get your heart pumping and burn fat efficiently in a short amount of time.",
    "equipment": "None",
    "imageUrl":"https://shoutoutla.s3.us-west-1.amazonaws.com/wp-content/uploads/2021/08/c-PersonalLaToyaJuliusJohnsonWhite__JuiceAndToya_1620867465554.jpg",
    "link": "https://www.youtube.com/watch?v=5dImGG-r7DU&t=544s"
  },
  {"title": "25 Minute Full Body Dumbbell HIIT Workout [ Burn Fat // Build Muscle ]",
    "active": "",
    "channel": "Juice & Toya",
    "time": "31:38",
    "type": "Dumbbell, HIIT",
    "decription": "This 25-minute workout, led by Juice and Toya from their home gym setting, focuses on dumbbell HIIT (High-Intensity Interval Training). All you'll need is a pair of dumbbells, with lighter weights recommended to keep up the intensity. Juice and Toya, dressed in athletic gear, guide you through a structured format consisting of three distinct levels, each containing eight exercises. You'll perform each exercise for 40 seconds followed by a 15-second rest, with a 30-second break between levels. Be prepared for the challenge to increase as you progress through the levels, though modifications are suggested if needed. It's designed to boost your heart rate, burn fat, and build strength simultaneously.",
    "equipment": "Dumbbell",
    "imageUrl":"https://shoutoutla.s3.us-west-1.amazonaws.com/wp-content/uploads/2021/08/c-PersonalLaToyaJuliusJohnsonWhite__JuiceAndToya_1620867465554.jpg",
    "link": "https://www.youtube.com/watch?v=3vjc4afb1Qc"
  },
  {"title": "20 Minute Full Body Tabata Workout [Strength , HIIT, & Cardio/ No Equipment]",
    "active": "",
    "channel": "Juice & Toya",
    "time": "27:37",
    "type": "Tabata, HIIT",
    "decription": "Join Juice and Toya in their home gym setting for a dynamic 20-minute, full-body Tabata workout that requires absolutely no equipment. Dressed in athletic wear, they lead you through a session combining strength, HIIT, and cardio elements. The workout is structured into three groups, each containing four exercises focused on one of those elements. You'll follow the classic Tabata timing: 20 seconds of intense work followed by 10 seconds of rest for each exercise, with a 30-second break between the groups to catch your breath. Modifications are shown, so you can adjust the intensity to your fitness level. ",
    "equipment": "None",
    "imageUrl":"https://shoutoutla.s3.us-west-1.amazonaws.com/wp-content/uploads/2021/08/c-PersonalLaToyaJuliusJohnsonWhite__JuiceAndToya_1620867465554.jpg",
    "link": "https://www.youtube.com/watch?v=cCsQXGvxnDU"
  },
  {"title": "20 Minute Full Body Cardio Workout (High Intensity With Modifications)",
    "active":"" ,
    "channel": "Juice & Toya",
    "time": "23:46",
    "type": "Cardio, HIIT",
    "decription": "Join Juice and Toya in their indoor workout space for an intense 20-minute, full-body cardio session that requires no equipment, though you might want a mat and towel. Juice is wearing a black tank top and shorts, while Toya sports a purple sports bra and black leggings. Expect a high-energy format: you'll tackle three rounds, where each round consists of two sets of five exercises. You'll work for 20 seconds per exercise with no rest breaks within the sets, followed by a 30-second active rest between the sets. To cap it off, there's a final bonus round where you perform all 10 exercises consecutively. Modifications are available if you need them.",
    "equipment": "None",
    "imageUrl":"https://shoutoutla.s3.us-west-1.amazonaws.com/wp-content/uploads/2021/08/c-PersonalLaToyaJuliusJohnsonWhite__JuiceAndToya_1620867465554.jpg",
    "link": "https://www.youtube.com/watch?v=9lVBk1gS6qc"
  }
]
